{
 "title": "4 Minutes",
 "album": "Director",
 "year": "2006-01-01",
 "lyrics": "Hold, hold up, hold up\nSlow, slow down\nListen, give me 10 minutes\nWell, give me 5 minutes...a'ight\nB-before you leave I just need these last 4 minutes\n\nPardon me if I'm talking fast and stumbling all over my words\nI heard you were leavin' town\nI thought I'd be the one to know first\nIf you have a minute let me talk to you and see what's going on\nDon't say it's nothing\nWhen it's gotta be something that's gone wrong\nNow let me explain but I don't know what to say\n'Cause I don't know what the hell happened\nI come in the house to try to work it out\nAnd all you're doing is packing\nClose your suitcase let me think straight\nDamn, what could be the reason\nBaby talk to me I'm almost out of time\n\nI only got 4 minutes to do what I gotta do\nTo prove to you that I'm gon' do anything\nOnly got 4 minutes say what I gotta say to make you stay\nAnd show you that I done changed\n'Cause in 4 minutes\nI'll never have my girl again\nIn 4 minutes\nI'm a lose her to some other man\n4 no less no more\nI'm desperate cause the clock's ticking\nOnly got 4 minutes to go\n\nWho are these people I don't know in my house?\nAnd they scratching my floors\nTakin' furniture outside and the U-Haul pull up to my door\nWhat's the reason that I get this feelin'\nThat you can't keep it real with me?\nIs it cause of the prior relationships I had off in the streets?\nNever mind that this is your conscience speaking\nAnd you need to get your girl back\nYou gotta find a way to try to get to her heart\nI'm takin' suggestions I've learned my lesson\nThink conscience you're my last lifeline\nI'm down to my last second\n\nI only got 4 minutes to do what I gotta do\nTo prove to you that I'm gon' do anything\nOnly got 4 minutes say what I gotta say to make you stay\nAnd show you that I done changed\n'Cause in 4 minutes\nI'll never have my girl again\nIn 4 minutes\nI'm a lose her to some other man\n4 no less no more\nI'm desperate cause the clock's ticking\nOnly got 4 minutes to go\n\nI've done things in my past\nI thought this love would last\nBut I can't let you go baby\nYou're my everything lady\nThe reason I smile and the reason I talk baby\nThe reason I breathe\nThe only one for me, yeah\nYou can't go through with this\nIf you left me my life wouldn't exist\nCause I'm still in love with you\nAnd that's my word I don't give a damn what you heard\nOh, baby I'll be true\n\nI only got 4 minutes\nAnd I'm running out of time\nI only got 4 minutes\nI only got 4 minutes\n4 minutes I'll never have my girl again\nIn 4 minutes I'm a lose her to some other man\n4 no less no more\nCause the clocks ticking\nOnly got 4 minutes to go\n\nOnly got 4 minutes to tell you everything I love about you\n4 minutes to say I need you, I can't live without you\nI'm out of time gotta say what's on my mind\nJust to keep you in my life\nAw, damn I'm outta time",
 "image": "https://images.genius.com/d91120f7230f222d79a3322bff9fbbbe.544x544x1.jpg"
}