{
 "title": "Back Like That",
 "album": "Fishscale",
 "year": "2006-02-28",
 "lyrics": "Damn\nDamn, ma, we ain't even have to go through it like that, it wasn't really even that big, man\nYou know? Nah, it's alright, though\nBut anyway, yo, let me get that coat\nLet me get those jeans and let me get that rock on your finger\nOh, it's stuck? Then I'll take the whole finger than, man\nAnd let me get those bags from Paris\nAnd the puppies is staying, yo\n\nCome through the block in his brand new Benz\nKnowing that me and that nigga ain't friends (Okay, girl)\nYeah, what I did was wack\nBut you don't get a nigga back like that\nBouncin' around when I'm up in these streets\nKnowing that me and that nigga got beef (Okay, girl)\nYeah, what I did was wack\nBut you don't get a nigga back like that, no (Yo)\n\nAyo, I should just bark on you, burn your car on you\n'Cause I'm too much man to leave a mark on you\nYou's a bird, you know that\nGivin' that man ten points like he about to blow that\nHe probably did, you swallow his kids?\nIn and out of jail, he a snail, he wasn't wilding on bids\nIn the summertime, I broke his jaw\nHad to do it to him quick, old fashioned, in the back of the mall\nMe and him had 'mos forever\nLike I'm 'posed to put him on when he came home and told on Trevor\nHad to bang on homie, ear blocks, out in spots\nThrowing them shots, like, \"Nigga, you know me\"\nStop fronting for them niggas outside like you really ride\nAnd you a silly chick, thought you was really live\nBut I guess I was wrong, I'ma holla at dog\nAnd rip his head off, word, yo, it's on\n\nCome through the block in his brand new Benz (Yeah)\nKnowing that me and that nigga ain't friends (Okay, girl, that's right)\nYeah, what I did was wack (Uh-huh, yeah)\nBut you don't get a nigga back like that (Yeah, I'ma work him out)\nBouncin' around when I'm up in these streets (Uh-huh)\nKnowing that me and that nigga got beef (Tell him son, yeah, okay, girl)\nYeah, what I did was wack (Yeah, this is how we do)\nBut you don't get a nigga back like that, no (Yo)\n\nAyo, I thought we was iller than that\nAll them kisses and love yous, when jake came, you hid my packs\nIt was time a nigga went to war\nVest banged up, standin' in the kitchen, yo, holding a four\nSweatin' and breathing, bounced out of town for a weekend\nHeard you had homie in the passenger seatin'\nHoney, look, I'm a monster don\nI do monster things, that's why I put your ass under my arm\nFuckin' with him can bring bodily harm\nAnd where you gon' hide in the streets when the body is gone?\nIf it's one thing I learned that\nNever trust a female on no scale, you just confirmed that\nBounce to your mama house, pack your shit\nI don't care if you crying, you's a ruthless chick\nGots to watch you, these eyeballs in my face'll spot you\nMy girl cousins, they gon' rock you\n\nCome through the block in his brand new Benz (Uh-huh)\nKnowing that me and that nigga ain't friends (Yeah, okay, girl)\nYeah, what I did was wack (Told you)\nBut you don't get a nigga back like that (I'm a good dude, you see?)\nBouncin' around when I'm up in these streets (Yeah)\nKnowing that me and that nigga got beef (Wanna play games, okay, girl)\nYeah, what I did was wack\nBut you don't get a nigga back like that, no\n\nShorty, what is you thinkin' 'bout? ('Bout)\nDidn't I put you down?\nFlyest whips\nRollin' round like, \"Yeah, that's the boss' chick\"\nOn the side I might of had (Had), one or two (Two)\nBut them silly broads wasn't nothing on you\nRolling with him, tryna get revenge\nThat shit, you just don't do (Uh)\n\nCome through the block in his brand new Benz\nKnowing that me and that nigga ain't friends (Yeah, you see? Okay, girl)\nYeah, what I did was wack (This for the knucklehead)\nBut you don't get a nigga back like that (Females out there that wanna be)\nBouncin' around when I'm up in these streets (Actin' like they gettin' they little revenge off)\nKnowing that me and that nigga got beef (Okay, girl)\nYeah, what I did was wack (Takin' it further than what it really is, you know what I mean?)\nBut you don't get a nigga back like that, no (Playin' yourself)\nCome through the block in his brand new Benz (Know what I mean?)\nKnowing that me and that nigga ain't friends (Okay, girl, this is don status, girl)\nYeah, what I did was wack\nBut you don't get a nigga back like that (You gon' have to hold that now)\nBouncin' around when I'm up in these streets (Word up, and when I see money)\nKnowing that me and that nigga got beef (I'ma hang him upside-down, it's on, okay, girl)\nYeah, what I did was wack\nBut you don't get a nigga back like that, no (And not because of you, neither, you know? Believe that)\n\nIt's real\nYeah, got my swagger back and all that\nTheodore, nigga, Theodore, nigga\nThat's right\nI'll go pop more, I'ma go pop more coochies based on that there",
 "image": "https://images.genius.com/3a186180f442459e32739265d5add288.600x599x1.jpg"
}