{
 "title": "Bedroom Boom",
 "album": "U.S.A. - United State of Atlanta",
 "year": "2005-06-28",
 "lyrics": "Listen baby, sometimes I know I be playin\nBut set aside the bullshit, I'mma grown ass man\nWhats to understand that I love to fuck\nCan I hit it from the back or put ya ass in a buck?\nScreamin Shawty what's up, \nare\n we fuckin' are what\nWe ain't got nothin to discuss I'm simply tryin to bust nuts\nThe temperatures risin', We reachin the bed\nYa eyes begin to roll in the back of ya head\n\nBangin' Headboards, The loud noise, The sound of you screamin\nTurn me on cus it sound like you singin'\nSayin my name constantly, Sayin' daddy keep fuckin me\nGet it how you want it long as you keep lovin' me\nPut ya thing down\nBoom the bedroom do it right\nAnd it jus might be a long night, Alright\nNow be Quiet you don't want them to hear us outside\nLet me get on bottom while you ride\n\nBedroom Boom, (Thats whats goin down tonight)\nBedroom Boom, (Let me do ya body right)\nMy bed will be boomin' for you... (boom boom)\nBedroom boom, (All between the sheets baby)\nBedroom boom, (I wanna drive you crazy)\nMy bed will be boomin for you\n\nIt feels like heaven when were off in this room together\nI Can hear the music playin, then I hear ya voice sayin\n\"Ohh daddy now jus give it to me right there.\"\n\"Ohh baby, Take a handfull of my hair.\"\nCus you like it rough (rough) can't get enough (nough)\nCus I'm the type of nigga thats gon fill you up, like a cup\nAnd make this love thing overflow\nI won't stop until ya body's tellin me so\nSheets gettin' sticky from the strawberries and whipped cream\nIf these walls could talk they would say this is one hell of a scene\nNow you movin ya body jus like a gymnist\nFrom the bed to the dresser, All type a' crazy shit\nCase is tellin me stories, Body's hot and so horny\nHittin it from the rear, Wanna wisper somethin in yo ear\n\"I'm gonna love you all night... I promise.\"\n\nBedroom boom, (Bedroom boom!!)\nBedroom boom, (I can hear it baby!)\nMy bed will be boomin' for you, (We'll be Fuckin all night, yes..)\nBedroom boom, (Hittin yo body!)\nBedroom boom, (Like boom boom boom!)\nMy bed will be boomin' for you\n(My bed will be shakin' til' the screws come loose, while I'm off in it)\n\nBoom goes the bedroom, Behind closed doors\nAnd the bedroom depends on how far things go\nYou move slow or move fast when you off in that ass\nBut you hittin' that mothafucker like everytime yo last\nSpread yo legs like a bald eagle, Work that back\nMove like a snake when you do dat dat\nNow be quiet, You don't want them to hear us outside\nLet me get on bottom while you ride\n\nYou hotter then the eye on the stove\n(Yea) Temptation got ya outta control\n(Mmm Hmmm) You tremblin' like you out in the cold\nYou screamin' you can't take it no more\nBeat the pussy so bad we done fell on the flo (Can you believe it?)\nThrow our clothes in the kitchen and in the garage\nAll this love is waitin for you like I'm El DeBarge\nSee my dick stay hard. (Oh) And its gon stay cocked\n(Yes) If a bitch fuck wit me she gettin her cherry popped\n\nBedroom boom, (This is serious business, Baby)\nBedroom boom, (What goes on in this room, So what baby..)\nMy bed will be boomin' for you, (Say Boom! boom!)\nBedroom boom, Bedroom boom, (And it feels amazing!)",
 "image": "https://images.genius.com/d3b22c95df3090af9060902846b0ebd4.1000x1000x1.jpg"
}