{
 "title": "Chunk Up the Deuce",
 "album": "Minor Setback For The Major Comeback",
 "year": "2006-11-06",
 "lyrics": "I chunk up the deuce for the south and the north\nBoys talking down and boys wanna hate\nI chunk up the deuce for the south and the north\nBoys talking down, don't make me pull out the choppa\nI chunk up the deuce for the south and the north\nBoys talking down, I'll leave 'em on the streets dead\nI chunk up the deuce for the south and the north\nBoys talking down, I got them diamonds in my mouth\n\nWell it's that grain gripper from Houston, Tex\nThat barre sipper, that barre, no plex\nI'm straight up outta that Swishahouse\nWhere G. Dash write all the checks\nSo check the neck, check the wrist\nI'm balla status from head to toe\nMy jewelry shop sell more grills than George Foreman\nBaby now you know\nThat ain't a igloo, that's my watch\nAnd that ain't snow, baby that's my chain\nThat's not a ice tray, that's my teeth\nAnd that's not a snow cone, that's my ring\nThat ain't Kool-Aid up in my cup\nI stay sipping that purple oil\nI stay flipping the slab on fours\n'Cause I'm a hustler 'til I'm in the soil\nMy wrist game is one of a kind\nPatek Philippe worth a 100K\nMy work schedule out on the block\nIt's mash all night and grind all day\nNo 401K for a hustler\nJust bleed the block and stack that paper\nM.O.B. when it comes to hoes\nAnd a .40 cal when it comes to haters\nWe authentic playas not counterfeit\nGot a 600 Benz with a fog kit\nGot hoes at the HK turning tricks\nOutrunning the track, trying to make me rich\nI'm too legit to quit, stacking up that paper 'til I'm gone\nSo I'ma be working wood wheel and catching splinters\nRiding twenty inches or better in chrome\n\n\nDon Ke! Houston, Tex, got the streets burning\nPopping seals with them fours turning\nRookie boys, they still learning\nLosing cash, I'm still earning\nGet my bread when I shake the fed\nKeep them dimes in and out my bed\nJump in the drop to convert the top\nAnd let 'em bop on candy red\nLeather seats with that wood out\nThey don't know what my hood 'bout\nTryna take the young don's spot\nI'm platinum balling and still hot\nHaters off in my mix again\nPimping broads plus pimping pens\nMultiplying, I gotta win\nKeep that ice looking clear as gin\nOut the roof still chunking deuce\nRiding slab and hopping juice\nDiamond grill with plenty of skills\nJust pass the mic and I let it loose\nIndependent still chasing bucks\n22s on Porsche trucks\nModel chicks with them big ol' butts\nKiller clans with them big ol' nuts\nHit the club with my game tight\nHoes bopping my fame right\nDid her thang the same night\nBoys talking, it's all hype\nCut the check when I run my mouth\nRolling in green like I'm playing golf\nTexas boys be going off\nRepresenting the north and south\n\n\nI'm from Port Arthur, Texas, represent it 'til I'm dead\nPimping almost died in the 80s, boys was scared\nBitches was on crack, and the 'Lac wasn't rolling\nBut the game done been revived cause now the south side is holding\nPockets stay swollen, what do we do with all this cash?\nDrive '84 Biarritz with TVs jumpin up out the dash\nPistol in the stash even though I'm on parole\nNigga try me Try me with that fuck shit, bitch I'll leave your body cold\nFrom the land of grain, dripping paint, 84s and a chrome grill\nThis Texas baby, dirty south, P.A.T., you know we real\nWe pack the Ks, Desert Eags, ARs and them 38s\nWe serving nothing but Chyna Whyte, playa we don't sell that dirty weight\nBig Bun Beater, hold it down, rep the town to the fullest\nWhether it be on the mic or in the streets busting them bullets\nDon't put it with me, I won't pull it on you and leave you ventilated\nUGK is back on the block and you marks is finna hate it",
 "image": "https://images.genius.com/0ce394964a990534572589a2f769a31d.300x300x1.jpg"
}