{
 "title": "Good Luck Charm",
 "album": "Jagged Edge",
 "year": "2006-05-09",
 "lyrics": "J.E., y'all (Oh, mmm)\n(Yeah, yeah)\nAnd she saw the light, my shining star\n(I'm sendin' this one out to this special someone)\nShe's so dear to me\n(Yeah, that girl truly hold it down for me)\nYes, she is, yes, she is (Yes, she is, yes, she is)\nMy, my rabbit's foot, my lucky charm\n(You'll never see me without her)\n(You know what I mean)\nYes, she is, yes, she is\n(She like that lucky rabbit's foot)\nWoah, woah, oh\n(Or some, some kind of good luck charm or somethin' like that, huh)\n(J.E.)\n\nEvery time that something good happens in my life\nYou're always there for me, looking good by my side\nPicture you now, pulling up your pantyhose\nAnd you always got that sexy underwear on\nSo much good has come my way since she came in my life\nI'll never push you away or brush you off to the side\nSee, girl, I, I, I\nSee, my luck has changed for the better (Oh)\n\nSee, I got so much love for you in these arms (See, you should know)\nDon't you know that you're my good luck charm? (My good luck charm)\nWear you 'round forever, girl, ain't no harm (Ain't no harm, yeah)\nAnd nobody else can borrow it, I won't allow it (No one else can take it, no)\nSee, I got so much love for you in these arms (Yes, I do, girl)\nDon't you know that you're my good luck charm? (Yeah, yeah, yeah)\nLoving you forever, girl, and never do I\nWanna go without my good luck charm\n\nLike a rabbit's foot on keys, or some lucky dice\nAll I want or need, I ain't gotta ask twice\nWhere would I be? What would I do\nWithout you looking out for me?\nProbably be, probably be in these streets\nWithout you in my life\nMy future ain't the same, no (Wouldn't be, be the same, no)\nAnd I'm not wanting the blame (No)\nBaby, I know I been around\nI'm tired of messing around\nI got so much love for you\n\nSee, I got so much love for you in these arms (In these arms, no, no)\nDon't you know that you're my good luck charm? (Baby, you know I do)\nWear you 'round forever, girl, ain't no harm (Baby, baby, yes, I do)\nAnd nobody else can borrow it, I won't allow it (Nobody, no, no, no)\nSee, I got so much love for you in these arms (Love for you, yes, I do)\nDon't you know that you're my good luck charm? (Don't you know you're my good luck charm? Baby, you've been my good luck charm, yeah, yeah)\nLoving you forever, girl, and never do I (Never do I, no, no, no)\nWanna go without my good luck charm (Oh-oh, woah)\n\nAnd I'd throw away this ice, and give up my J.E. pieces\nJust to get a piece of your love forever, uh\nAnd I knew you were a keeper\nSo, baby girl, I'm keepin' you\nCan't think about lettin' you go, no, no\nIt seems like every situation I been facin'\nYou know what to do to save me\nSo I know you bring me luck\nSo I'm standin' strong like a soldier\nI know how to hold you\nI'm sayin' this to let you know\nI got so. ooh\n\nSee, I got so much love for you in these arms (Woah)\nDon't you know that you're my good luck charm? (Yes, I know, yes, I know, baby)\nWear you 'round forever, girl, ain't no harm (And yeah)\nAnd nobody else can borrow it, I won't allow it (I won't allow it, no)\nSee, I got so much love for you in these arms (In these arms, yeah, yeah)\nDon't you know that you're my good luck charm? (You're my good luck charm)\nLoving you forever, girl, and never do I (I go nowhere-where without, I go)\nWanna go without my good luck charm (Baby, you know you're my, my, my)\n\nSee, you're my—\nSee, you're my—, yeah (Ooh)\nSee, you're my—\nSee, you're my—, yeah (Oh, yeah, yeah)\nSee, you're my—\nSee, you're my—, yeah (Yeah, yeah)\nSee, you're my—\nSee, you're my—, yeah, yeah\nSee, you're my— (Yeah, yeah)\n(Baby, you know you're mine)\nSee, you're my—, yeah (Yeah, yeah)\nSee, you're my— (You're the one)\nSee, you're my—, yeah\nSee, you're my— (You're mine)\nSee, you're my—, yeah (My good luck charm)",
 "image": "https://images.genius.com/2e44cea4843e49d4aa6618fb2dfd072f.640x640x1.jpg"
}