{
 "title": "Heat it Up",
 "album": "The Charm",
 "year": "2006-04-04",
 "lyrics": "Heat it up when this shit drop\nHeat it up when this shit drop\nBubba Sparxxx, Collipark\n\nHeat it up when this shit drop\nIn them big spots, where the players let them bottles pop\nSee the steam on her back when her hips pop\nShe get it real hot, so heat it up, girl\nHeat it up, get it up, keep it up there\nHeat it up, get it up, keep it up there\nHeat it up, get it up, keep it up there\nHeat it up, get it up, keep it up there\n\nWhat it is, how are things?\nMy phone was on silent for a minute, now it rings\nIf you too cool, then I'm too cool\nLet's not boo-hoo, let's just do what we do\nMovin' on, new song, new loan\nSometimes you can move right and still do wrong\nAin't nothin' fancy, just line up and run it\nBy the time you finish talkin' bout it, I'll be done done it\nCollipark, Bubba Sparxxx\nDo the Ying-Yang thang or anythang, I'm just a star\nMs. New Booty, thank you ma'am\nBottom broad brought me back, dawg this money changing hands\nA lot this way, a little thattaway\nEarn Sunday through Friday, spend on Saturday\nYeah, that's the play, get it up and keep it up there\nHeat it up slowly then quickly beat it up, yeah\n\n\nWhat it is, tell me the good news?\nI got a tool in my draws that you should use\nGive that thang a good bruise, beat it on up\nGirl, you've been misused, heat it on up\nI'm gon' show you what it was made for\nActin' like you scared and unprepared, but you ain't though\nGrab your ankles, yeah, that's the angle\nI'mma make a stank ho of daddy's little angel\nI'm at the condo, with General Patton\nLosers make excuses, winners make it happen\nWe can pull the rides out, give you somethin' to cry about\nGive you somethin' to lie about, inspiration while you pout\nWe can pull the broads out, in a straight line\nYours ain't fine, fuck it, here, take mines\nDude, you way behind, get on Bubba K. time\nI'm lightyears ahead, have a light beer instead, yeah",
 "image": "https://images.genius.com/6f1957cc86dff2d2eba1c226b1fe2f74.640x640x1.jpg"
}