{
 "title": "I Am Not My Hair",
 "album": "Testimony, Volume 1: Life & Relationship",
 "year": "2005-11-15",
 "lyrics": " + (India.Arie)\nKonvict {*echoes*} (Dat dada dat da)\n(Dat dada dat da, dat dada dat da)\n(Dat dada dat da, dada ooh)\nKonvict Music, uh-huh\n\nSee I can kinda recall little ways back\nSmall tryin' to ball; always been black\nAnd my hair I tried it all - I even went flat\nHad a gumdee curly top and all that crap, now\nTryin' to be appreciated\nNappy headed brothers never had no ladies\nThen I hit by the barber shop real quick\nHad em give me little twist and it drove them crazy\nAnd then I couldn't get no job\nCause corporate wouldn't hire no dreadlocks\nThen I thought about my dogs on the block\nKinda understand why they chose a steal and rob\nWas it the hair that got me this far? (uh-huh)\nAll these girls these cribs these cars (uh-huh)\nI Hate to say it but it seem so flawed\nCause success didn't come 'til I cut it all off (uh-huh)\n\nLittle girl with the press and curl\nAge eight I got a Jheri curl\nThirteen then I got a relaxer\nI was a source of so much laughter\nFifteen when it all broke off\nEighteen and then I went all natural\nFebruary two thousand and two I\nWent on and did what I had to do\nCause it was time to change my life\nTo become the women that I am inside\nNinety-seven dreadlocks all gone\nLooked in the mirror for the first time and saw that\nHey...\n\nI am not my hair, I am not this skin\nI am not your ex-pec-tations no no\nI am not my hair, I am not this skin\nI am the soul that lives within\n\nGood hair means curls and waves\nBad hair means you look like a slave\nAt the turn of the century\nIt's time for us to redefine who we be;\nYou can shave it off like a South African beauty\nOr get in on lock Like Bob Marley;\nYou can rock it straight like Oprah Winfrey -\nIf it's not what's on your head\nIt's what's underneath and say\nHey....\n\nI am not my hair, I am not this skin\nI am not your expectations no\nI am not my hair, I am not this skin\nI am a soul that lives within\n\nWho cares if you don't like that\nWith nothin' to lose post it with a wave cap\nAnd the cops tryin' to harass cause I got waves\nAin't seen nothin' like that, not in my days (noo...)\nMan, you gotta change all these feeling's\nSteady judging one another by their appearance\nYes, India I feel ya girl\nNow go ahead talk the rest of the world\n\n(Oh, oh, oh) Does the way I wear my hair make me a better person?\n(Whoa, whoa, whoa) Does the way I wear my hair make me a better friend? (Nooo...)\n(Whoa, whoa, whoa) Does the way I wear my hair determine my integrity?\n(Whoa, whoa, whoa) I am expressing my creativity...\n\nBreast cancer and chemotherapy\nTook away her crown and glory\nShe promised God if she was to survive\nShe would enjoy everyday of her life ooh...\nOn national television\nHer diamond eyes are sparkling\nBald headed like a full moon shining\nSinging out to the whole wide world like\nHey...\n\nI am not my hair, I am not this skin\nI am not your expectations no\nI am not my hair, I am not this skin\nI am a soul that lives within\n\nI am not my hair, I am not this skin\nI am not your expectations no\nI am not my hair, I am not this skin\nI am a soul that lives within",
 "image": "https://images.rapgenius.com/ceb0a474b3e420e2d5b9ff777ecbd791.500x500x1.jpg"
}