{
 "title": "I Refuse",
 "album": "Ghetto Revelations: II",
 "year": "2006-02-28",
 "lyrics": "Yo, baby\nWhat's up?\nWhat we had was so special\nYeah, I know\nWhat you doin' now?\nLeft my man, back at the 9 to 5, just tryin' to make things work\nYeah, I never thought I'd see you again\nI never thought I'd see you again\nYeah?\nWhat a coincidence\nWell, that's how things happen\nYeah I know, I wanna have you just one more time\nBut you know what?\nWhat's that?\nYou know what's odd?\nWhat's is it?\nListen\n\nWhat are the odds of me bumping into you again?\n(One in a million)\nWhat are the odds of me seeing my first lover friend?\n(Two in a million)\nIt's been two years since we both graduated\nI still can feel how we both celebrated\nI can't get over your voice on my phone\nWe've been apart for so long\n\n(So I refuse to wait) My patience is out the door, baby\n(I refuse to hear you say) You don't want me no more, baby\n(I refuse to blame, you for anything, me for anything)\nLets not take finding each other in vain\nIt's not a coincidence, baby\n\nRemember we use to sneak off when your mama dosed off\n(Hit the back seat of my Chevy, fog up the windows)\nMade love to Sweet Lady, our favorite song\n(Kept it movin' slow and steady to the tempo)\nThen we would lay there\n(And hold on to each other like there wasn't a tomorrow)\nI can't get over your voice on the phone\nWe've been apart for so long\n\n(So I refuse to wait)\nMy patience is out the door, baby\n(I refuse to hear you say)\nDon't want to hear you say, you don't want me no more\n(I refuse to blame, you for anything or me for anything)\nI won't blame you for anything or me for anything\nLets not take finding each other in vain\nIt's not a coincidence, baby\n\nYou know, damn well, you're suppose to be in my life\n(Ridin' by my side) Oh yeah, yeah\nYou know, damn well, you're suppose to be coming home to me every night\nBaby if you're not that far away\nMaybe we can spend the day\nCatch up on all the lovin' we lost\nLet me kiss you in your favorite place\n\n(So I refuse to wait)\nI don't think you hear me, baby\n(I refuse to hear you say)\nSay no-no-no, no-no-no, no-no-no, no, no, I refuse\n(I refuse to blame, you for anything, me for anything)\nBlame you for anything or me for anything\nLet's not take finding each other in vain\nIt's not a coincidence, baby\n(So I refuse to wait)\nMy patience is out the door, baby\n(I refuse to hear you say)\nSay no-no-no, no-no-no, no-no-no, no, no, I refuse\n(I refuse to blame, you for anything, me for anything)\nBlame you for anything or me for anything\nLet's not take finding each other in vain\nIt's not a coincidence, baby",
 "image": "https://images.genius.com/a4c3142541a00e4d321abd0c1d48a24a.1000x1000x1.png"
}