{
 "title": "Imagine Me",
 "album": "Hero",
 "year": "2005-10-04",
 "lyrics": "Imagine me\nLoving what I see when the mirror looks at me cause I\nI imagine me\nIn a place of no insecurities\nAnd I'm finally happy cause\nI imagine me\nLetting go of all of the ones who hurt me\nCause they never did deserve me\nCan you imagine me?\nSaying \"No\" to thoughts that try to control me\nRemembering all you told me\nLord, can you imagine me?\nOver what my mama said\nAnd healed from what my daddy did\nI wanna live and not read that page again\n\nImagine me being free, trusting you totally\nFinally I can...\nImagine me\nI admit it was hard to see\nYou being in love with someone like me\nBut finally I can...\nImagine me\n(Imagine me) Being strong\nAnd not letting people break me down\nYou won't get that joy this time around (No no)\nCan you imagine me?\nIn a world (in a world) where nobody has to live afraid\nBecause of your love fear's gone away\nCan you imagine me?\n\nLetting go of my past\nAnd glad I have another chance\nAnd my heart will dance\nCause I don't have to read that page again\n\n(Imagine me)\nImagine me, me being free, trusting you totally\nFinally I can...\nImagine me\n(I admit Jesus) I admit it was hard to see\nYou being in love with someone like me (like me)\nFinally I can...\nImagine me\n(I imagine me)\nImagine me (being free) being free, trusting you totally (totally)\nFinally I can...\nImagine me\n(I'll be honest with you)\nI admit it was hard to see (it was hard)\nYou being in love with someone like me (yeah)\nBut finally I can...\nImagine me\n\nThis song is dedicated to people like me\nThose that struggle with insecurities, acceptance and even self-esteem\nYou've never felt good enough, you've never felt pretty enough\nBut imagine God whispering in your ear letting you know that everything that has happened is now...\n...gone, gone, it's gone, all gone\n(It's all gone, every sadness)\nGone, gone, it's gone, all gone\n(Every mistake, every failure, it's all gone)\nGone, gone, it's gone, all gone\n(Depression, gone, bad faith, it's gone)\nGone, gone, it's gone, all gone\n(Low self-esteem, Hallelujah, it's gone, it's all gone)\nGone, gone, it's gone, all gone\n(It's gone, all my scars, all my pain)\nGone, gone, it's gone, all gone\n(It's in the past, it's yesterday, it's all gone, ah)\nGone, gone, it's gone, all gone\n(I can't believe it's gone)\n(Gone, what you mother did, what your father did, Hallelujah)\nGone, gone, it's gone, all gone\n(It's gone)",
 "image": "https://images.genius.com/b80384627322dcaec33b45f95b263e57.900x900x1.jpg"
}