{
 "title": "Let It Go",
 "album": "Just Like You",
 "year": "2007-06-19",
 "lyrics": "[Intro: Keyshia Cole & \nMissy Elliott\n]\nYou need to get if he don't wanna\nLove you the right way, he ain't gonna\nIt ain't where he's at, it's where he..\nWhere he wanna be, yeah, yeah\nNew Keyshia\nYes! (Woo!)\nFire (Uh-huh)\nI like this one right here\nThis one for all my ladies, y'all\nHolla! Mmm\nLet's go!\n\nI don't want'cho man, 'cause I got it like that\nBut it ain't even gotta be like dat (Eh-heh-heh-heh-heh)\nYo' man, he be callin' me back\nHe say I'm fine and a matter of fact (Heh-heh-heh-heh-heh)\nHe ask how I do that, that fit my jeans over Baby Phat\nListen, I don't know the type of tricks he playin'\nBut I should warn you, I don't want yo' man (C'mon)\n[Verse 2: Keyshia Cole & \n(Missy Elliott)\n]\nI understand why you wanna try\nTo make him stay home late at night\nBut if he wanna go, he'll be gone, no lie\nI can't explain how many times I tried\nHow many times I cried\nThinkin' about mine and where he might be\n(Baby, I don't wanna know)\nRemember when I gave everything I got\nCouldn't get deep down inside\nHow you love someone who didn't love me? \n(C'mon)\nBut now I get if he don't wanna\nLove you the right way, he ain't gonna\nIt ain't where he's at it's where he, where he wanna be\n\nIf he ain't gonna love you, the way he should\nThen let it go\n(If he ain't gonna) If he ain't gonna treat you, the way he should\nThen let it go\n(If he ain't gonna) If he ain't gonna love you, the way he should\nThen let it go (Let it go)\nIf he ain't gonna treat you, the way he should\n(Let it go) Then let it go\n\nWhen this song come on in the club, they gon' be like\nDamn, that's hot\nAnd when they play it in the car, they gon' drop they tops like\nDamn, that's hot (Whoop!)\nThey gon' mix it with Biggie, \"It was all a dream\" like\nDamn, that's hot\nMe and Keyshia don't stop, 'til the tick don't tock like\nDamn, that's hot\n\nNow understand why I take my time (Time)\nCause you come with alibis (-Bis)\nTryna get me to see that's where you tryna be\nBut I don't want your man\nYour man's been callin' me (Callin' me), tryna get me to see\nThat he wants me to be with him\nBut he ain't the one for me\nAnd if you only knew (Only knew)\nYou would, do what you had to (You would, do)\nFinally see that (Finally get the chance to see that)\nYou need to get if he don't wanna\nLove you the right way, he ain't gonna\nIt ain't where he's at, it's where he..\nWhere he wanna be, yeah, yeah\n\nUh, uh, uh\nHere's a little lesson, Lil' Kim don't stress 'em (Yeah, yeah)\nKick 'em all straight to the curb like Beckham\nBroke wit my ex, he with her for now\nBut little do she know, she's just a rebound (Hey)\nCallin my phone, she's so outta pocket\nI been there before ol' girl, you need to stop it\nWhen he's with you, he's wishin it was me (Me)\nYou might be where he's at, but I'm where he wanna be, baby\nBay-bay\n\nIf he ain't gonna love you, the way he should\nThen let it go\n(If he want you all night) If he ain't gonna treat you the way he should\nThen let it go (He ain't comin' home)\nIf he ain't gonna love you, the way he should\nThen let it go\nIf he ain't gonna treat you, the way he should\nThen let it go\n\nHands up in the air!\n\nWhen this song come on in the club, they gon be like\nDamn, that's hot (Come on)\nAnd when they play it in the car, they gon' drop they tops like\nDamn, that's hot (Whoop!)\nThey gon' mix it with Biggie, \"It was all a dream\" like\nDamn, that's hot (That's right)\nMe, Kim and Keyshia don't stop, 'til the tick don't tock like\nDamn, that's hot\n\nYes\nFire, baby!",
 "image": "https://images.genius.com/98a8b81943befdf68e7007ca095e17a1.600x600x1.webp"
}