{
 "title": "Need a Boss",
 "album": "Point of No Return",
 "year": "2006-07-25",
 "lyrics": "(This that new fire man! Darkchild!)\nDisturbing Tha Peace! Shareefa!\nHere's another one, LUDA!\nI told 'em we just gettin started man\n(Aiyyo, I don't think they really understand what this is\nBring that back!)\nAy, Shareefa where you at baby?\nLet's go!\n\nCome wit it - need somebody that's real GANG-sta\nAin't a - toy soldier, a real GANG-sta\nPlaya - holdin' me down like an anchor\nI need a pappy, somebody I call daddy\nHustla - any hood he's a boss-a\nTrapper - under the rugs he got stacks-a\nNever - see movies, don't like them actors\nThat's just what I go after, that's what I need\n\nI-I-I-I-I-I-I-I-IIII-I be buggin\nCause all these fakes thugs is tryna press up\nI need a boss like HEY! Who's flossin like HEY!\nTossin' dough like HEY! You know that he'll PAY!\nI-I-I-I-I-I-I-I-IIII-I be buggin\nCause all these fakes thugs is tryna press up\nI need a boss like HEY! Who's flossin like HEY!\nTossin' dough like HEY! That drives me cra-ZY!\n(Aiyyo Darkchild, bring that back!)\n\nStop it - anything I want I cop it\nI just - want somebody to get fly wit\nI got - what I need, but can you top it?\nYes - I'm a hot chick, somebody you can ride wit\nGot hips - all the boys want me to drop it\nSo thick - niggas be buggin, I own it\nI may - be young, but I know what I want\nIf you show me baby, you can get on\nSo come on\nThat's just one of the things, I, need\nOnly one I'm pleas-ing, is, me\nUnpredictable, yeah, that's, me\nI can't help it, that's so sex-y\n\n\nI'm the number one hustler of the century, s-s-see me in your dreams\nI'm the boss of all bosses, k-k-king of all kings\nI'm your favorite rapper's idol, I BEEN had the title!\nCall me hot sixteen wit more verses than the Bible\nFifteen bank accounts, ten different bi'nesses\nFive different lawyers, tell 'em what the bi'ness is\nI live down the block, was raised up the street\nWant beef? I'll do like summertime and raise up the heat!\nI'm the leader of the pack, plus I'm STILL in the slums\nMan I was \"Built Ford Tough\", I'm as real as they come!\nBut fake thugs love to hate, some punks be ice grillin' me\nCause I g-g-got assets, no liabilities\nNow to infinity, grown women be feelin' me\nAnd they ain't got nuttin to lose but they virginity\nStill the Lova Lova, so give me a couple rubbers\nI'll get 'em in a room, and Luda will make 'em stutter like..",
 "image": "https://images.genius.com/dfe101aad58fe4cd73a0dd11ba5365b6.854x854x1.jpg"
}