{
 "title": "Same Girl",
 "album": "Double Up",
 "year": "2009-05-29",
 "lyrics": "Usher... Kel's...\n\nYo, Ush (What up, Kells?)\nWanna introduce you to this girl\nThink I really love this girl (Yeah?)\nMan, she's so fine (Straight up, dawg)\nShe stands about 5'4\", Coca Cola, red bone (Damn)\nShe drives a black Durango (Hmm?)\nLicense plate say Angel (What?)\nTattoo on her ankle, plus, she's making pesos\nGot a crib on Peachtree (Peachtree?), right on 17th Street (Huh?)\nAnd I call her TeTe (Wait a minute, hold on, dawg)\nDo she got a kid? (Yup)\nShe love some Waffle House? (Yup)\nDo she got a beauty mark on the left side of her mouth? (Man...)\nWent to Georgia Tech? (Yup) Works for TBS? (Yup)\nMan, I can't believe this shit, damn, mm\nTell me what's wrong, dog, what the hell you \"damn\"-ing 'bout?\nI'm your homie, so just say what's on your mind\nMan, I didn't know that you were talking 'bout her\nSo, man, you telling me you know her?\nDo I know her? Like a pastor know his Word\n\nWe messing with the same girl (Same girl)\nThe same girl\nHow could the love of my life\nAnd my potential wife be the\nThe same girl (Same girl)\nSame girl\nMan I can't believe that\nWe've been messing with the\nThe same girl, the same girl\nThought she was someone I could trust\nBut she's been doubling up with us\nU (U), K (K)\nMan, we been messing with the same girl\n\nSee, I met her at this party in Atlanta (Ayy, oh! Ayy)\nWell I met her at this party in Chicago (Oh, oh! Oh)\nShe came right up to me, giving me conversation\nI said \"Do you got a man?\"\nShe said \"No\" with no hesitation\nWell, it must be a music thing 'cause she said the same to me\nAt a party all in my face, while I'm laughing and buying her drinks\nShe whispered in my ear, said \"Can you take me home?\"\nMe too! Man, she was in the Chi singing that same song\nIs that true?\nAnd I thought it was true confessions when she said \"I love you\"\nMan I thought her body was callingwhen she said, \"I want you\"\nLook, I even got some pictures on my phone\nLooky there, there she is with some boy shorts on, hah\n\nWe messing with the same girl, the same girl\nShe's the apple of my eye\nAnd my potential wife\nThe same girl, same girl\nMan I just can't believe that we been messing 'round\nWith the same damn girl, oh, yeah\nThe same girl, same girl\nThought she was someone I could trust\nBut she's been doubling up with both of us\nU (Ayy!), K (Ayy!)\nMan, we been messing with the same girl\n\nSaid she got me on a ring tone\nAre you talking 'bout the pink phone?\nMm-mm, the blue one\nMan, she told me that was turned off\nIt's obvious that she's been playing us, playing us\nUsh, constantly she's been lying to us, lying to us\nDon't like the way that she's been going 'bout, going 'bout\nKells, what you think that we should do about it, do about it?\nCall her up at her home\nShe won't know I'm on the phone\nYeah, man, that's the lick\nHomie, we about to bust this trick\nMan, just ask her to meet up with you\nAnd I'm going to show up too\nAnd she won't know what to do\nWe'll be standing there, singing, \"Same ...\"\n\nThe same girl, same girl\nShe was the apple of my eye (Blow!)\nAnd your potential wife\nThe same girl, same girl\nI just can't believe that\nWe been messing with the same girl, ooh-ooh\nThe same girl, the same girl\nShe gon' be looking so stupid when she see us together\nU, K\nMan, we been messing with same girl\nSee, she was taking flights (Yeah)\nGoing back and forth (Yeah)\nThe same girl, the same girl\nI would pick her up (Ayy) at the airport (Ayy)\nMan, I really can't believe\nThe same girl, the same girl\nI can't believe it no (Hey)\nThe same girl, same girl",
 "image": "https://images.genius.com/d006d387bc28299b559e6b9848a770d1.1000x1000x1.jpg"
}