{
 "title": "So Sick",
 "album": "In My Own Words",
 "year": "2005-11-22",
 "lyrics": "Mmm, mmm, yeah\nDo, do, do, do, do, do, do-do\nOoh, yeah\n\nGotta change my answering machine\nNow that I'm alone\n'Cause right now it says that we\nCan't come to the phone\nAnd I know it makes no sense\n'Cause you walked out the door\nBut it's the only way I hear your voice anymore\n\n(It's ridiculous)\nIt's been months\nAnd for some reason I just (Can't get over us)\nAnd I'm stronger than this, yeah (Enough is enough)\nNo more walking 'round with my head down (Yeah)\nI'm so over being blue\nCryin' over you\n\nAnd I'm so sick of love songs, so tired of tears\nSo done with wishin' you were still here\nSaid I'm so sick of love songs, so sad and slow\nSo why can't I turn off the radio?\n\nGotta fix that calendar I have\nThat's marked July 15th\nBecause since there's no more you\nThere's no more anniversary\nI'm so fed up with my thoughts of you\nAnd your memory\nAnd how every song reminds me of what used to be\nThat's the reason\n\nI'm so sick of love songs, so tired of tears\nSo done with wishin' you were still here\nSaid I'm so sick of love songs, so sad and slow\nSo why can't I turn off the radio?\n\n(Oh, leave me alone) Leave me alone\n(Stupid love songs) Oh-oh, hey\nDon't make me think about her smile\nOr having my first child\nI'm letting go\nTurning off the radio\n\n'Cause I'm so sick of love songs (Hey), so tired of tears (So tired of tears)\nSo done with wishin' she were still here (Oh)\nSaid I'm so sick of love songs, so sad and slow (Ooh, oh)\nSo why can't I turn off the radio? (Why can't I turn off the radio?)\nAnd I'm so sick of love songs, so tired of tears (So tired of tears)\nSo done with wishing she were still here\nSaid I'm so sick of love songs, so sad and slow (Hey)\nWhy can't I turn off the radio? (Why can't I turn off the radio?)\nAnd I'm so sick of love songs (So sick of love songs)\nSo tired of tears (And I'm so sick, so sick of love song)\nSo done with wishing you were still here\n(And I'm so sick, so sick of love songs)\nSaid I'm so sick of love songs, so sad and slow (Hey)\nSo why can't I turn off the radio?\n\nWhy can't I turn off the radio?\nWhy can't I turn off the radio?",
 "image": "https://images.rapgenius.com/e77d09aea48c7a1a1b93f6eff78633d2.600x600x1.png"
}