{
 "title": "Turn It Up",
 "album": null,
 "year": null,
 "lyrics": "(feat. Jagged Edge)\n(JD:)\nYall wanna floss with us? All across that board we burning up. And all I ask for you to do is turn it, turn it up (x2)\n(VERSE 1:)\nSaturday night off in Katauna. All these girls dressed in Gabana, spotted one I never seen (Did you come alone?)\nIts so lovely just to see you. Even lovelier to meet you. Won't you let me buy your drink (What you sipping on?)\nNow baby I'll be honest, when I first saw you, I couldn't help but think about what you were like in bed\nI ain't tryna sweat you, I know that I just met you, but would you agree if I said?..\nWe need to be alone. (My car is right outside)\nBe alone (And it ain't too far of a drive)\nOver to my place, I know all the right songs to play cause I tell you\n(BRIDGE:)\nIt ain't nothing like making all kind of love to some music (turn the music up)\nI'm talking kissing and hugging, touching and rubbing to that music (turn the music up)\n(CHORUS:)\nSo if you love that Maxwell (turn it up, turn it up, girl)\nHow about some Jodeci? (turn it up, turn it uuup)\nBump n' Grind to R. Kel (turn it up, turn it up, girl)\nAll you gotta do is say babe (turn it up)\n(VERSE 2:)\nNow we off up in the ride, cruising down Sunset\nGirl your C T Burn is smelling so good to me. I want to love you to Usher cause I know you need it Nice n' Slow\nI'm like Genuine. You got me So Anxious\nWord to Jamie cause tonight we getting Unpredictable\nNow I know just what Jan meant, when she said it's\nFunny ( funny) How (how) Time (time) Flys\n(BRIDGE)\n(CHORUS 2:)\nAw Here's to Mary J. (turn it up, turn it up, girl)\nAnd I know you digging Faith (turn it up, turn it uuup)\nDon't Alicia got it going on? (turn it, turn it up, girl)\nAll you gotta do is say babe\n(RAP:)\nNow I'm grown, girl\nAnd I hit u with the d*** one time you'll be gone, girl\nLets get it on, girl\nWe'll let the Marvin Gay play while J do it all night long, girl\nI'm in the zone, girl\nTurn on your radio and I guarantee that you'll hear one of my songs, girl\nI write hits, got a crib with a elevator in it and I ain't dropped one single of my own, girl\n(But back to the groove) See that Petrome pouring? Maybe you want more, and I'm built to last\nSlow motion or fast, I'll have a blast, in spots you didn't even know you had\nHere's an idea, we ain't leaving for the crib, pull over the 5-50 let's do it right here\n(in audible)\n(BRIDGE)\n(CHORUS 3:)\nOne time for Jagged Edge (turn it up, turn it up, girl)\nAnd girl I know you like 112 (turn it up, turn it uuup)\nAnd Luther is the best (turn it up, turn it, girl)\nSo all you gotta is say , \"J, turn it, turn it, turn it up!\"",
 "image": "https://images.genius.com/518508111245272074fcf2adf7e92ab2.250x250x1.jpg"
}