{
 "title": "Turn It Up",
 "album": "The Sound of Revenge",
 "year": "2005-09-03",
 "lyrics": "Yeah, it's the name they say is running the game\nChamillitary Mayne!\nYeah so go ahead and hand over the torch\nSuperproducer Scott Storch\nAnd of course...\n\nI'ma show you how to get your shine on (get your shine on)\nTurn it up, the DJ playing my song (my song)\nEverybody keep on calling my phone (my phone)\nWhich one of y'all am I gone take home? (take home)\nI'ma show 'em how to get the club crunk (get the club crunk)\nGive 'em something that's gon' rattle their trunk (rattle that trunk)\nTip ya cups up until ya get drunk (get drunk)\nTell the DJ to play it loud and turn the beat up\n\nGive me that million-dollar beat and let me show you what to do with it\nWho that is? That's the illest rapper chopped and screwed on it\nCouldn't snatch the game that's what they told me so I'm provin' it\nPut the \ntruth in Texas\n with Scott Storch and you got you a hit\nHit and never miss, rep your click and throw 'em high\nBecause Chamillionaire's the answer to the game like Allen I\nMiddle fingers to the sky if they don't like that reply\nCause any DJ that deny is a motherfucking liar\nSo give the ladies what that want, got 'em racing to the front\nOf the stage to feel the bass and tell the DJ turn it up (turn it up)\nYeah, \nSound of Revenge, send Universal to get my plaques\nRap is dead so I'ma bring it back like DJ's do when they hear my tracks\nCheck out my track record, they'll say I'ma track wrecker\nHotter than a black pepper now that I am back nigga (he's back!)\nYou can't get mad if you feel that shoe and cap fit ya\nDrop the biggest stats ever so don't let that blat hit ya\n\nI'ma show you how to get your shine on (get your shine on)\nTurn it up, the DJ playing my song (my song)\nEverybody keep on calling my phone (my phone)\nWhich one of y'all am I gone take home? (take home)\nI'ma show 'em how to get the club crunk (get the club crunk)\nGive 'em something that's gon' rattle their trunk (rattle that trunk)\nTip ya cups up until ya get drunk (get drunk)\nTell the DJ to play it loud and turn the beat up\n\nAy, ay, \nwhen it's time to hit the club I let my chain hang\nIf they got clovers on they neck we in the same gang\nI'm twenty deep in V.I.P. puffing Mary Jane\nSplinters still in my hand from my woodgrain\nI got homies on the West who like to gangbang\nAnd I got homies on the East who do the same thang\nI told Johnny put fifty in my pinky rang\nFive karat diamond chain, VVS is in it mayne\nYou know I rep the Dirty Dirty where they move 'caine\nYou know we mix purple stuff in that blue drank\nHypnotic, big bodies with blue paint\nWe got Big Oomp Spray, but it still stank\nYou a lame so your dame playing mind games\nI'm a pimp so I stay in that mind frame\nNiggas talk shit until I let the nine bang\nMe and Duke in that Maybach switching lanes\n\nI'ma show you how to get your shine on (get your shine on)\nTurn it up, the DJ playing my song (my song)\nEverybody keep on calling my phone (my phone)\nWhich one of y'all am I gone take home? (take home)\nI'ma show 'em how to get the club crunk (get the club crunk)\nGive 'em something that's gon' rattle their trunk (rattle that trunk)\nTip ya cups up until ya get drunk (get drunk)\nTell the DJ to play it loud and turn the beat up\n\nI'm headed to the bar (I'm headed to the bar)\nYou know I'm V.I.P. (you know I'm V.I.P.)\nAnd since you rolling with a star (your rolling with a star)\nYour V.I.P. with me (Chamillitary)\n\nChamillitary the biggest threat to any of these rappers that think they doing it\nWho that is? That's them boys from Texas that always do it big\nMulti-colored diamonds got us shining, they say our jewellery sick\nHouston got a problem and you don't want nothing to do with it\nDo you kid? I ain't think, I'm tipping slow\nWhen my trunk is lifting up look at the neons as they glow\nGroupies never giving up, they be everywhere I go\nWhen that elevator go up to my suite they there fo' sho'\nTold me that she didn't care about my money, wasn't hearing it\nLooks can be deceiving as Chamillion paint appearances\nYou know how we do it at home of Screw and purple syrup is\nShe got turned out quicker than my power steering did\n\nI'ma show you how to get your shine on (get your shine on)\nTurn it up, the DJ playing my song (my song)\nEverybody keep on calling my phone (my phone)\nWhich one of y'all am I gone take home? (take home)\nI'ma show 'em how to get the club crunk (get the club crunk)\nGive 'em something that's gon' rattle their trunk (rattle that trunk)\nTip ya cups up until ya get drunk (get drunk)\nTell the DJ to play it loud and turn the beat up",
 "image": "https://images.genius.com/bfefa4fa967390e9cb0af598645574db.300x300x1.jpg"
}