{
 "title": "Upgrade U",
 "album": "B’Day",
 "year": "2006-09-04",
 "lyrics": "Hehehe! Yeah, B!\nTalk yo' shit! Hehe (Partner, let me upgrade you)\nHow you gon' upgrade me?\nWhat's higher than number one?\nYou know I used to beat that block\nNow I be's the block\n (Partner, let me upgrade you)\n\nI hear you be the block, but I'm the lights that keep the streets on\nNotice you the type that like to keep them on a leash though\nI'm known to walk alone, but I'm alone for a reason\nSending me a drink ain't appeasing, believe me\nCome harder, this won't be easy\nDon't doubt yourself, trust me, you need me\nThis ain't a shoulder with a chip or a ego\nBut what you think they all mad at me for?\n\nYou need a real woman in your life (That's a good look)\nTaking care of home and still fly (That's a good look)\nAnd I'mma help you build up your account\n(That's a good look, better yet, a hood look, ladies that's a good look)\nBelieve me\nWhen you're in them big meetings for the mills (That's a good look)\nIt take me just to compliment the deals (That's a good look)\nAnd anything you cop, I'll split the bill\n(That's a good look, better yet, a hood look, ladies that's a good look)\nBelieve me\n\nPartner, let me upgrade you, Audemars Piguet you\nSwitch your neck ties to purple labels\nUpgrade you (I can) up, (Can I?) up, (Let me) upgrade you\n(Partner, let me upgrade you)\nPartner, let me upgrade you, flip a new page\nIntroduce you to some new things and\nUpgrade you (I can) up, (Can I?) up, (Let me) upgrade you\n(Partner, let me upgrade you)\n\nI can do for you, what Martin did for the people\nRan by the men, but the women keep the tempo\nIt's very seldom that you're blessed to find your equals\nStill play my part and let you take the lead role, believe me\nI'll follow, this could be easy\nI'll be the help, whenever you need me (You need me)\nI see your hustle with my hustle, I can keep you\nFocused on your focus, I can feed you\n\nYou need a real woman in your life (That's a good look)\nTaking care of home and still fly (That's a good look)\nI can help you build up your account\n(That's a good look, better yet, a hood look, ladies, that's a good look)\nBelieve me\nWhen you're in them big meetings for the mills (That's a good look)\nIt take me just to compliment the deals (That's a good look)\nAnything you cop, I'll split the bill\n(That's a good look, better yet, a hood look, ladies, that's a good look)\nHey, believe me, I can upgrade you\n[Chorus 2: (Beyoncé & \nJAY-Z\n)]\nPartner, let me upgrade you, Audemars Piguet you (Audemars Piguet you)\nSwitch your neck ties to purple labels (Have you rock in purple labels)\nUpgrade you (I can) up, (Can I?) up, (Let me) upgrade you\n(Partner, let me upgrade you)\nPartner, let me upgrade you, flip a new page\nIntroduce you to some new things and\n(Uh!)\n upgrade \n(HOV!)\n you\n(I can) up, \n(Uh huh!),\n (Can I?) up, (Let me) \n(HOV!)\n upgrade you\n(Partner, let me upgrade you) \n (Uh huh!)\n\nI be the d-boy who infiltrated all the corporate dudes\nThey call shots, I call audibles\nJacob the jeweler, baubles, Lorraine Schwartz oughta do\nIt's big balling, baby, when I'm courting you\nI'm talking spy bags\n and fly pads\nAnd rooms at the Bloomberg,\n and rumors\nYou on the verge of a new merge\n'Cause that rock on ya finger's like a tumor\nYou can't fit ya hand in ya new purse\nIt's humorous to me, they watching and we just yachting\nIsland-hopping off the Amalfi coast\nMafioso, Hov, baby, you ever seen Saturn?\nNo, not the car, but everywhere we are\nYou're sure to see stars, this is high level\nNot eye-level, \nmy bezel courtesy of Audemars\nI order yours tomorrow, now look at the time I saved you\nMama, let me upgrade you (Hehe)\n\nJust when you think we had it all\nBig ends, condos, collecting cars\nPicture your life elevating with me\nNow you my project celebrity\nI keep ya name hot in them streets\nThat little glimpse of light\nMakes that diamond really shine\nAnd you already is a star, but unless you're flawless\nThen ya dynasty ain't complete without a chief, like me\n\nPartner, let me upgrade you, Audemars Piguet you\nSwitch your neck ties to purple labels\nUpgrade you (I can) up, (Can I?) up, (Let me) upgrade you\n(Partner, let me upgrade you)\nPartner, let me upgrade you, flip a new page\nIntroduce you to some new things, and\nUpgrade you (I can) up, (Can I?) up, (Let me) upgrade you\n(Partner, let me upgrade you)\n\nAudemars Piguet watch, dimples in ya necktie\nHermes briefcase, Cartier tie clips\nSilk-lined blazers, diamond creamed facials\nVVS cuff links\n, six-star pent suites\nPartna, let me, upgrade ya, grade ya\nPartna, partna, let me, upgrade ya, grade ya\nLet me, let me, let me, upgrade ya, grade ya\nPartna, partna, partna, let me upgrade ya (Huh!)",
 "image": "https://images.genius.com/3b1f8997607a2a46b60868d9bfc5d6ac.300x300x1.jpg"
}