{
 "title": "What You Know",
 "album": "King",
 "year": "2006-01-28",
 "lyrics": "Yeah, ayy, ayy, ayy, ayy\nWhat you know about that?\nWhat you know about that?\nWhat you know about that?\n\nAyy, don't you know I got kis by the three\nWhen I chirp, shawty chirp back\nLouie knapsack where I'm holding all the work at\nWhat you know about that? What you know about that?\nWhat you know about that? Hey, I know all about that\nLoaded .44 on the low, where the cheese at?\nFresh off the jet to the 'jects where the G's at\nWhat you know about that? What you know about that?\nWhat you know about that? Hey, I know all about that\n\nSee me in your city, sitting pretty, know I'm shining dog (Ayy, ayy)\nRiding with a couple Latin broads and a China doll (Ayy!)\nAnd you know how we ball (Ayy!), riding in shiny cars (Ayy!)\nWalk in designer malls (Ayy!), buy everything we saw\nYou know about me, dog (Okay), don't talk about me, dog (Okay)\nAnd if you doubt me, dog (Okay), you better out me, dog (Ohh!)\nI'm throwed off slightly, bruh, don't wanna fight me, bruh (Ohh!)\nI'm fast as lightning, bruh (Ohh!)\nYou better use your Nikes, bruh (Geah!)\nKnow you don't like me 'cause (G-G-Geah!)\nYour bitch most likely does (G-G-Geah!)\nShe see me on them dubs (G-G-Geah!)\nIn front of every club (What?)\nI be on dro, I'm buzzed (Nigga, what?)\nGave every ho a hug (Ayy, nigga, what?)\nNiggas don't show me mugs (Ayy, nigga, what?)\n'Cause you don't know me, cuz\n\nAyy, don't you know I got kis by the three\nWhen I chirp, shawty chirp back\nLouie knapsack where I'm holding all the work at\nWhat you know about that? What you know about that?\nWhat you know about that? Hey, I know all about that\nLoaded .44 on the low, where the cheese at?\nFresh off the jet to the 'jects where the G's at\nWhat you know about that? What you know about that?\n(Ayy, what they know about this shit here, man?)\nWhat you know about that? Hey, I know all about that\n\nCandy on the six-four, leather guts, fishbowl (Ayy, ayy)\nFifty on a pinky ring just to make my fist glow (Ayy!)\nYoung bitches get low (Ayy!) because I get dough (Ayy!)\nSo what I'm rich, ho? (Ayy!) I still will pull a kick-door\nWhat you talking shit for and gotta run and get folks?\nGot you all yelling, I thought you'd pull out a gun and hit four\nBut you's a scary dude, believed by very few (Okay!)\nJust keep it very cool (Okay!) or we will bury you (Ohh!)\nSee, all that attitude? (Ohh!) Unnecessary, dude (Ohh!)\nYou never carry tools, not even square, he cube (What?)\nYou got these people fooled (Nigga, what?)\nWho see me on the tube (Ayy, nigga, what?)\nWhatever, try the crew (Ayy, nigga what?)\nThey'll see you on the news\n\nAyy, don't you know I got kis by the three (Ayy, ayy)\nWhen I chirp, shawty chirp back\nLouie knapsack where I'm holding all the work at (Ayy, ask 'em)\nWhat you know about that? (Ayy, ask 'em)\nWhat you know about that? (Ayy, ask 'em)\nWhat you know about that? (Hey, hey, hey)\nHey, I know all about that (hey, hey)\nLoaded .44 on the low, where the cheese at? (Geah, geah)\nFresh off the jet to the 'jects\nWhere the G's at (Ayy, ayy, westside, nigga!)\nWhat you know about that? (Ayy, ask 'em)\nWhat you know about that? (Ayy, ask 'em)\nWhat you know about that? (I'm talking to you, homie!)\nHey, I know all about that (Ayy!)\n\nFresh off the jet to the block\nBurning rubber with the top popped (Ayy, ayy)\nMy partners busting shots\nI tell 'em, \"Stop, it make the block hot\" (Ayy!)\nYour label got got (Ayy!) 'cause you are not hot (Ayy!)\nI got the top spot (Ayy!), and it will not stop (Ayy, ayy)\nHey, video or not, Doc, we'll bust it 'til the Glock stop\nDrag you out that Bentley Coupe\nAnd take it to the chop shop (Ohh!)\nPartner, we not y'all (Ohh!), if it may pop off\nI'll answer the question (Ohh!)\n\"Will I get your block knocked off?\" (Geah!)\nThis what it is, bruh (G-G-Geah!)\nLook, I will kill, bruh (G-G-Geah!)\nI'm in your hood (G-G-Geah!)\nIf you a gangsta, what you hid for?\nSomebody better get bruh 'fore he get sent for\nSay you wanna squash it (Ayy, nigga, what?)\nWhat you still talking shit for?\n\nDon't you know I got kis by the three\nWhen I chirp, shawty chirp back\nLouie knapsack where I'm holding all the work at\nWhat you know about that? What you know about that?\nWhat you know about that? Hey, I know all about that\nLoaded .44 on the low, where the cheese at?\nFresh off the jet to the 'jects where the G's at\nWhat you know about that? What you know about that?\nWhat you know about that? Hey, I know all about that",
 "image": "https://images.genius.com/f994bb5795203d619b63f77a1673c272.800x800x1.jpg"
}