{
 "title": "Yo (Excuse Me Miss)",
 "album": "Chris Brown",
 "year": "2005-12-13",
 "lyrics": "Woah, woah\nDoo-doo-doo-doo-doo\nYeah, uh-huh, yeah\n\nYo, tell me fellas have you seen her? (Seen her)\nIt was about five minutes ago\nWhen I seen the hottest chick that a youngin' ever seen before\nI say, \"Yo, tell the girls I wanna meet her\" (Meet her)\nOn second thought that ain't the way to go\nI gotta give her game proper\nSpit it so she'll get it, there she is I gotta stop her\nOh, should I talk about her smile? (It's been said before)\nOr what about her style? (Too obvious)\nI'm out of time, she's out the door\nI gotta go for mine, I think I'll say\n\nYo\nI don't know your name but excuse me miss (Oh yeah)\nI saw you from across the room\nAnd I got to admit that you got my attention\nYou're making me wanna say yo\nI know you're tryna leave but excuse me miss\nI saved the last dance for you\nI would love to keep you here with me, oh baby\n\nNow shawty, grab hold of my hand\nAnd let's pretend the floor is ours\nYou say you don't really dance\n(Don't worry 'bout it, we just one-two step, one-two step)\nNow if the music is moving too fast (Too fast)\nGrab my hand a little tighter (Tighter)\nDon't be afraid to move a little closer\nGirl, there's something about you that makes me wanna say (Aw yeah, aw yeah)\n\nYo\nI don't know your name but excuse me miss (Ooh)\nI saw you from across the room\nAnd I got to admit that you got my attention\nYou're making me wanna say yo\nI know you're tryna leave but excuse me miss (Ooh)\nI saved the last dance for you\nI would love to keep you here with me, oh baby\nI think I'll say yo\nI don't know your name but excuse me miss\nI saw you from across the room\nAnd I got to admit that you got my attention\nYou're making me wanna say yo\nI know you're tryna leave but excuse me miss\nI saved the last dance for you\nI would love to keep you here with me, oh baby\n\nI wanna be where you are\nAin't nothing wrong with dancing\nBaby, it's so romantic\nBaby, I can be in your heart\nSo many things I wanna tell you\nI think that I should start by saying\n\nYo, woah\nI don't know your name but excuse me miss (Oh yeah)\nI saw you from across the room\nI gotta give her game proper\nSpit it so she'll get it, there she is I gotta stop her (Oh yeah)\nI know you're tryna leave but excuse me miss (Oh)\nI saved the last dance for you\nI would love to keep you here with me, oh baby\n\nNow everybody just clap your hands like this (Like this)\nJust clap your hands like this (Woah, like this, huh)\nAnd if your shorty's in the house tonight\nJust grab her by the hand, homie, make her understand\nY'all was made to dance like this (Like this)\nY'all was made to bounce like this (Woah, like this)\nJust let her know she was made for you and\nYou want to do everything she want to, man\nHa, woo!",
 "image": "https://images.rapgenius.com/54338c24fdafeb1e232adaba4fb842b3.1000x996x1.jpg"
}