{
 "title": "Bug a Boo",
 "album": "The Writing’s on the Wall",
 "year": "1999-07-27",
 "lyrics": "You make me wanna throw my pager out the window\nTell MCI to cut the phone poles\nBreak my lease so I can move\n'Cause you a bug a boo, a bug a boo\nI wanna put your number on the call block\nHave AOL make my emails stop\n'Cause you a bug a boo\nYou're buggin' what? You're buggin' who?\nYou're buggin' me, and don't you see it ain't cool?\n\nIt's not hot\nThat you be callin' me, stressin' me, pagin' my beeper\nYou're just non-stop\nAnd it's not hot\nThat you be leavin' me messages every 10 minutes\nAnd then you stop by\nWhen I first met you, you were cool\nBut it was game you had me fooled\n'Cause 20 minutes after I gave you my number\nYou already had my mailbox full\n\nSo, what - you bought a pair of shoes\nWhat, now I guess you think I owe you?\nYou don't have to call as much as you do\nI'd give 'em back to be through with you\nAnd so, what? My mama likes you\nWhat, now I guess you think I will too?\nEven if the Pope said he liked you too\nI don't really care, 'cause you're a bug a boo\n\nYou make me wanna throw my pager out the window (Hey)\nTell MCI to cut the phone poles\nBreak my lease so I can move\n'Cause you a bug a boo, a bug a boo (A bug a boo)\nI wanna put your number on the call block\nHave AOL make my emails stop (Hey)\n'Cause you a bug a boo\nYou're buggin' what? You're buggin' who?\nYou're buggin' me, and don't you see it ain't cool?\n\nIt's not hot\nThat when I'm blockin' your phone number\nYou call me over your best friend's house\nAnd it's not hot\nThat I can't even go out with my girlfriends\nWithout you trackin' me down\nYou need to chill out with that mess\n'Cause you can't keep havin' me stressed\n'Cause every time my phone rings, it seems to be you\nAnd I'm prayin' that it is someone else\n\nSo, what - you bought a pair of shoes\nWhat, now I guess you think I owe you? (Owe you)\nYou don't have to call as much as you do\nI'd give 'em back to be through with you\nAnd so, what? (So, what?) My mama likes you\nWhat, now I guess you think I will too? (Oh, oh-ooh)\nEven if the Pope said he liked you too\nI don't give a damn, 'cause you're a bug a boo\n\nYou make me wanna throw my pager out the window\nTell MCI to cut the phone poles (Cut the phone poles)\nBreak my lease so I can move\n'Cause you a bug a boo, a bug a boo (Bug a boo)\nI wanna put your number on the call block (Oh-oh)\nHHave AOL make my emails stop(Oh-ooh-whoa)\n'Cause you a bug a boo\nYou're buggin' what? You're buggin' who?\nYou're buggin' me, and don't you see it ain't cool?\n\nWhen you call me on the phone, you're buggin' me\nWhen you follow me around, you're buggin' me\nEverything you do be bugging me\nYou're buggin' me, you're buggin' me\nWhen you show up at my door, you're buggin' me\nWhen you open up your mouth, you're buggin' me\nEvery time I see your face, you're buggin' me\nYou're buggin' me, you're buggin' me\n\nYou make me wanna throw my pager out the window (Throw out my pager)\nTell MCI to cut the phone poles (Turn my phone off)\nBreak my lease so I can move\n'Cause you a bug a boo (A bug a boo), a bug a boo (A bug a boo)\nI wanna put your number on the call block (Oh)\nHave AOL make my emails stop (Whoa)\n'Cause you a bug a boo (Hey)\nYou're buggin' what? You're buggin' who?\nYou're buggin' me, and don't you see it ain't cool? (Yeah)\n\nYou make me wanna throw my pager out the window (I realize I don't want you)\nTell MCI to cut the phone poles\nBreak my lease so I can move (You're stressin' me out, doin' what you do)\n'Cause you a bug a boo, a bug a boo (Oh yeah)\nI wanna put your number on the call block (I regret the day that I met you, oh)\nHave AOL make my emails stop\n'Cause you a bug a boo\nYou're buggin' what? You're buggin' who?\nYou're buggin' me, and don't you see it ain't cool? (Oh, bug a boo)\n\nThou shalt not give into temptation",
 "image": "https://images.genius.com/4306e82c415135dc08a290159f7f4ee0.1000x1000x1.jpg"
}