{
 "title": "Down Bottom",
 "album": "Ryde or Die Vol. 1",
 "year": "1999-04-27",
 "lyrics": " Mmmm hmmmmm\n Ha ha hah\n\nOh! Damn, now bop to this\nYeah, uhh, uhh, y'all know what this is (flame on)\nJuvenile, Drag-On (flame on)\nAnd now.. Swizz Swizz Beats, yea!\n\nMe and my niggas done licked shots, even done hit cops\nBetcha niggas can't wait til my shit drop\nTreat you like your momma, give you lip a pop\nNigga you don't want my clip to drop\nCause that means I'm empty, and you're full of it\nCheck what the bullet did\nMissiles gonna hit you get you, rip through tissue\nShoot another rhyme just cause I missed you\nI make plus cash, you little niggas can't fuck wit Drag\nGot the chain out, so his muscle grabs\nNigga fuck that, you better bust back\n'fore ya monkey-ass land where the dust at\nRide like the girl but you can't trust cash\nSpit line of fire and he can't touch black\nAll you can do is cuss back\nIn your weak raps bout how you bust gats\nNigga we don't need that, I don't care about your feedback\nY'all niggas don't feed Drag\nTil a motherfucker pull out, bust a bullet out\nIn the safe house, nigga where the keys at\nNigga where the stash at, nigga where the weed at\nNigga pass that 'fore I pull my trigger\nMatter fact where the ass at, cause I got the \"Rough Rider\"\nAnd I ain't talkin bout my niggas\nCause nigga we can go ho for ho, toe to toe, blow for blow\nAnd when you feel your nose crack\nThat mean I broke that, I fill a po'-po' wit a flame thrower\nLike I told yo' befo' ya know umm - you can't handle\nYou can put me on wax but my fire burn candles\nAnd who that nigga Ruff Rydin, Drag-On\nY'all niggas and Southsiders\n\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\n\nHmmmm, hmmmmmmmm\nIn the late night, we be cockin iron and givin you stage fright\nYo head might explode, when I bust with the lead pipe\nNow say it right, Juvenile, Head tight\nStay hype, now page Mike and make sure he got all the yay, aight?\nI'm tired of you niggas, be thinkin that you usin me\nRunnin with them petty-ass niggas lookin like fools to me\nI'm workin wit some change yeah\nAnd ain't afraid to put fifty up on ya brains yeah\nYou bout worrin over yo' people I'm the same yeah\nLook, I'mma have somebody sayin that's the shame yeah\nBut if them people come they ain't gon' give no names yeah\nBaby the number one stunna don't play no games yeah\nCome outside and see nothin but camouflage and bricks\nThem gather up boys strapped with cannons\nTryin to knock off yo' shit, you stanky bitch\nI'll Ruff Ryde your ass then, Cash in for Money\nJuve ain't gettin nuttin? ha ha ha that shit is funny..\n\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\n\nWhen my niggas get knocked we gonna bail them out\nWhen it come to my gun my shells is out\nYou better get the message, cause I done mailed it out\nThat I'mma bang it like a hammer and I'mma nail the South\nEast West, and write letters for my niggas up North\nMy guns made in China, so you better dust off\nComin to getcha, you gon' bleed ketchup, I always got cheddar\nI never ass bet ya, and I won't even sweat ya\nYou won't roll four and better\nMy dough is never low, but if Drag is down on his last\nI'mma reach in my sweater, bet my Baretta\nMake a nigga feel the heat in the cold weather\nCan't stand a nigga hype, throw me his bitch\nBitch come to my shit, you betta come get her\nBe like a dog with a bone I run with her\nY'all make me so tired\nY'all niggas still rappin like you don't know my flow is fire\nAnd y'all ain't got ya suits, ain't got ya boots\nProbably gotta gun that ain't never shoot\nWhen we come you better hope they don't name you\nCause like two sticks rubbin I'll flame you\nDon't try to be me cause I ain't you\n'fore I have your spirit with the angels\nMy shorty keep a gun on the ankles\nWanna fuck? Watch out she'll bang you\nCause I taught her well, y'all players better haul to hell\nBut you niggas couldn't borrow a belt\nWhoever wit you is goin to jail\nDo you niggas bust your guns? Oh you ain't bustin none, huh?\nYou wanna fuck em til they cum, huh?\nDrag-On, Juvenile, Double R, what you want huh?\n\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best\nDo y'all niggas bust y'all guns?\n(Hell yeah we bust our guns!!)\nDo y'all fuck them til they cum?\n(Damn right we make them cum!!)\nIt's for the North (HEY) South (HEY)\nEast (HEY) West (HEY)\nRuff Ryders gonna show y'all niggas who ride the best",
 "image": "https://images.genius.com/fa6e35a806fb842aa784d01023da38fa.632x632x1.jpg"
}