{
 "title": "Girlfriend/Boyfriend",
 "album": "Finally",
 "year": "1999-05-25",
 "lyrics": "Blackstreet, JJ\nCome on\nUh, uh, uh, uh\nYeah, what what\nWhat's up girlfriend?\nWhat's up boyfriend?\nYo, meet my girlfriend\nMeet my boyfriend\nThis is my girlfriend\nThis is my boyfriend\nSo what's up girlfriend?\nSo what's up boyfriend?\nYeah you know, uh huh, what's up?\n\nI can't get her off my back\nGave her a little love, she don't know how to act\nShe be gettin' mad cuz I don't love her back\nI didn't know honey gets down like that\nNow fella gotta watch his back\nThis female is a fatal attract'\nMaybe cuz she got zipper to jack\nShe didn't know I puts it down like that, that's why\n\nGirlfriend on the phone\nCall me all day on the telephone\nBlowin' up my beeper 'cause she ready to bone\nPlayed me once, won't leave me alone\n\nShe keep paging me, calling me, stalking me, hawkin' me\nFollowin' me, telling me that she lovin' me\nBut my girlfriend said, just handle it\nI can't handle it\nJust handle it\nI can't handle it\nJust handle it\nI can't handle it\nUh, pick it up JJ one time\n\nI can't get him out of my hair\nHad the boy playin' truth or dare\nCallin' my phone at to where I be\nBoy said, sweetie you're my main squeeze\nIt's 2 AM and he's back again\nArms on his waist, all in my way\nPlottin' ways to get in my mix\nBoy, already there's a little spice in this\n\nBoyfriend on the phone\nYou call me all day on the telephone\nBlowin' up my pager cuz he ready to bone\nPlayed me once, won't leave me alone\n\nHe keep paging me, calling me, stalking me, hawkin' me\nFollowin' me, telling me that he's lovin' me\nBut my baby said, just handle it\nI can't handle it\nJust handle it\nI can't handle it\nJust handle it\nI can't handle it\nJust handle it\nI can't handle it\n\nUh, uh, yeah, turn the lights off, it's about to get plenty dark\nYou wasn't smart, you started fuckin' Ja with your heart\nIf I ripped it apart don't hate me, thank me baby\nIf my world was yours it would drive you crazy\nCuz I love what I do, like fuckin' you hoes and soon\nTalk to your tears until you feel there's something to prove\nAnd with nothing to lose I can see you being a tease\nYou fuckin' with me, just know we fuckin' for free\nYeah I know that you was lost, first bite had you tossed\nE-V-E, caramel skin bitch cost\nAnd before you stroke the kitty nigga better break off\nNigga wanna fuckin' run, better shake off\nShow me something, diamonds and the furs ain't nothin'\nImpress me, bless me with a Hummer, think I'm frontin'?\nBig cat with the big gat ready to fuck\nOne nut you done screamin' damn baby I'm stuck\nWhy in the world would you continue to run my way?\nGot hit once, found out that I don't play\nWhat the deal mami? Who pushed you through the irony of\nFuckin' and suckin' me, splitin' the coke with me\nYeah you use to have me flippin'\nAll your ex-hoes had me bitchin'\nDaddy, I never front, your dick game keep me twitchin' (no doubt)\nHow can you deny this freak?\nShhh, no need to speak, just meet me on Blackstreet\n\nGirlfriend on the phone\nCall me all day on the telephone\nBlowin' up my beeper 'cause she ready to bone\nPlayed me once, won't leave me alone\nBoyfriend on the phone\nYou call me all day on the telephone\nBlowin' up my pager cuz he ready to bone\nPlayed me once, won't leave me alone\nGirlfriend on the phone\nCall me all day on the telephone\nBlowin' up my beeper 'cause she ready to bone\nPlayed me once, won't leave me alone\nBoyfriend on the phone\nYou call me all day on the telephone\nBlowin' up my pager cuz he ready to bone\nPlayed me once, won't leave me alone\nEverybody now\n\nBoy/Girlfriend on the phone\nCall me all day on the telephone\nBlowin' up my pager 'cause s/he ready to bone\nPlayed me once, won't leave me alone\n\nS/he keep paging me, calling me, stalking me, hawkin' me\nFollowin' me, telling me that he lovin' me\nBut my baby/girlfriend said, just handle it\nI can't handle it\nJust handle it\nI can't handle it\nJust handle it\nI can't handle it\nJust handle it\nI can't handle it\n\nWe out, we out",
 "image": "https://images.genius.com/92ed487dd5395947234f4a03729554c5.626x640x1.jpg"
}