{
 "title": "Going Home With Me",
 "album": "Life in 1472",
 "year": "1998-07-21",
 "lyrics": "I'm feelin' that(2x), is you wit' me?\nI'm the type you see at the bar, fresh, buyin' it up\nAnd every girl I talk to, yeah I'm tryin' to cut\nI tell'em all I'm Chi Chi and it's nice to meet ya\nReal quick, I tell how she got all the right features\nThe jams come on and the glasses get refilled\nWe dance and watch the relations build\nNow I'm all up in her ear and she listenin'\nAt the same time, watchin' how a nigga glistenin'\nBLING! BLING! I'm thinkin' it's bout time to go\nGet the B out of valet and start the late night show\nNiggas hate, I know but I don't stop I shine\nI'm in the club every week, same place, same time\nSame thing on the mind, PARTY! PARTY!\nSo the hell with all that, we tryin' to find somebody\nThe right kind 'fore the lights come off\nShit, I'm tryin' to take sumpin' home\n\nNow if I buy you a drink and you drink it up\nThen, uh, you goin' home with me (and all my niggas say)\nAnd if you talkin' at a party and we talk too much\nThen, uh, we goin' home with me\nNow if you came with a friend that don't wanna do my man\nThen you need to give her your keys\nTell her to call you tomorrow or give you a beep\nCause tonight, you going home with me, ya heard?\n\nNow, is it because my name's Jermaine? no\nIt's all about how I kick my game, you know?\nI just flow with it, spend a little dough with it\nEntertain, before you know, I'm in your brain doing my thang\nTellin' you how good you smell\nSend you up for a drop top cruise through the A-T-L\nNow when they tipsy, it's risky, you don't know what you facin'\nFuck around and end up like Anthony Mason\nSo I let'em know a few things before we leave\nLike, \"it's true, I tapes damn near everything\"\nSo don't even think about lyin', baby\nOr try baby, to set me up for rape cause it's all on tape\nWhere you said put the cake\nHow you fed me the grapes\nWhat I did with the ice that made you shake, shake\nNow when the night's over and the girl is gone\nI'm back up in the club singin' the same damn song\n\nNow, walk in, I'm the grown man that you figure to trick\nBut I'm feelin' your dress, girl and lovin' your hips\nBut I'm buggin' off this, \"Why you stuck on the wrist?\"\nGolddigger, huh, mommy? Oh, you ain't that bitch?\nAin't that some shit? Suddenly, you hugs and kisses\nGotta be the dough you holdin' so obvious wit' it\nI get G's to flash, T.V.'s in the dash\nSee Sinbad, watchin' Vibe, ladies clockin' to ride\nLuxury flows, lengerie hoes, R.O.C. hit'em mo' than Jose Conseco\nUh, RBI's, orange top fly, the brown skin, slim\nThe nice braids, brown eyes\nR.O.C.'s stay pimpin' from Jersey to Richmond\nY'all playas waitin' to ball like 6th men\nI'm done with the game, point spread by a hundred\nSpeakin' of hundreds, five's is a nice way to slide it, let's ride",
 "image": "https://images.genius.com/631354335ddc46ad8f8be906be4fcfef.500x500x1.jpg"
}