{
 "title": "Hate Me Now",
 "album": "I Am...",
 "year": "1999-04-06",
 "lyrics": "[Intro: Nas \nand Puff Daddy\n]\nEscobar Season has returned\nIt's been a long time, been a long time comin'\nIt's life or death for me now\nBut you know, there's no turnin' back now\nThis is what makes me, this is what I am\nFeel me? Let's go\n[Chorus 1: Puff Daddy \nand Nas\n]\nYou can hate me now, (\nQ.B.\n)\nBut I won't stop now (\nReal niggas\n)\n'Cause I can't stop now, (\nBravehearts\n)\nYou can hate me now (\nC'mon\n)\nBut I won't stop now\n'Cause I can't stop now\nYou can hate me now\nYou can hate me now\n\nWell, you hate me, I'm gon' hate you too\nIt's as simple as that\nDie motherfucker, die motherfucker, die!\nYou don't give a fuck, I don't give a fuck\nGo down any way you want it to go down (do it now)\nWeak, jealous motherfuckers! (do it now, do it now)\nFuck y'all!\n\nDon't hate me, hate the money I see, clothes that I buy\nIce that I wear, flows that I try\nClose your eyes, picture me rollin\n', Sixes, money foldin'\nBitches, honeys that swollen to riches, Nas get in ya\nMost critically acclaimed\n \nPulitzer Prize winner\nBest storyteller, thug narrator, my style's greater\nModel dater, big threat to a lot of you haters\nCommentators ringside try watchin' my paper\nAlmost a decade, quite impressive\nMost of the best is in the essence for this rap shit that I stand for\nExpandin' more to the big screen, Bill Gates dreams\nBut it seems you'd rather see me in jail with state greens\nWant me off the scene fast, but good things last\nLike your favorite MC still makin' some mean cash\nFirst rapper to bring a platinum plaque back to the projects\nBut you still wanna hate, be my guest, I suggest\n\nMoney is power, motherfucker!\nI got millions of thugs on salary\n\nYou can hate me now, (I won't stop)\nBut I won't stop now (I can't stop)\n'Cause I can't stop now, (You can hate me)\nYou can hate me now (I hate you too)\nBut I won't stop now (You can hate me now)\n'Cause I can't stop now (Cmon)\nYou can hate me now (You can hate me now)\nYou can hate me now\n[Ad-Libs: Nas \nand Puff Daddy\n]\nDo it now! I told you, do it now!\nLet's go\n\nYou wanna hate me, then hate me; what can I do\nBut keep gettin' money\n? Funny, I was just like you\nI had to hustle hard, never give up, until I made it\nNow y'all sayin': \"That's a clever nigga, nothin' to play with.\"\nHate on me, I blew but I'm the same OG\nPeople warn me, when you're on top there's envy\nTook my niggas out the hood, but you doubt on us\nSayin' we left the hood but can't get it out of us\nMy bad, should I step out my shoes, give 'em to you?\nHere's my cars and my house, you can live in that too\nCriticize when I flow for the streets, hate my dress code\nGucci this, Fendi that – what you expect, ho?\nNickname Esco,\n took this game to its threshold\nBest flow, I bet the whole U.S. know\nTry to make it like you the realest, but who the illest?\nThink we all know the answer to that, 'cause niggas feel this, right?\n\nYou think I'ma come this far\nAnd let you niggas stop me now?\nI hate you too!\n\nYou can hate me now, (I won't stop)\nBut I won't stop now (I can't stop)\n'Cause I can't stop now, (You can hate me)\nYou can hate me now (I hate you too)\nBut I won't stop now (You can hate me now)\n'Cause I can't stop now (You can hate me now)\nYou can hate me now\nYou can hate me now\n\nI like this, I like the way this feels\n\nIt's a thin line between paper and hate\nFriends and snakes, nine milli's and thirty-eights\nHell or the Pearly Gates; I was destined to come\nPredicted, blame God, he blew breath in my lungs\nSecond to none, wicked turn wives to widows\nShoot through satin pillows, the desolate one\nTook a little time to claim my spot\nChairman of the board until this game stop, and I side with the Lord\nRide for the cause while drivin' niggas shot at my doors\nPlottin' I'm sure, to catch me with they Glocks to my jaws\nTried stickin' me up, but I flipped on these ducks\nInstead of me, ambulances were pickin' them up\nNiggas fear what they don't understand\nHate what they can't conquer, guess it's just the fury of man\nBecame a monster, on top of the world, never fallin'\nI'm as real as they come, from day one, forever ballin', c'mon!\n\nYou ain't never seen a nigga like me ever in your life\nAnd that's what you can't understand!\n\nYou can hate me now, (I won't stop)\nBut I won't stop now (I can't stop)\n'Cause I can't stop now, (You can hate me)\nYou can hate me now (I hate you too)\nBut I won't stop now (You can hate me now)\n'Cause I can't stop now (You can hate me now)\nYou can hate me now\nYou can hate me now\n[Outro: Puff Daddy \nand Nas\n]\nYou can hate me now, (\nC'mon, niggas!\n)\nBut I won't stop now (\nDo it now! Get this shit over with!\n)\nIt ain't gon' never stop, niggas!",
 "image": "https://images.genius.com/df0314fafd47c463dc48d70452e32a38.200x200x1.jpg"
}