{
 "title": "It’s On",
 "album": "The Professional",
 "year": "1998-12-15",
 "lyrics": "Ugh\nDMX\nClueminati\nIs y'all motherfuckers ready for the Ruff Ryde?\nGrrrrr!\n\nWhen I speak I'm understood, my decision is wood\nI see what I'm able to see, (ugh) cuz my vision is good\nIt's like I see through the eyes of a wise old man\nSo I chill, knowin I can kill this guy's whole fam\nSometimes better to be thought dumb and remain silent\nThan to open your mouth and remove all doubt cuz if it came violent\nSee I'm gonna give it to you straight, so you don't ask anymore\nYou don't really want what you asking me for\nIt's a war (ugh), and nigga, when it's on it's on\nDoin' wrong (what) till I'm gone and I ain't got long\nBut while I'm here, (ugh) ya'll niggas gonna burn\nPeep how I finished money (what) and y'all niggas gonna learn\nAll fucking week you've been talking about that drive-by\nAnd ain't did nothing but drive by\nListen shorty I'm telling you this for your own good\n(Uhh) Everybody is the man in they own hood, for real\n\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin'!\n\nI always keep my enemies the closest (uhh)\nAlways make sure I know where the toast is (uhh)\nAlways cover my tracks when I creep\nAlways get away when I'm done to relax, shit is deep\nI always know the rules of the game before I play\nAnd always keep enough dough to know I'm good for the day\nI always walk my dogs off the leash and\nAlways get my thoughts off the streets and\nAlways remember lend a hand then borrow\nAnd always no matter what plan for tomorrow\nI always pay my respects to the dead\nI always take at least one blunt to the head\nNow always know which bitches is gonna end up getting fucked\nAnd always know which niggas is gonna end up getting stuck!\nI'm always strapped; I've always packed\nI've always rapped; it's always that\nAlways black\n\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin'!\n\nNever try to knock off rock on the block that ain't yours\nNever take a man's life cuz you hate yours\nNever become so involved with something that it blinds you\nNever forget where you from someone will remind you\nNever take for granted what's been given as a gift\nAnd never sleep on a nigga, less that nigga stiff\nNever turn your back on a nigga you don't trust\nNever turn your gat on a nigga and don't bust\nNever expect to get away with the same shit more than twice\nNever forget you could get it too for a price\nNever bring it to a nigga, if you scared to die\nNever gonna do it nigga, if you scared to try\nNever gonna be another day it gets dark, nigga\nNever get it fucked up, that shit here, for the heart nigga\nNever say never, cuz I never thought this clever thought\nNever, ever caught better, getting cheddar, with three letters, DMX!\n\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah cuz if it's on it's on\nBitch niggas keep frontin'!\n\nUh, DMX\nClueminati, 9-8\nRuff Ryder's, motherfucker\nY'all niggas don't know, how it's gonna go, for real (uhh!)\n\"It's Dark and Hell is Hot\"\nY-O motherfucker\nSchool Street, Home of the Brave we all here baby\nMundo! Telemundo!\nUh!  Grrrr\nMy niggas\nDee, Waah\nBitch!\nWe all here baby\nUh!\nGever(?), Gever(?), Gever(?)",
 "image": "https://images.genius.com/b4eabbdffe9d95fca1dbdf66540d94e4.1000x1000x1.jpg"
}