{
 "title": "Ruff Ryders Anthem (Remix)",
 "album": "The Professional",
 "year": "1998-12-15",
 "lyrics": "This thing right here\nIs for my peoples in the streets\nAnd this thing right here\nWill get your ass off your feet\n\nThey call me Drag-On, when it's time to bomb\nI burn em all, til they all say turn em off\nCause these chips, I'mma run em all\nChickenheads, know I, be the Colonel\nCause I burn eternal, mixed wit the inferno\nSo be careful, 'fore I burn you\nYou better learn dude, yeah I heard you\nBut I'mma hurt you, \nbut you don't know?\nMy versatile, is a virtue\nRuff Ryders be the team, which means\nA lot cream, lot of schemes\nLot of beams to make your stock drop, right on the seams\nNigga here is too hot and too much for you to touch\nBetter tell your man cause I'm too tough\nIndubitably, too dust\nDo you bust? Cause we do\nYou need to ask the people, but quietly\nBut they don't believe until they leave violently\nIs you buying this?\nCause niggas that purchased is under the dirt kid\nThey call me Drag-On; I'm the youngest but get bonkers\nCollabo' wit my dogs from Yonkers\nBut this Bronx bombers spittin' flame\nSo you better wear your armor\nFlame on!\n\nMy dogs gon' stop, your dogs gon' drop\nAnd then we gon' shut 'em down, open up shop\nFirst we had em like \"ohhh\"\nNow they like \"nooo!\"\nWhat baby?!! That's how Ruff Ryders roll\nMy dogs gon' stop, your dogs gon' drop\nAnd then we gon' shut 'em down, open up shop\nFirst we had em like \"ohhh\"\nNow they like \"nooo!\"\nWhat baby?!! That's how Ruff Ryders roll\n\nWhen I pop up, I lock shop up, pull the drop up\nPark a block up, hit the alarm, put the top up\nStash the 'dro in my sock then pull my sock up\nAnd keep the burner but if it's hot put my Glock up\nYou know what I'm about, slidin off get my cock sucked\nOr writin' rhymes watching Scarface in the hot tub\nWhatchu wanna bet, when I pull it out\nIf you don't shout that every bullet'll go in and out\nWho you know besides 'Kiss take the piss in the bottle of Crist'\nAnd then give it to a modelin' bitch\nAnd you like your watch plain, I'mma flood mine\nAlligator bloodline trained to find coke and bite one time\n\nY'all niggas ain't hearin me out, til I pop up\nAppear in your house, clearin it out, holiday style\nEverybody actin' violent and wild\nSnatch the wife, silence the child, that's how we move\nKill me, my man kill you, that's how you lose\nI Ruff Ryde, I don't like to slide felt that I slipped\nThen the gun's only helpin the clip\nAnd the clip's only helpin my hand\nAnd like who the fuck is helpin your man?\nWhen I cock back and hop out the van\nDouble R, get a job, play the shit in the car\nHit a party start a fight at the bar, and snatch your R\nSell your shit for some coke and get the fuck out of Dodge\n\nGuess you figured that my niggas, flippers, pullin triggers\nNews team crowd around, tryna flick a picture\nGet witcha, this bitch from Illadelph marches quicker\nNigga not makin sense better stay up off the liquor\nBlonde bombshell, car-a-mel, heavy spender\nGroupies be sayin I'm they sister, hush ya mouth 'fore I hit ya\nStickin' in wiseguys, fake thugs, and bullshitters\nTake you for a ride, cover up your eye, then I get ya\nUsed to be shy-er, now I'mma Ruff Ryder\nBig niggas play me close, when they used to ride by her\nSnatchin up your figures, frontin, know you dig us\nHaters screamin, \"who that bitch?\", mind your business nigga\n\nMy dogs gon' stop, your dogs gon' drop\nAnd then we gon' shut 'em down, open up shop\nFirst we had em like \"ohhh\"\nNow they like \"nooo!\"\nWhat baby?!! That's how Ruff Ryders roll\nMy dogs gon' stop, your dogs gon' drop\nAnd then we gon' shut 'em down, open up shop\nFirst we had em like \"ohhh\"\nNow they like \"nooo!\"\nWhat baby?!! That's how Ruff Ryders roll\n\nYeah\nDJ Clue\nThe Professional, Part 1\nShoutout, Donnie Brasco\nBig Skate, Duro\nClue!\n\nThe X is gonna hit y'all niggas hard, leave y'all niggas scarred\nFuckin' with the Dog when you fuckin' with the God\nRip y'all niggas off, faggot niggas soft\nRemember me from up North, I had you scared to cough\nMy name is ringin' bells in penitentiary cells\nI'm making thugs rebel, ain't hard to tell\nYou never really wanted it, so the mic you jumped in front of it\nOutta sixteen shots I'ma hit, which one of you niggas am I gonna get\nThought you knew what I was gonna spit, this time with this rhyme\nBut by the end of it, y'all niggas is gon' be like, \"Yo X ripped it!\"\nDid my thing as usual, it's never gon' stop\nThem cats can't be for real, I got this shit locked!\nIs that a game or a joke? Say the name and get smoked\nSimple as that, simple as black, to the throat\nHit em all up to the coat, now you losin your life\nA dog is a dog for life!",
 "image": "https://images.genius.com/b4eabbdffe9d95fca1dbdf66540d94e4.1000x1000x1.jpg"
}