{
 "title": "We on Fire",
 "album": "Get It How U Live!!",
 "year": "1997-10-28",
 "lyrics": "[Verse 1: Juvenile + \nLil Wayne\n + \nTurk\n]\nWhat kinda nigga that'll go and score\nA '98, a '99 off the show room floor?\nWhat? What kinda nigga young, sittin' on chrome?\nGot three or four cars ready to get his shine on?\nNigga—what kinda nigga leave ya  and give a fuck?\nBig nuts and big heart from the start?\nWhat kinda nigga stay shinin' and ride fly?\nWhat kinda nigga be bumpin' in drive-bys?\nLook, look—what kinda nigga be burning like a stove?\nWorth six figures, hot, walkin' on gold?\nWhat? What kinda niggas kill niggas in black clothes?\nStreet-smart and play the game how it goes?\nAh, ah, what kinda nigga be driving these hoes crazy?\nClaimin' that they pregnant, wanna be his ol' lady\nUh, uh—what kinda nigga be sparklin' like silver?\nLil' bitty soldier thuggin', playing with a million?\nNow, what kinda niggas tote chops and ride hot?\nHuntin' niggas down up and down they fucking block?\n\nThe Hot Boys, the Hot Boys (Them niggas is the—)\nHot Boys, the Hot Boys\nThe Hot Boys, the Hot Boys (Them niggas is the—)\nHot Boys, the Hot Boys\n[Verse 2: Juvenile + \nLil Wayne\n + \nTurk\n]\nWhat kinda nigga don't give a fuck who you is?\nDisrespectin' his mind, you jeopardizin' your kids\nYeah, what kinda nigga run with nothing but head-busters?\nRiding at night, hitting like a Louisville slugger?\nLil' mama—what kinda nigga sport soldiers and 'bauds?\nPimp niggas—and fuck hoes?\nWhat kinda nigga be duckin' the ATF?\nLook, what kinda nigga got clientele in the 'jects?\nWell, what kinda nigga play beef like a pro?\nKeep enemies close and blaze like an optimo?\nNigga—what kinda niggas be sharp off the top?\nDrive Benz and like diamonds that shine?\nAh, ah—what kinda nigga put his name on the blimps?\nWhoadie, what kinda nigga make your whole life frightenin'?\nSetting it off with 50 shots, strikin' like lightenin'?\nHa—what kinda niggas run through ports with keys?\nGetting paid seven days a week making Gs?\n\nThe Hot Boys, the Hot Boys (Them niggas is the—)\nHot Boys, the Hot Boys\nThe Hot Boys, the Hot Boys (Them niggas is the—)\nHot Boys, the Hot Boys\n[Verse 3: Juvenile + \nLil Wayne\n + \nTurk\n]\nNigga, what kinda nigga got this shit under control?\nWhat kinda nigga stash his bundle in his 'bauds?\nNow, hold up—what kinda nigga got them skanks?\nSayin' he got that fire?\nNow—what kinda nigga clip tight with his click?\nPaper chasing and smack a piss out a bitch?\nWhoadie—what kinda nigga you hear about but don't see?\nWhat kinda nigga go to war like the Middle East?\nSay , what kinda nigga make his tramp stay in line\nAnd can bruise your lil' twat at the, uh, same time?\nSay, dog—what kinda nigga be thuggin', lettin' 'em sag?\nGettin' loaded, fully loaded of dime bags?\nWhat kinda nigga do crime and serve time?\nWhat kinda nigga ride keys and serve dimes?\nJust what kinda nigga be on top?\nLil' girls respect his mind and he too, too hot\nNow, now—what kinda niggas be famous living rich?\nTossing hoes, having bitches sucking his dick?\n\nThe Hot Boys, the Hot Boys (Them niggas is the—)\nHot Boys, the Hot Boys\nThe Hot Boys, the Hot Boys (Them niggas is the—)\nHot Boys, the Hot Boys",
 "image": "https://images.genius.com/d2ccd52990d65e2a3163725d01d948ad.500x500x1.jpg"
}