{
 "title": "Don’t Cha",
 "album": "PCD",
 "year": "2005-04-19",
 "lyrics": "Ayo, what the fuck you think a record\n'Bout Pussycat Dolls featurin' Busta Rhymes is gon' sound like?\nOkay (Ahh), yeah (Ahh)\nOh, we about to get it\nJust a lil' hot and sweaty in this motherfucker (Ooh, baby)\nLadies, let's go (Uhh), soldiers, let's go (Dolls)\nLet me talk to y'all and just, you know\nGive you a little situation... listen (Fellas)\n\nYou see this shit get hot, every time I come through\nWhen I step up in the spot (Are you ready?)\nMake the place sizzle like a summertime cookout\nProwl for the best chick, yes, I'm on the lookout (Let's dance)\nSlow bangin' shorty like a belly dancer with it\nSmell good, pretty skin, so gangsta with it (Ooh, baby)\nNo tricks, only diamonds under my sleeve\nGimme the number, but make sure you call before you leave\n\nI know you like me (I know you like me)\nI know you do (I know you do)\nThat's why whenever I come around, she's all over you\nAnd I know you want it (I know you want it)\nIt's easy to see (It's easy to see)\nAnd in the back of your mind\nI know you should be fuckin' with me (Ahh)\n\nDon't cha wish your girlfriend was hot like me?\nDon't cha wish your girlfriend was a freak like me?\nDon't cha? Don't cha?\nDon't cha wish your girlfriend was raw like me?\nDon't cha wish your girlfriend was fun like me?\nDon't cha? (Ah-ah-ah) Don't cha?\n\nFight the feeling (Fight the feeling)\nLeave it alone (Leave it alone)\n'Cause if it ain't love\nIt just ain't enough to leave a happy home (Uh-uh, uh-uh)\nLet's keep it friendly (Let's keep it friendly)\nYou have to play fair (You have to play fair, yeah)\nSee, I don't care\nBut I know, she ain't gon' wanna share (Ah, ah-ah)\n\nDon't cha wish your girlfriend was hot like me? (Oh)\nDon't cha wish your girlfriend was a freak like me? (Like me)\nDon't cha? Don't cha, baby?\nDon't cha? Alright, sing\nDon't cha wish your girlfriend was raw like me? (Raw)\nDon't cha wish your girlfriend was fun like me? (Big fun)\nDon't cha? (Ah-ah-ah) Don't cha?\n(Okay, I see how it's goin' down\nSeem like shorty wanna little ménage pop off or somethin'\nLet's go)\n\nWell, let me get straight to it\nEvery broad wanna watch a nigga when I come through it\nIt's the God almighty, lookin' all brand new\nIf shorty wanna jump in my Aston Vanquish\nLookin' at me all like she really wanna do it\nTryna put it on me 'til my balls black and blueish\nYou wanna play with a player, girl, then play on\nStrip out the Chanel and leave the lingerie on (Ha)\nWatch me and I'mma watch you at the same time\nLookin' at you wanna break my back\nYou're the very reason why I keep a pack of the Magnum\nAnd with the wagon, hit you in the back of the Magnum\nFor the record, don't think it was something you did\nShorty all on me 'cause it's hard to resist the kid\nI got a idea that's dope for y'all\nAs y'all could get cold so I could hit the both of y'all\n\nSee, I know she loves ya (I know she loves ya)\nI understand (I understand, yeah)\nI'd probably be just as crazy about you if you were my own man\nMaybe next lifetime (Maybe next lifetime)\nPossibly (Possibly)\nUntil then, old friend, your secret is safe with me (Shhh... hot)\n\nDon't cha wish your girlfriend was hot like me? (Oh)\nDon't cha wish your girlfriend was a freak like me? (Like me)\nDon't cha? Don't cha, baby?\nDon't cha? Alright, sing\nDon't cha wish your girlfriend was raw like me? (Raw)\nDon't cha wish your girlfriend was fun like me? (Big fun)\nDon't cha? (Ah-ah-ah) Don't cha?",
 "image": "https://images.genius.com/5463c03bb9295014f07b68e2a77316ea.1000x992x1.jpg"
}