{
 "title": "How Could You",
 "album": "Turning Point",
 "year": null,
 "lyrics": "It's kinda crazy babe\nHow I remember things, (like where you came from and how you had nothin')\nI went and made you fly\nPut extras on your ride, (didn't miss a birthday now you can't even remember mine)\n\nYou made it clear to me (you wasn't down for me)\n(Love made me blind, baby) but now I see\n(You had things up your sleeve, don't even lie to me) I even heard it from your family\n\nHow could you let somebody lay where I laid?\nHow could you give him everything that we made?\nHow could you call him all the names that you used to call me?\nHow could you, how could you just forget about me?\nHow could you teach him all the things I taught you?\nHow could you put him on to the Ghetto Kama Sutra?\nHow could you put me in the back and give him the front seat?\nHow could you, how could you just forget about me?\n\nYou must be out your mind\nYou got a lot of nerve (to think that I'm gon' chill after all the shit I heard)\nI damn near carried you\nI could've married you\nGood thing I found out before I bought that 7 karat for you\n\n(I know you're sick about) the way I found you out\n(Go head and pack it out) I hope he's got room in his house\nYou should have thought of me before you hopped in them sheets\nDamn I can't believe that you did this to me\n\nHow could you let somebody lay where I laid?\nHow could you give him everything that we made?\nHow could you call him all the names that you used to call me?\nHow could you, how could you just forget about me?\nHow could you teach him all the things I taught you?\nHow could you put him on to the Ghetto Kama Sutra?\nHow could you put me in the back and give him the front seat?\nHow could you, how could you just forget about me?\n\nGirl I tried to give you everything\nCan't believe the ways you repaid me\nGirl you had it all\nBut I guess my all wasn't good enough for you\nBaby I've accepted it\nAnd I ain't gone trip\nGirl I'm moving on\nSometimes I can't help but think that another man's gonna get the one I made for me\n\nHow could you let somebody lay where I laid?\nHow could you give him everything that we made?\nHow could you call him all the names that you used to call me?\nHow could you, how could you just forget about me?\nHow could you teach him all the things I taught you??\nHow could you put him on to the Ghetto Kama Sutra??\nHow could you put me in the back and give him the front seat?\nHow could you, how could you just forget about me?\n\nHow could you? (How could you, how could you just go and lay there?)\n(How could you, how could you give him everything?) How could you girl?\nHow could you? (How could you, how could you call him names like that?) Ooh\n(How could you babe, how could you babe?) How could you?...",
 "image": "https://images.genius.com/8a25e503ff87bd6f26563a5f50a7e867.640x640x1.jpg"
}