{
 "title": "Incredible Feelin’",
 "album": "Already Platinum",
 "year": "2005-07-12",
 "lyrics": "So incredible! Ladies and gentlemen!\nThis - is a Jazze Phazelle, Slim Thugga\nSlim Thug! Collaborinzale!\nOh boy! oh boy! oh boy!\n\nIt's such an incredible feeling\nIn this past year I done made a few million\nI tried to hide it, but ain't no concealing\nStacking my paper, up to the ceiling\n(I pimp) pimping since pimping been pimping\nMacking since macking been macking\nY'all niggas talking, but me and my niggas make it happen (I pimp)\nY'all niggas talking, but me and my niggas make it happen\nY'all niggas talking, but me and my niggas make it happen\n\nSlim having major change man, and it ain't no secret\nWith them diamonds chains and rings, it ain't hard to peep it\nYou can catch me in the shopping mall, rediculous bash\nCheck my restroom trash, all I do is pop tags (pop tags)\nAnd drop rags off of show room floors\nFa sho, I change loads like ho's change clothes\nThe whole industry knows, how we roll down in texas\nPhantom Rolls on 24s, rose gold diamond necklace\nSlim shows and tell, so these ho's know me well\nI been closing candy doors since Pac was in jail\nHell, I can't complain it's a beautiful feeling\nFrom being broke on ya ass to having cash to the ceiling\n\n\nI was a mill plus before this record deal stuff\nYou niggas talking but we walking shit, for real wit us\nThey think we country and ain't up on game\nUntil they see them different colors in the Boss Hogg chain\nOr the blue spray Bentley valeted outside of the club\nIs that 50 or Jay-Z? naw baby it's Thug\nAnd I ain't playing in no league, or on teams with Steve\nI ain't get this from no settlement that I didn't receive\nPlease believe, the world ain't seen too many me's\nI don't think the lord created a lot of these G's\nCause these days I just sit back enjoying the feeling\nI was broke on my ass now my cash to the ceiling\n\n\nPimping ain't dead! these ho's just scared!\nYou see it everywhere, but it starts in ya head\nNext comes the bread, shit's sweet like Jiffy\nUsed to do beats for a G, but now a nigga get fifty\nIt's my time to shine, hard times behind me (bling!)\nForty gold and platinum plaques! and still climbing\nAnd if I lose money, then the paper come find me\nSaid I was through with rapping, till Sho Nuff signed me\nThank God for the change, cause errbody ain't able\nMade a mill slanging beats, that's not including my label\nJazze Pha, Sho Nuff, every crib with some cable\nI got a dollar worth of dimes in my stable",
 "image": "https://images.genius.com/990f4c69b07973d4b6686006e2e539a2.500x500x1.jpg"
}