{
 "title": "Just A Lil Bit",
 "album": "Basedworld Paradise",
 "year": "2014-02-01",
 "lyrics": "I'm making niggas...for the money\nThese niggas hear my pain. You know what I'm saying?\nYou know we rocking all day for that, you know what I'm saying...cheddar chip, brother\nYou know what I'm saying?\n\nRide on, nigga, I'm fire homes\nAnd I break bread with the vatos\nI be getting cheese like...\nHer pussy is the nachos\nAnd nigga, I'm wet like a poncho\nAnd you can say I'm not though\nBut that would be a lie though\nAnd you don't want to be a liar, ho!\nI'm just off probation, so all my shit's sealed away\nYou niggas got a deal today\nI been signed, been signing, even in the hood I rock\nBig diamonds, real diamonds\nYou niggas got them pickle diamonds, simple math\nShh, fuck that stash\nGot the double up, keeping it real\nDivide it, so much money, tunes up, math up\nReal niggas in the streets\nThis is class, welcome to my world, we getting money now\nBut this is all about rap, Braap\nMake the guns clap, bitch i'm Lil Boss\nNo smoking with the gas mask, put the ice on, nigga\nAnd now I'm looking like an avalanche\nWalking down the street, you feel me?\nYou niggas see me bossing on the street\nBoss with a bad bitch, you know she like: \"yee!\"\nFor real, lil nigga got a rap like Tyson\nPut back, all things, all black\nMatter of fact, maybe...\nYou niggas think man, I'm old enough to stack\nIn my lap, paper stack like...\nYou feel me, jacking off on hundreds man\nNigga, I always come back\nWhen Lil B hit the club, man a nigga run that\nEvery person like: \"motherfucking damn, who's that?!\"\nYeah bitch, it's Lil B, it's Lil B, bitch\nFuck with the breadwinners, you feel me?\nAnd nigga, you might get skied bitch\n16, I was famous, still in PE, bitch\n15, I was rapping, selling CD's, bitch\n17, i'm the man, not playing with life\nYou feel me? I did what I wanna do\nI do what I wanna do\nYou know I took over just to get this\nYou niggas know I rep this shit\nYou feel me? Working just to get rich\nFucked 100,000 ho's sitting on 26\nGot a thick bitch, pussy solid like a\nFence is, not trying to be offensive\nMy rapping skills is endless, I go and never stop\nIt's like I'm rapping off of 10\nKnow what I'm saying? (popping pills) Paying 20 cents\nI got .50, just a lil bit, just a lil, bitch\nYou crying like a lil bitch\nI'ma let that fucking K spit\nReal niggas ride off, tinted glass in the spaceship\nFucking with the space bitch, her lips like the state pen\nBig, and that's real\nPussy like The Matrix, bitch what's the deal?\nI'm flipping backwards for the motherfucking mil's\nI'm like a Jedi, because I'm popping dollar bills\n\nYou know what I'm saying?\nYou know, we getting money like that Star Wars, brother\nWhat it do my brother?\nI'ma tell you something man",
 "image": "https://images.genius.com/77e2cb120fada3c527e03483c5686dd9.994x996x1.png"
}