{
 "title": "Run It!",
 "album": "Run It! EP",
 "year": "2005-06-30",
 "lyrics": "Okay, check it, check it, check it out\nIt's Santana again steppin', steppin', steppin' out (Uh)\nOne of the brand-new big-boy toys\nI do big-boy things, I make big-boy noise, 'cause\nI know what girls want (Want), I know what they like (Like)\nThey wanna stay up (Ayy!) and party all night\nSo bring a friend\n\nLet me talk to you, tell you how it is\nI was thinking when I saw that body\nGotta get shawty, tell her what the young boy gon' do\nDamn, them chicks with you gotta be your kin\nBabe, pretty thick with the kick that's sick\nThat need to be hit, so tell me what y'all gon' do\n[Pre-Chorus: Chris Brown & \nJuelz Santana\n]\nI got friends and you got friends (\nWord\n, oh)\nThey hop out, and you hop in (\nWord\n, oh-oh)\nI look fly and they jocking (\nWord\n)\nThe way you drop, drop makes me wanna pop\nI got friends and you got friends (\nWord\n, hey)\nThey hop out, and you hop in (\nWord\n)\nI look fly and they jocking (\nWord\n)\nThe way you drop, drop makes me wanna pop\n\nIs ya man (Man) on the floor? (Floor)\nIf he ain't (Ain't), lemme know (Know)\nLet me see if you can run it, run it\nGirl, indeed I can run it, run it\nIs ya man (Man) on the floor? (Floor)\nIf he ain't (Ain't), lemme know (Lemme know)\nLet me see if you can run it, run it\nGirl, indeed I can run it, run it (Come here!)\n\nYou'll see, girl, I can set you off\nDon't believe my age is gonna slow us down\nI can definitely show you things to have you saying I can't be sixteen\nOnce I get in you won't let go\n(And I) I'll have the girls wishing they were you\n(And I) I know you heard about me\nBut guess what's going down if we leave\n[Pre-Chorus: Chris Brown & \nJuelz Santana\n]\nI got friends and you got friends (\nWord\n, oh)\nThey hop out, and you hop in (\nWord\n, oh)\nI look fly and they jocking (\nWord\n)\nThe way you drop, drop makes me wanna pop\nI got friends and you got friends (\nWord\n)\nThey hop out, and you hop in (\nWord\n, hey)\nI look fly and they jocking (\nWord\n, ooh)\nThe way you drop, drop makes me wanna pop (Ooh, ooh)\n[Chorus: Chris Brown & \nJuelz Santana\n]\nIs ya man (Man) on the floor? (Floor, \nuh-huh\n)\nIf he ain't (Ain't), lemme know (Know, \nuh-huh\n)\nLet me see if you can run it, run it (\nYeah\n)\nGirl, indeed I can run it, run it (\nAyy\n)\nIs ya man (Man) on the floor? (Floor, \nuh-huh\n)\nIf he ain't (Ain't), lemme know (Lemme know, \nuh-huh\n)\nLet me see if you can run it, run it (\nAyy\n)\nGirl, indeed I can run it, run it (\nLet's go\n)\n[Bridge: Chris Brown & \nJuelz Santana\n]\nGirl, you feel right (Feel right)\nMake me feel like (Feel like)\nI wanna do a little something (Do a little something)\nAin't no thing 'less you do it for sure\nGirl, the way that you're wearing them jeans is turning me on\nI'm the hottest thing that's in these streets (\nDipSet, Santana\n)\nSo, baby, won't you rock me? (\nAyy\n)\n\nMake it drop, honey (Honey), make it pop, honey (Honey)\nWhip whop, tick-tock to the clock for me\nDon't stop doing that (Don't)\nAnd shawty know I mean what I say so she won't stop doing that\nPlus I heard if you can dance, you can bump\nWell dance time is us, let's go, let's go (Yup)\nWe can get it in (Yup), we can gets some friends\nDo it like the Ying Yang twins, start whispering\nWait 'til you see my ayy!\nWait 'til you see my ayy!\nLet me fall back, you ain't ready for all that\nHave you sleep late, real late, yeah, taking a long nap (Ayy)\nYou tell your friends to get with my friends\nWe can be friends, switch and meet friends\n(Switch!)\n We can do it all night long and...\n'Til the clock hit morning, ya dig? (Ayy)\n\nIs ya man (Man, oh) on the floor? (Floor)\nIf he ain't (Ain't), lemme know (Know, ooh, ooh, yeah)\nLet me see if you can run it, run it\nGirl, indeed I can run it, run it (Oh, woah-oh)\nIs ya man (Man, oh, woah-oh) on the floor? (Floor)\nIf he ain't (Ain't), lemme know (Lemme know, mmm)\nLet me see if you can run it, run it (Run it)\nGirl, indeed I can run it, run it (Yeah)\n[Outro: Chris Brown & \nJuelz Santana\n]\nOh-oh (\nUh\n)\nOh, oh (Woo! \nUh-huh\n)\nOh, woah (Woo!)\nOh-oh (Woo! Chris Brown)\n(\nAyy!\n Woo!)\n(Woo! \nAyy!\n)\n(Woo!)\n(\nAyy, ayy\n)",
 "image": "https://images.genius.com/9a9971734fd517576e979b7e9856face.953x953x1.jpg"
}