{
 "title": "Stay Fly",
 "album": "Most Known Unknown",
 "year": "2005-09-27",
 "lyrics": "Yeah! \nFor the first time, it's going down, history baby\nNew Three 6 Mafia, featuring 8Ball & MJG, Young Buck\nIt's a Tennessee thing\n\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\n\nThey call me the Juice and you know I'ma stunt\nRiding in the car with some bump in the trunk\nTone in my lap and you know it's a pump\nBreaking down the good green, rolling the blunt\nGhetto pimp type, girls say I'm the mayne\nIce on the wrist with the ice in the chain\nRiding through the hood, got me gripping the grain\nAnd I'm sipping the same while I'm changing the lane\nEyes real tight cause I'm choking the green\nVision messed up cause I'm drinking the lean\nMessing with a D-boy, riding them big toys\nMake your main gal wanna get on my team\nShe gotta give it up before she get in my car\nI ain't Denzel but I know I'm a star\nCause when I'm in the club, I be back in the fog\nIn the V.I.P. part and be buying the bar\n\nDJ Paul is a dog, one you do not trust\nYou leave your green around me, nigga your green gon' get lit up\nYou leave your drank around me\nBelieve your drank gon' get drunk up\nYou leave your girl around me, if she bad, she gon' get stuck\nThese niggas is spies\nWe live them lives and keep them eyes tight\nRiding 'round what they like\nMake a couple nuns a couple of dykes\nSo purple, purple, purple, and swallow it down\nWith the yurple, yurple, yurple, it's going down\n\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\n\nPuff, puff, pass, nigga roll that blunt\nLet's get high, nigga, smoke us one\nPaul pulled out the Phantom, niggas can't stand it\nBut them hoes gon' come out\nJust really wanna smoke my weed\nFuck these hoes and stack my Gs\nStop at the light and pause on Three\nHit the mall and it be all on me, but\nGotta keep one eye up on the po-po\nClose the window when I roll the indo\nKnow they mad cause I'm rolling Benzo\nThis that purple, not pretendo\nThree 6 Mafia, them my kinfolks\nSo when I'm in Memphis, Tennekee\nI just might not bring my own\nCause them niggas there let me smoke for free\n\nWhat's up Mary? How you doing? Mary Jane stalking me\nSince I have met you, girl, you ruled my brain\nYou stole my heart, right from the start\nSo I broke you down, let momma put you in the 'gar\n\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\nI gotta stay fly-y-y-y, y-y, y-y, y\n'Til I die-ie-ie-ie, ie-ie, ie-ie, ie\n\nPremro full of that dro\nLeave the club full of Rose' Mo\nYour girlfriend wanna ride with me\nIn a car with a pimp, where she supposed to be\nYou ain't met no dude spit it cold as me\nThe bag of kush cost 650\nHave a nigga who smoke Reggie Miller\nCoughing and choking constantly\nTaste like fruit when you hit it\nGotta have bread to get it\nSmoke all night, sleep all day\nThat's the epitome of the American way\nRoll that shit, light that shit, hit that shit, hold that shit\nBlow that shit out slow, then pass it to me bro\n\nMJ finna sprinkle in some of that\nSuper incredible, have a nigga running back\nWhere that nigga with the hood sticky number at?\nCutting up a cigarillo like a lumber jack\nIn the morning, when I need this\nAnd breath again a whole lot of weed\nBut I'm needing somebody to give me what I need\nWhen I want nothing less then the best of the trees\nDJ Paul and Juicy J, 8Ball and MJG\nAnd Young Buck, we don't give a fuck\nWe must represent this Tennessee\nWe drink a whole lot of Hennessy\nNigga got a lil' hair on his chest\nDo me like Bill Clinton girl, take it out your mouth\nWe'll shoot it right down on your dress\n\nFly-y-y-y, y-y, y-y, y",
 "image": "https://images.genius.com/98661713d79eb67708e40ba2387700bf.600x600x1.jpg"
}