{
 "title": "Trapped in the Closet Chapter 1",
 "album": "TP.3: Reloaded",
 "year": "2005-04-05",
 "lyrics": "Seven o'clock in the morning\nAnd the rays from the sun wakes me\nI'm stretching and yawning\nIn a bed that don't belong to me\nAnd a voice yells, \"Good morning, darling\" from the bathroom\nThen she comes out and kisses me\nAnd to my surprise she ain't you\nNow I've got this dumb look on my face like what have I done?\nHow could I be so stupid to be have laid here 'til the morning sun?\nMust have lost the track of time\nOh, what was on my mind?\nFrom the club, went to her home\nDidn't plan to stay that long\nHere I am, quickly tryin' to put on my clothes\nSearching for my car keys\nTryin' to get on up out the door\nThen she stretched her hands in front of it\nSaid, \"You can't go this way\"\nLooked at her, like she was crazy\nSaid, \"Woman, move out my way\"\nSaid, \"I got a wife at home\"\nShe said, \"Please don't go out there\"\n\"Lady, I've got to get home\"\nShe said, her husband was comin' up the stairs\n\"Shh, shh, quiet, hurry up and get in the closet\"\nShe said, \"Don't you make a sound, or some shit is going down\"\nI said, \"Why don't I just go out the window?\"\n\"Yes, except for one thing, we on the fifth floor\"\n\"Shit, think, shit, think, shit, quick, put me in the closet\"\nAnd now I'm in this darkest closet, tryin' to figure out\nJust how I'm gonna get my crazy ass up out this house\nAnd he walks in and yells, \"I'm home\"\nShe says \"Honey I'm in the room\"\nHe walks in there with a smile on his face\nSayin', \"Honey, I've been missin' you\"\nShe hops all over him and says \"I've cooked and ran your bathwater\"\nI'm telling you now, this girl's so good that she deserves an Oscar\nThrows her in the bed and starts to snatching her clothes off\nI'm in the closet, like man, what the fuck is going on?\nYou're not gonna believe it, but things get deeper as the story goes on\nNext thing you know, a call comes through on my cell phone\nI tried my best to quickly put it on vibrate\nBut from the way he act, I could tell it was too late\nHe hopped up and said, \"There’s a mystery going on\nAnd I'm going to solve it\"\nAnd I'm like, \"God please, don't let this man open this closet\"\nHe walks in the bathroom\nAnd looks behind the door\nShe says, \"Baby, come back to bed\"\nHe says, \"Bitch, say no more\"\nHe pulls back the shower curtain\nWhile she's biting her nails\nThen he walks back to the room\nRight now, I'm sweating like hell\nChecks under the bed (Bed)\nThen under the dresser (Dresser)\nHe looks at the closet (Closet)\nI pull out my Beretta (Beretta)\nHe walks up to the closet (Closet)\nGet closer to the closet (Closet)\nNow he's at the closet (Closet)\nNow he’s opening the closet (Closet, closet, closet...)",
 "image": "https://images.genius.com/61317e0768d6ebb6311c460eaaa0755c.220x220x1.jpg"
}