{
 "title": "Where Da At",
 "album": "The Heart of Tha Streetz, Vol. 1",
 "year": "2005-05-24",
 "lyrics": "What's your heart beatin for, ha? (You SCARRRRRED)\nWhat's your heart beatin for, ha?\n + (B.G.)\nYeaaaaaaaaaaahhh! (Uhh, deez niggas scarred)\nWhat's up ladies and gentlemen? (Deez bitch niggas scared)\nBoys and girls (It's lil B. Gizzle, Homebwoi)\nColliPark music (ColliPark, Chopper City)\nAnd I'm so sick and tired of bein sick and tired\nOf bein sick and tired bein sick and muh'fuckin tired\nAll these pussy-ass niggas (I see they heart beatin - I see it)\n(I know what's happenin with 'em)\n(We gon' do it like this-sheah - c'mon)\nWhat's your heart beatin for, ha? (You SCARRRRRED)\nWhat's your heart beatin for, ha?\n\nWHERE DEY AT? In the club; WHERE DEY AT? Showin love\nWHERE DEY AT? In the drop ridin twenty-deuce dubs\nWHERE DEY AT? In the street; WHERE DEY AT? With the beat\nWHERE DEY AT? With dey bitch still talkin 'bout me\nWHERE DEY AT? In the back; WHERE DEY AT? In the 'llac\nWHERE DEY AT? In the hood still gettin they ass jacked\nWHERE DEY AT? Gettin 2-way; WHERE DEY AT? In the who-ay\nWHERE DEY AT? Talkin bad but it's still all goo-ey\n\nMan I'm rollin with the gangsters, kick it with the G's\nHustle with the hustlers I'm \"The Heart of the Streetz\"\nGrind with the ballers, ball with the grinders\nKeep it real with my clique so my whole team shiners\nRide with the riders, swim with the sharks\nIf I get caught I got nuttin to say to the law\nI'm built to last, ever since them niggas killed my dad\nCrackin a pen and pad is all I had\nIt's get it how you live with me\nBusters don't know how to deal with me; it's all real with me\nAll the street niggas scared of me\nAll the hot girls love me they say \"Boy put that drill in me\"\nI come through, limo tint on the truck\nI got a whole block spooked when I ride slow, puttin it up\nGot straight, Seagram's gin in my cup\nI ain't gon' do ya nuttin scary-ass nigga, what'cha heart beatin for?\nWhat's your heart beatin for? (You SCARRRRRED)\nWhat's your heart beatin for, ha?\n\n\nI'm in the club, post up, way in the back\nGot a bottle of gin and I snuck in with the mac\nGot my fresh bows on, breeze on my feet\nHoes love when I'm thuggin in my fresh white tee\nI'm 'bout whatever; Gizzle is a G\nWe could do it however, it don't matter to me\nWe can do it right here, we can take it outside\nI'm young, but believe, I been 'bout mine\nI just ride when it's time to ride\nI grind when it's time to grind; slangin hot when it's time to bust\nSlangin dick when it's time to fuck\nI'm a Chopper City nigga, don't try your luck\nYou want beef? I ain't scared, nigga I'm everywhere\nYou don't be where you say you be, you're never there\nYou actin like you 'bout it, bitch nigga you scared\nI see your heart beatin, so busta break bread\nWhat's your heart beatin for? (You SCARRRRRED)\nWhat's your heart beatin for, ha?\n\n\nNiggas caught in the zone, they better watch it when I'm cockin my chrome\nCause at clubs, yeah I slip one in your dome, you better leave me alone\nI ain't no bitch, I don't talk shit on the phone\nI got somethin that just might follow you home, now ain't I dead-ass wrong\nHow could you react, if your brains are blown\nI guess that fat bitch is singin her song; that bitch is singin her song\nYou busted wide, little boys ain't grown\nYour mouth is heavy but your back ain't strong, and once again it's on\nYou must be smokin on that Cheech & Chong\nThink you can handle with somethin this wrong; with somethin this wrong\nJust write it in blood, or carve it in stone\nOtherwise you don't want no problems with homes; don't want no problems with homes\nYou can't get rid of me, not even penitentiary\nA friend of me, you need to be, I'm hotter than humidity\nWithout a mask, jack a nigga for his cash\nHot led make a motherfucker heart beat fast\nWhat's your heart beatin for? (You SCARRRRRED)\nWhat's your heart beatin for, ha?",
 "image": "https://images.genius.com/fee3a8f56d06a38730c64fd8065a32c2.500x500x1.jpg"
}