{
 "title": "Fight Night",
 "album": "No Label II",
 "year": "2014-02-25",
 "lyrics": "If you know me, know this ain't my feng shui\nCertified everywhere, ain't gotta print my resume (Takeoff)\nTalking crazy, I pull up, andale\nR.I.P. to Nate Dogg, I had to regulate\n\nAyy Twaun turn that beat down\nHaha\nPublic Service Announcement\nWhere all my rich niggas at, man?\nYRN shit, man\nMigo!\n\nBroke niggas stand to the left (Left!)\nMy rich niggas stand to the right (To the right)\nLil' mama, she keep looking at me (Lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit it with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night\n\nIf you know me know this ain't my feng shui\nCertified everywhere, ain't gotta print my resume (Takeoff)\nTalking crazy, I pull up andale\nR.I.P. to Nate Dogg, I had to regulate\nPocket rocket fire, watch him disintegrate\nIt's a truckload coming on the interstate (Truckload!)\nSirloin steak all on my dinner plate\nYour main bitch say she wanna make a sex tape\nRich nigga, I could never be a broke nigga (Rich nigga)\nBroke niggas, I can never get along with them\nAlways been hated since a little nigga (Always)\nIt's forever pussy nigga gotta deal with it (Rich nigga!)\n\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (Lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit it with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night\n\nQuavo!\nFloat like a butterfly, sting like a bee\nRumble, young nigga, rumble! (Rumble!)\nLil' mama want a nigga like me in the sheets\nIce Cube knock it out like Deebo (Bow, bow!)\nNow who's that talking that gangsta shit?\nSomebody gonna kick your ass (kick your ass)\nWhen I walk up in the club I better make a thunderstorm (Yuh)\nLet them know that this a whole lot of cash\nRich niggas on the right, all night (Rich nigga)\nBroke niggas to the left, by yourself (Brokanese)\nNow who the hell just said that the roof on fire?\nCall 911 like Wyclef\n\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (Lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit it with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night\n\nI'm a rich nigga, I don't like a bitch nigga\nSnitch nigga, broke nigga, I don't deal with you\nAll of my niggas, official, my bitches they skrippers\nMy niggas they criminals trying to get to the M&Ms\nIf your bitch is so innocent, why she sucking my children\nLights, camera, action, diamond dancing bitch we go in the building\nBad bitch make it clap, like Magnolia\nYoung rich nigga on the couch talking to Oprah\nBottles in the VIP while I stand on the sofa\nI don't speak your language, Brokanese, I thought I told ya\nThese bitches they be smokin' on hookah, my nigga ballin' like Hoosiers\nPull up in the Double R, go scare ya bitch, Freddy Krueger\nFlooded Franck Muller\n\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (Lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit it with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night",
 "image": "https://images.genius.com/53310a475390a4cdb78a043aaf9763a6.1000x1000x1.png"
}