{
 "title": "Hot Boy",
 "album": "Life Of A Hot Boy",
 "year": "2015-06-13",
 "lyrics": "That boy Cassius\nYeah, Fresh\nYou know the streets 'bout this shit, nigga\nI walk around this motherfucker fully loaded\nLoaded, loaded, fully\nYeah\n\nCome through looking like a dope dealer (Get it)\nI ain't stuntin' none of ya'll broke niggas (None of y'all)\nAt the trap spot where we post, nigga (Get it)\nI'm a get a mansion and a boat, nigga (Get it)\nFerragamo frames and a coat, nigga (Fresh)\nFuck girlfriend, she's a gold digger\nOne thing I don't need is no nigga\nBought a AMG Benz cause it go quicker (Skrr)\nFresh in the VIP, lit up (Lit up)\nFuck nigga try and get hit up (Woo!)\nAll it take is one call, nigga (Call, nigga)\nI have a nigga set at ya'll niggas (Hello?)\nInstagram timeline full of ya'll bitches\nYa'll niggas unofficial trying to act official (What?)\nYou a pussy ass nigga, and I know it, nigga (I know it)\nYou a pussy ass nigga, and you show it, nigga\nBallin' real hard, real, real, real hard\nThey don't even like the fact, know I'm playing with the set\nHad the motherfucker offset white\nThen I had to paint the motherfucker black, how you love that?\nBallin' like a motherfucking Hot Boy, like we in '98\nNigga, how it look? Juvie\nYoung nigga ballin', I made a movie\nAll these hoes in the jacuzzi (Hey)\n\nBallin' like a Hot Boy, Hot Boy, Hot Boy, Hot Boy, Hot Boy, Juvie\nStickin' to the G-Code, 400, Beast Mode, y'all niggas know how we do it\nBallin' like a Hot Boy, a Hot Boy, a Hot Boy, a Hot Boy, nigga, Lil Weezy\nFeelin' like Birdman and Meechy, block out, lights out, nigga, we eatin' (What you did?)\nBallin' like a Hot Boy, a Hot Boy, a Hot Boy, a Hot Boy, nigga, B. Gizzle\nChopper in the city, I'm the motherfucking made man, ya'll pussy niggas in the middle\nBallin' like a Hot Boy, a Hot Boy, a Hot Boy, a Hot Boy, nigga, Young Turk\nYoung nigga, thuggin' is first, young nigga puttin' in work\n\nAll-star, 2014, I was drunk as fuck on Bourbon\nYoung nigga just swervin'\nYoung nigga just splurgin'\nI came from servin'\nYoung nigga home workin'\n400 degrees.  Tuesdays... and Thursdays\nBeat the block, like Mannie Fresh\nYoung nigga been had a check\nQuiet as hell, like Uncle Slim\nYou can tell I got some M's\nIf I don't, I'm gon' get them\nOlympic pool bitch take a swim\nGuerilla warfare for you and him\nSoulja rag for Soulja Slim\nFuck around in the Magnolia\nAll my Atlanta niggas screaming, \"What up, whoadie?\"\nBig Rollie, VVS's loaded\nIn the projects, niggas want to hold it\nPlay around I'm a unload it\nReal shit, nigga, unfolded\nBankrolls, nigga, overloaded\nNigga playing, my shit golden\n\nBallin' like a Hot Boy, Hot Boy, Hot Boy, Hot Boy, Hot Boy, Juvie\nStickin' to the G-Code, 400, Beast Mode, y'all niggas know how we do it\nBallin' like a Hot Boy, a Hot Boy, a Hot Boy, a Hot Boy, nigga, Lil Weezy\nFeelin' like Birdman and Meechy, block out, lights out, nigga, we eatin'\nBallin' like a Hot Boy, a Hot Boy, a Hot Boy, a Hot Boy, nigga, B. Gizzle\nChopper in the city, I'm the motherfucking made man, ya'll pussy niggas in the middle\nBallin' like a Hot Boy, a Hot Boy, a Hot Boy, a Hot Boy, nigga, Young Turk\nYoung nigga, thuggin' is first, young nigga puttin' in work\n\nThat's you in that 'Big Body Benz', huh?",
 "image": "https://images.genius.com/10680bbd40b794ad811668d3a0820364.500x500x1.jpg"
}