{
 "title": "Loyal",
 "album": "X",
 "year": "2013-12-19",
 "lyrics": "[Intro: Lil Wayne & \nChris Brown\n]\nYoung Mula, baby!\nHaha\n(\nLet me see\n)\nYou thought it was over?\n(\nLet me see\n)\n[Verse 1: Lil Wayne & \nChris Brown\n]\nI wasn't born last night\nI know these hoes ain't right\nBut you was blowin' up her phone last night\nBut she ain't have her ringer nor her ring on last night, ooh\nNigga, that's that nerve\nWhy give a bitch your heart when she'd rather have a purse?\nWhy give a bitch an inch when she'd rather have nine?\nYou know how the game goes, she be mine by halftime, I'm the shit, ooh\nNigga, that's that nerve\nYou all about her, and she all about hers\nBirdman Junior in this bitch, no flamingos\nAnd I done did everything but trust these hoes (\nLet me see\n)\nCB, fuck with me\n\nWhen a rich nigga want you\nAnd your nigga can't do nothing for ya\nOh, these hoes ain't loyal\nWhoa, these hoes ain't loyal\nYeah, yeah, let me see\n\nJust got rich\nTook a broke nigga's bitch\nI can make a broke bitch rich\nBut I don't fuck with broke bitches\n\nGot a white girl with some fake titties\nI took her to the Bay with me\nEyes closed, smokin' marijuana\nRollin' up that Bob Marley, I'm a rasta\nShe wanna do drugs (Drugs)\nSmoke weed, get drunk (Wasted)\nShe wanna see a nigga trap\nShe wanna fuck all the rappers (Let me see)\n\nWhen a rich nigga want you (Want you, baby)\nAnd your nigga can't do nothing for ya (Nothing, no)\nOh, these hoes ain't loyal (No, they ain't)\nWhoa, these hoes ain't loyal\nYeah, yeah, let me see\n\nBlack girl with a big booty\nIf she a bad bitch, let's get to it right away\nWe up in this club\nBring me the bottles\nI know, girl, that you came in this bitch with your man\nThat's a no-no, girl\nAll this money in the air\nI wanna see you dance\n\nJust got rich (Got rich)\nTook a broke nigga's bitch (Yeah)\nI can make a broke bitch rich\nBut I don't fuck with broke bitches (Girl, it's you)\n\n(Oh-oh)\nWhen a rich nigga want you (Yeah, yeah, want you, baby)\nAnd your nigga can't do nothing for ya (No, nothing, no-whoa)\nOh, these hoes ain't loyal (Oh-oh-oh-oh-no)\nWhoa, these hoes ain't loyal\nYeah, yeah, yeah, yeah, yeah\nYeah, yeah, let me see\n\n(Ha!) Rich young nigga\nName got bigger and my change got bigger, so my chains got bigger\nFerrari, Jaguar, switchin' four lanes\nWith the top down screamin' out, \"Money ain't a thing\"\n (Ha!)\nHa, me and CB in the Bay with her (Bay with her)\nI sent her back home so you can lay with her\nOkay, let's talk about this ice that I'm carryin'\nAll these karats like I'm a fuckin' vegetarian\nShout-out Weezy F., keep a redbone wet\nRose Rolex, hoes on deck, she know I got a check\nDo it too good when she ride that dick (Woo)\nMan, I wouldn't trust that bitch, no (Haha)\n\nCome on, come on, girl, why you frontin'?\nBaby, show me something\nWhen I call her, she gon' leave\nAnd I bet that bottom dollar she gon' cheat\nCome on, come on, girl, why you frontin'?\nBaby, show me something\nYou done spent your bread on her\nAnd it's all for nothing (Yeah, yeah, yeah, yeah, let me see)\n\n(Uh-huh)\nWhen a rich nigga want you (Want you, baby, yeah, woo)\nAnd your nigga can't do nothing for ya (Can't do nothing for you)\nOh, these hoes ain't loyal (Oh, no)\nWhoa, these hoes ain't loyal\nYeah, yeah, let me see\n(Uh-huh)\nWhen a rich nigga want you (Want you, baby, yeah)\nAnd your nigga can't do nothing for ya (Oh-whoa-oh)\nOh, these hoes ain't loyal (They be playin' games, yeah)\nWhoa, these hoes ain't loyal (Oh-oh)\nYeah, yeah, let me see\n\nYeah, let me see\nYeah-ah, let me see\nLet me see\nOh, these hoes ain't loyal\nLet me see",
 "image": "https://images.genius.com/4c6a12df386ed1ab77c0efec44c1e49b.1000x1000x1.png"
}