{
 "title": "New Flame",
 "album": "X",
 "year": "2014-06-30",
 "lyrics": "There can be one only you, whoa-oh (Oh-oh, oh-oh, oh-oh)\nAnd baby, God could never make two, whoa, na-na-na (Oh-oh, oh-oh, oh-oh)\nAnd I know you came here with your crew, whoa-oh (Oh-oh, oh-oh, oh-oh)\nBut I promise you that it feels like it's just us two, uh-huh (Oh-oh)\n\nOh, I don't know what you had planned to do tonight (Oh-oh, oh-oh, oh-oh)\nBut I just wanna be the one to do you right, right (Oh-oh)\nWhen we're standing here, looking at each other, baby, eye to eye (Oh-oh, oh-oh, oh-oh)\nAnd I'm hoping that you're thinking 'bout leaving with me tonight\n\nWho said you can't find love in the club?\n'Cause I wanna tell them they wrong\nCome on, just, baby, try a new thing\nAnd let's spark a new flame\nYou gon' be my baby (Yes)\nLove me, love you crazy (Yes)\nTell me if you with it (Yes)\nBaby, come and get it\nBaby, try a new thing (Ursher, baby)\nAnd let's spark a new flame\nBreezy, let me holla at her\nYeah, man, listen\n\nI can't believe you came here all alone\nBaby girl, where's your lover?\nOh, it don't really matter\n'Cause I got plans to get to know you better, yeah\nBaby, baby, baby, baby\nLet's make what we got here last forever, uh\nGirl, 'cause I don't wanna let you go, never (Oh-oh)\n\nI don't know what you had planned to do tonight (Oh-oh, oh-oh, oh-oh)\nGirl I just wanna be the one to do you right, right (Oh-oh)\nWhen we're standing here, looking at each other, baby, eye to eye  (Oh, yeah, yeah, oh-oh, oh-oh, oh-oh)\nBaby, I hope that you're thinking 'bout leaving with me tonight\n\nWho said you can't find love in the club? (Love, oh)\n'Cause I wanna tell them they wrong (Oh, whoa-oh, tell them that they wrong)\nCome on, just, baby, try a new thing (Try a new thing, hey)\nAnd let's spark a new flame (Oh, yeah, yeah)\nYou gon' be my baby (Yes, oh)\nLove me, love you crazy (Yes, crazy)\nTell me if you with it (Yes, with it)\nBaby, come and get it\nGirl, just try a new thing (Gonna spark it up, baby, try a new thing)\nAnd let's spark a new flame\nShe know what time it is, Chris, yeah\n(M-M-M-M-M-Maybach Music)\n\nHome plate, World Series, how a nigga slidin' in her (Ugh)\nBaby, I'm a boss, I'm talkin' George Steinbrenner\nPanamera, Yogi Berra, my two-seater, Derek Jeter\nGot more stripes than all these niggas\nBabe Ruth ballin' in a Beamer (Woo)\nCollar on my Polo (Woo), kisses on my necklace (Agh)\nAll my diamonds watchin', now my watches gettin' jealous (Haha)\nSmoking on a bomb in my autographed LeBron's\nYeah, she told me I'm the one, that's when I only hit it once\nM-M-M-M-M-Maybach Music\n\nWho said you can't find love in the club? (No)\n'Cause I wanna tell them they wrong (Baby)\nCome on, just, baby, try a new thing (New thing, baby)\nAnd let's spark a new flame (Baby)\nYou gon' be my baby (Yes, be mine)\nLove me, love you crazy (Yes)\nTell me if you with it (Yes)\nBaby, come and get it\nBaby, try a new thing\nAnd let's spark a new flame",
 "image": "https://images.genius.com/5d2cc5b7ba0558591a1727035a067fb7.1000x1000x1.jpg"
}