{
 "title": "OG Bobby Johnson",
 "album": "Who Is Que.",
 "year": "2013-09-11",
 "lyrics": "You are now listening to a Bobby Johnson Beat\n\nWord on the street I'm a suspect\nHangin' with the killers in the projects\nPotato on the barrel keep quiet (shh)\nCatch a nigga slippin' from behind (boom)\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\n\nWipe a nigga out like an outbreak\nChoppa start bustin' make the house shake\nFuck niggas sweeter than a pound cake\nGet your eyes on your chin better watch what your mouth say\nLean with the footballs got a nigga trippin' (Xans)\nFuck it, fuck it, nigga keep sippin'\nDirty AK with the beam on it\nClip so long I could lean on it\nFree my niggas locked behind bars\nMoved a hundred pounds before a lawyer beat the charge (beat it)\nPack touchdown, run it back like Marshall Faulk\nIf a nigga try to rob, fuck it, hit him wit the hawk (boom)\n\nWord on the street I'm a suspect\nHangin' with the killers in the projects\nPotato on the barrel keep quiet (shh)\nCatch a nigga slippin' from behind (boom)\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\n\nHundred bands on your head get the job done\nThrow it up, throw it up, nigga where you from?\nWhole hood hot cause your nigga hittin' licks\nAin't made a mill yet but he's still nigga rich\nStick 'em up, stick 'em up, stick 'em (stick 'em up)\nHow you want it nigga? Full or the semi\nLurkin' for the cash, searchin' for the bag\nYoung nigga wildin', throwin' up flags\nShooters on the roof with a scope (boom-boom)\nMoney make 'em treat you like the pope (like a king)\nWork the blocks like Dikembe in the post (cook 'em up)\nNigga hit it with the fork (hit it)\n\nWord on the street I'm a suspect\nHangin' with the killers in the projects\nPotato on the barrel keep quiet (shh)\nCatch a nigga slippin' from behind (boom)\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\n\nIt's the niggas that you trust that'll probably turn feds\nHatin' on your heart cause you're rockin' Hermes\nEspecially if your money long, guarantee you turn heads\nRay Ray'll sell it all\n, gotta watch the shermheads\nHate, hate, hate (hate); jealousy, that's a bitch nigga trait\nThese niggas snakes, wanna know what you make\nGrimy ass ho, do you like Larenz Tate (Caine)\nYoung nigga runnin' with the cannon\nNever \nlet a nigga see you\n panic\nDope boys in the hood workin' with the Hispanics\nOn the phone with the plug, nigga speakin' Spanish\n\nWord on the street I'm a suspect\nHangin' with the killers in the projects\nPotato on the barrel keep quiet (shh)\nCatch a nigga slippin' from behind (boom)\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson\nO.G. Bobby Johnson",
 "image": "https://images.genius.com/3f7c2239043089a2effc364747dba056.600x600x1.jpg"
}