{
 "title": "Or Nah",
 "album": "Beach House EP",
 "year": "2014-01-06",
 "lyrics": "(*Laughter*)\nI gotta lotta cash\nI don't mind spendin' it\n(*Laughter*)\n\nI'ma smoke this joint then I'ma break you off\nI be lying if I said you ain't the one\nAll these tattoos in my skin, they turn you on\nLotta smoking, drinking, that's the shit I'm on\nHeard you not the type that you take home to Mom\nIs we fucking when we leave the club or nah?\nI ain't spending cash for nothing I wanna see you take it off\nI'ma pop this bottle, you gon' give me brain or nah?\nHeard you from the hood, you rep that thing or nah?\nGotta lotta ass, you gon' shake that thing or nah?\nHeard you smoke blunts, you down with paper planes or nah?\nI feel like I'm Tony, you my boss? I'm thinking nah\nThe whole world I take it on\n\nYou gonna run it for these hundreds girl or nah?\nShow me is you really 'bout your money girl or nah?\nDon't play with a boss, girl, take it off\nTake it for a real one, you gon' get it all\n\nIs you really 'bout your money or nah?\nCan you really take dick or nah?\nCan I bring another bitch or nah?\nIs you with the shits or nah?\nOh nahhh, oh nahhh\nWould you ride for your nigga or nah?\nWould you die for your nigga or nah?\nWould you lie to your nigga or nah?\nOh nahhh\nCan you really take dick or nah?\nCan I bring another bitch or nah?\nIs you with the shits or nah?\nOh nahhh, oh nahhh\nWould you ride for your nigga or nah?\nWould you die for your nigga or nah?\nWould you lie to your nigga or nah?\nOh nahhh\n\nGirl make that ass clap for young dollar sign\nYou already know my money go a long time\nI could slide for it, like Nelly\nI'm-a go as far as you let me\nGirl, is you sucking me or fucking me or nah?\nCan I bring another bitch? Let's have a threesome\nKeep saying you a freak, you gon' prove it or nah?\nHis bitch keep looking at me she choosin' or nah?\nYou's a ride-or-die chick, you with this shit or nah?\nSay you not a side bitch, you all in or nah?\nYou gon' make them eggs cheesy with them grits or nah?\nCan you do it like that, on this dick or nah?\n\nYou gonna run it for these hundreds girl or nah?\nShow me is you really 'bout your money girl or nah?\nDon't play with a boss, Girl take it off\nTake it for a real one, you gon' get it all\n\nIs you really 'bout your money or nah?\nCan you really take dick or nah?\nCan I bring another bitch or nah?\nIs you with the shits or nah?\nOh nahhh, oh nahhh\nWould you ride for your nigga or nah?\nWould you die for your nigga or nah?\nWould you lie to your nigga or nah?\nOh nahhh\nCan you really take dick or nah?\nCan I bring another bitch or nah?\nIs you with the shits or nah?\nOh nahhh, oh nahhh\nWould you ride for your nigga or nah?\nWould you die for your nigga or nah?\nWould you lie to your nigga or nah?\nOh nahhh\n\nGon and make that ass clap\nGon and make that ass clap\nMa-ma-make that ass clap\nGon and make that ass clap",
 "image": "https://images.rapgenius.com/8c91c467cd60735be58f3b0d4adec99e.500x500x1.jpg"
}