{
 "title": "Paranoid",
 "album": "Beach House 2",
 "year": "2013-06-03",
 "lyrics": "Ohh, ohh\nDolla $ign\nJM, hah!\nMustard on the beat, ho\n\nI see two of my bitches in the club (What?)\nAnd I know they know about each other (You a fool, nigga, hah!)\nI think these bitches tryna set me up (Get out this motherfucker)\nMaybe I’m just paranoid (Paranoid, yeah, uh)\n\nI got a bad light skin from the Valley\nShe be in the club with no panties (Hah!)\nLittle bitch, she used to be my favorite (Yeah)\nBut now we don’t speak the same language\nI love my bitch, I could bang it\nBut my dark skin bitch know how to take dick\nI got 'em both the same damn red bottoms\nAnd bought 'em both the same damn fragrance\nBoth of my bitches drive Range Rovers\nNone of my bitches can stay over\nBoth of my bitches look good as fuck (Yeah)\nYour bitch look like a boogawolf (For real, nigga)\n\nI see two of my bitches in the club\nAnd I know they know about each other (There they go, yeah)\nI think these bitches tryna set me up\nMaybe I’m just paranoid (Paranoid)\n\nYeah, I’m paranoid, I’m trippin'\nI’ve been smoking, I’ve been sippin' (Hah!)\nI’m fuckin' around with two bitches (Yeah, JM, hah!)\nBut I never made them hoes my missus\n\nI got a Spanish bitch, her name Mija (Hah!)\nSee all my bitches is bad, I’m not T.I. (What?)\nAin’t no Tinys around me, uh-uh, bitch (Nah!)\nThe only thing I got is a long dick (Hah)\nTwo of my women conceited, like Mike, I beat it (Yeah)\nNo Bud, I Beat it, I get ‘em higher than Jesus\nAnd when I pull out that penis, she like \"woah!\"\nShe got a truckful of ass, I gotta tow\nSee, all my niggas is ballin', we got dough\nI got a car full of bitches, see, I’m a pro\nSee, it be two for me, I'ma pass the rest\nSoon as they pass the test, I put dick on they breast (Yeah)\nI came on their chest, ain’t no cuffin', we fuckin'\nIf the muffin be bluffin I get to actin’ like Ruffin\nI’m like, \"Nights like this, I wish that my bitch would call, huh\nHaha\n\nI see two of my bitches in the club (In the club)\nAnd I know they know about each other\nHaha, they both know about each other, ooh, yeah we on\nI think these bitches tryna set me up (We gettin' money)\nMaybe I’m just paranoid (Paranoid)\nI feel you, but we on, nigga\n\nYeah, I’m paranoid, I’m trippin'\nI’ve been smoking, I’ve been sippin' (Hah)\nI’m fuckin' around with two bitches (Yeah)\nBut I never made them hoes my missus\nYeah, I’m paranoid, I’m trippin'\nI’ve been smoking, I’ve been sippin'\nI’m fuckin' around with two bitches\nBut I never made them hoes my missus, no\n\nI see two of my bitches in the club (In the club)\nAnd I know they know about each other (Ooh, yeah, we on!)\nI think these bitches tryna set me up\nMaybe I’m just paranoid (Paranoid)\n\nJM, hah!\nDolla $ign (Dolla $ign)",
 "image": "https://images.genius.com/592738e50aef650146173276ab176c24.440x440x1.jpg"
}