{
 "title": "Touchin, Lovin",
 "album": "Trigga (Deluxe)",
 "year": "2014-09-09",
 "lyrics": "[Intro: Nicki Minaj & \nTrey Songz\n]\nOoh, woo, yeah\nAyy\nYoung Money\nUh-huh\nTrigga Trey\nOh, oh\nUh, let's get it, brrrrrrr\n\nNo, I ain't tryna flex (Tryna flex)\nNo ceilings, you can see who's in it, oh\nIf we're talkin' about sex (Girl, you gon' think)\nGirl, you know that I invented that\n (Invented that)\nAnd I'm onto the next (Next)\nThat's unless you bring a friend who with it\nOh, I'm sorry, oh, you mad that I came to the party?\n\nLike, no, no, no (Uh-huh)\nYou took your girl to the club and now she gone (Uh-huh)\nNow she asking me when I'm takin' her home (Uh-huh)\nI tell her, \"Let's go\" (Leggo)\nLong as you know 'cause I know when we get alone\n\nI'm touchin' you tonight (Nah)\nI'm lovin' you tonight\n(Wait, no) I'm fuckin' you, girl\nYou must be used to spendin', puttin' in that time\n (Uh-huh)\nTouchin', lovin', fuckin', can't make up my mind (My mind, oh, oh)\nI'm lovin' you (Oh, oh)\n(Wait, no) I'm fuckin' you tonight\n\nGirl, you fuckin with the best (Best)\nTake a picture while I'm deep up in it, oh\nAnd if they livin' right next (Nex, next)\nThen I bet they know my name in a minute (Trigga)\nLet me feel your body sweat (Sweat)\nI promise I'll keep your body dripping\nOh, I'm sorry\nNiggas mad 'cause I came to the party\n\nLike, no, no, no (Uh-huh)\nYou took your girl to the club\nAnd now she gone (Uh-huh)\nNow she asking me\nWhen I'm takin' her home, home, home (Uh-huh)\nI tell her, \"Let's go\" (Leggo)\nLong as you know 'cause I know when we get alone\n\nI'm touchin' you tonight, I'm lovin' you tonight (Uh)\n(Wait, no) I'm fuckin' you, girl\nYou must be used to spendin', putting in that time\n (Uh-huh)\nTouchin', lovin', fuckin', can't make up my mind (My mind, oh, oh)\nI'm lovin' you (Oh, oh)\n(Wait, no) I'm fuckin' you tonight\n\nYo, sometimes I tell 'em I love 'em because I just wanna fuck 'em\nI never love 'em or cuff 'em, and when we done I'ma duck 'em\nHe Ferragamo the buckle, he Louis V on the duffel\nThe pussy wetter than puddles, I ride his dick like a shuttle\nI said, real niggas let real bitches come first (Come first)\nAnd real bitches been bad bitches from birth (From birth)\nUh, kiss him when he cumming (Oh)\nMake more money last year than Mister Drummond\n(Kyuhh) Oh, he like it when I ride it slow\n\nI'm touchin' you tonight, I'm lovin' you tonight (Uh, yeah, uh)\n(Wait, no) I'm fuckin' you, girl\nYou must be used to spendin', putting in that time\n (Uh-huh)\nTouchin', lovin', fuckin', can't make up my mind (My mind, oh, oh)\nNicky, you know that I love you\nI'm lovin' you (Oh, oh)\nAnd I really wanna touch it\n(Wait, no) I'm fuckin' you tonight\n\nWhat you mean, \"Wait, no?\" Like what?\nYou better act like you know, nigga, it's Nicki Minaj\n(Uh-huh)",
 "image": "https://images.genius.com/8a9eca535458edadaa5a0fda422a01a4.600x600x1.jpg"
}