{
 "title": "Wiggle",
 "album": "Talk Dirty",
 "year": "2014-06-06",
 "lyrics": "Ayo, Jason\n(Oh yeah!)\nSay somethin' to her, holla at her\nHaha, I got one question\nHaha, how do you fit, all that, in them jeans? Hahaha\nYou know what to do with that big fat butt\n\nWiggle, wiggle, wiggle\nWiggle, wiggle, wiggle\nWiggle, wiggle, wiggle\nJust a little bit (Swing!)\n\nPatty cake, patty cake, with no hands\nGot me in this club, making wedding plans\nIf I take pictures while you do your dance (do your dance)\nI could make you famous on Instagram\n\nHot damn it (Woo!), your booty like two planets (Woo!)\nGo ahead and go ham sandwich (Woo!)\nWoah, I can't stand it\n'Cause you know what to do with that big fat butt\n\nWiggle, wiggle, wiggle\nWiggle, wiggle, wiggle\nWiggle, wiggle, wiggle\nJust a little bit (Swing!)\n\nCadillac Cadillac, pop that trunk\nLet's take a shot, alley oop that donk\nTired of working that nine to five\nWell, baby, let me come and change your life\n\nHot damn it (Woo!), your booty like two planets (Woo!)\nGo ahead and go ham sandwich (Woo!)\nWoah, I can't stand it\n'Cause you know what to do with that big fat butt (Oh yeah)\n\nWiggle, wiggle, wiggle\nWiggle, wiggle, wiggle (Wiggle wiggle wiggle)\nWiggle, wiggle, wiggle (Shake it, shake it, girl)\nJust a little bit (Little bit, little bit, little bit) (Swing!)\n\nShake what your mamma gave you, misbehave you\nI just wanna strip you, dip you, flip you, bubble bathe you\nWhat they do, taste my raindrops, k boo?\nNow what you're willing, what you wanting, what you may do\nCompletely separated 'til I deeply penetrate it\nThen I take it out and wipe it off, eat it, ate it, love it, hate it\nOverstated, underrated, everywhere I been\nCan you wiggle wiggle for the D-O-double G again?\n\nCome on, baby, turn around (turn around, turn around, turn around, yeah)\nYou're a star, girl, take a bow (take a bow, take a bow, take a bow, haha, yeah)\nIt's just one thing that's killing me\nHow do you fit that in them jeans?\nYou know what to do with that big fat butt\n\nWiggle, wiggle, wiggle (Wiggle, wiggle, wiggle)\nWiggle, wiggle, wiggle (Wiggle, wiggle, wiggle)\nWiggle, wiggle, wiggle (Shake it, shake it, girl)\nJust a little bit (Little bit, wiggle, wiggle, wiggle) (Oh, woah!)\n\nNow make it clap (Wiggle, wiggle wiggle)\nNow make it clap (Wiggle, wiggle, wiggle)\nNow make it clap\nLove it when you do it like that\nWith no hands, baby, make it clap\nBaby, make it clap, clap, clap (Like, swing!)\nDamn, baby, you got a bright future behind you",
 "image": "https://images.genius.com/9d66089a685d630e40cd1671a941dbfc.1000x1000x1.jpg"
}