{
 "title": "All the Above",
 "album": "If Tomorrow Comes",
 "year": "2009-02-17",
 "lyrics": "Tell me what do you see, when you're looking at me\nOn a mission to be, what I'm destined to be\nI've done been through the pain and the sorrow\nThe struggle it's nothing but love\nI'm a soldier a rider a ghetto survivor and all the above\nAll the above (x7)\n\nListen! Really what do you see, when you looking at me?\nSee me come up from nothing, see me living my dreams\nI've done been through the bottom, I've done suffered a lot\nI deserve to be rich, heading straight to the top\nLook how I ride for the block, look how I rep for the hood\nI got nothing but love, now that I come through the hood\nGetting this fortune and fame, money make all of us change\nThe new Benz is all white, call it John McCain\nHow the hell could you stop me? Why in the world would you try?\nI go hard forever, that's just how I'm designed\nThat's just how I was built, see the look in my eyes\nYou take all of this from me, and I'm still gon' survive\nYou get truth from me, but these rappers gon' lie\nI'm a part of these streets, till the day that I die\nI wave hi to the haters, mad that I finally done made it\nTake a look, and you can tell that I'm destined for greatness\n\n\nIt's easy to hate, it's harder to love me\nY'all don't understand, y'all quickly to judge me\nPut your foot in my Nike's, picture you living my life\nPicture you stuck in the cell, picture you wasting your life\nPicture you facing a charge, picture you beating the odds\nPicture you willing to bleed, picture you wearing the scar\nThank you for making me struggle, thank you for making me grind\nI perfected my hustle, tell me the world ain't mine\nYou've been seeing me lately, I'm a miracle baby\nI refuse to lose, this what the ghetto done made me\nI put that on my father, trying to hope for tomorrow\nWhen I think that I can't, I envision Obama\nI envision in diamonds, I envision Ferrari's\nIf the world was perfect, all my niggas behind me\nAin't you happy I made it? Man I'm making a statement\nTake a look, and you can tell that I'm destined for greatness\n\n\nNow if I'm out on the spot\nOr if I'm out on the block\nI hustle hard cause it's all the same (They know, they know)\nIf you know that grind don't stop\nBecause I rose to the top\nAnd everybody knows my name (Maino, Maino)\nHey! I'm still grinding, still hustling\nNo more pain, no more suffering\nMy ladies and my shorties and my thugs\nKeep on dancing and shining for love",
 "image": "https://images.genius.com/ca3460c5a83c8975c4cffa0ffa364442.1000x1000x1.jpg"
}