{
 "title": "Always Strapped",
 "album": null,
 "year": "2009-03-17",
 "lyrics": "*Aww!*\n*Aww! Aww!*\nCMB! We in the building\nYeah\nSwagged out, 100\n\nAlways strapped when I hit the club\nNiggas give me dap, bitches give me hugs, and since I'm paid\nNiggas be muggin' me, you know I'm muggin' back\nNiggas be muggin' me, you know I'm muggin' back\n\nYessir!\nCheck me out, look\n\n26 inches, bitch, I'm sitting crooked\nOld school Chevy faster than a silver bullet\nStrawberry paint; seats, vanilla puddin'\nTwo bitches, go'n'n' and eat each other's pussy\nTop chopped, sent the car to the barbershop\nMy driveway look something like a parkin' lot, haha\nI'm so unorthodox\nI got your bitch riding my dick wit no shocks\n\nHaha!\n(Bounce, bitch! Bounce-bouncе!)\nHa!\n\nI'm the hottest shit jumping out the coffee pot\nMan, I'm just tryna gеt my spot like a polka dot\nLil' kush make my eyes and my shoulders drop\nLil' syrup, and I can make a soda pop\nKeep talking, and I can make my soldiers pop\nReal niggas with me, riding 'til the motor stop\nI got these hoes straight living out a soap-op\nI got it covered like a coke top, okay?\n\nAlways strapped when I hit the club\nNiggas give me dap, bitches give me hugs, and since I'm paid\nNiggas be muggin' me, you know I'm muggin' back\nNiggas be muggin' me, you know I'm—\nAlways strapped when I hit the club\nNiggas give me daps, bitches give me hugs, and since I'm paid\nBitches be lovin' me, they know I love 'em back\nBitches be lovin' me, they know I love 'em back\n\nYeah, shawty, the last M-O-B\nFly in the Bugatti with the tool on the seat (Yeah)\nPut the K in the car while we riding blades (Chop, chop)\nPut the chopper on the pussy in the driveway (Brrat, rrrat!)\nBet the house on the young'un' when we got paid (Junior!)\nTriple-colors on the bikes and the new Merced' (And the new Merced')\nBustin' keys on they ass while we got paid (How we got paid)\nFrom I-10's ridin' hot to an open bay (To a open bay)\nUptown made man out the hallway (Yeah, yeah)\nCrab in the bucket, 50 shots, bitch, make a way (Bitch, make a way)\n\nI thought they knew, shawty!\nLike Father, Like Son...\n\nBall till you fall, stunting wit them paper plates (With them paper plates)\nThrowin' hundreds on them hoes while we eat steaks (While we eat steaks)\nWe in the club popping bottles, like, every day (Like, every day)\nWe grind for the shine, nigga, getting big money (Yeah)\nGot a fleet tossing chicken, nigga, get cake (Nigga, get cake)\nI'm on the island with this power like Scarface (Like Scarface)\nI'm in the Impala, drop-top, chunky (Chunky)\nIceman, Birdman, rocking red monkeys (Yeah)\n\nAlready, nigga, neighborhood superstar (Bred rich, boy)\nAnd we gon' ball til we fall, bitch\n\nAlways strapped when I hit the club\nNiggas give me dap, bitches give me hugs, and since I'm paid\nNiggas be muggin' me, you know I'm muggin' back\nNiggas be muggin' me, you know I'm—\nAlways strapped when I hit the club\nNiggas give me daps, bitches give me hugs, and since I'm paid\nBitches be lovin' me, they know I love 'em back\nBitches be lovin' me, they know I love 'em back",
 "image": "https://images.genius.com/ac01f34b6b053df6250f06a86262eaa6.719x719x1.jpg"
}