{
 "title": "Break Up",
 "album": "D.N.A.",
 "year": "2009-04-28",
 "lyrics": "I love you, but I don't think I can love you anymore...\n\nWhen I kiss you so good (Mario), why would you wanna break up?\n(Gucci) When this loving is so good, why would you wanna break up?\n(Sean Garrett, the Pen)\nIf I hit that so good, why would you wanna break up? (Gucci)\nIf the feeling is so good, why would you wanna break up?\n(We goin' in)\n\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\n\nNow baby girl had dumped me, she no longer wants me\nI'm no longer hired, she said that I been fired\nOn to the next one - more fish in the sea\nGirls are like buses: miss one next 15 one comin'\nGucci Mane crazy and his ice game stuntin' (Burr)\nSwag so stupid but the bitch straight dumped me\nOver, no more smoking doja\nBaby girl went A.W.O.L, she used to be my soldier\n\n(Don't) Don't I lace you with the Gucci?\n(Don't) Don't I deck you in the Louie?\n(Don't) Don't I make your earlobe freeze?\n(Don't) Don't when I dive I dive deep?\nI know I be (gone) I know I be (gone)\nI know I be (flirting with them girls)\nI know I be, say I be right back but take too long\nI know I be, saying I be faithful but I don't\nI know I be making you them promises then breaking your heart again\nTelling you she wasn't who she was then we arguing\nBut ba-by.. I love, you - OHH!\n\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\n\nYou might be from the hood, but to me you're a model\nEverything I ever ever seen in a model\nIf you leaving baby don't leave me until tomorrow\nTonight we gonna get a little tipsy with a bottle\nYou gonna get me up, I'm gone take 'em down\nI'm gone change my ways, we gon' work it out\nGirl, I wouldn't be the same if you were with somebody else\nGirl, it wouldn't be the same if I were with somebody else\nI know, I made, mistakes, before\nPromise, you won't, get hurt, no more\nI got, what you, like and, you know\nOnce you lay down, it's on\n\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\n\nWhy you wanna leave me, you should wanna tease me\nBeing icy ain't easy, I make it look easy\nUsed to cop you Bally, now you rock Louie\nNow it's fuck shawty, I don't like Gucci\n 2X\nLovin' you, lovin' you, lovin' you - when I'm, when I'm\nLovin' you, lovin' you; why would you wanna break up?\nDo anything for you (why would you wanna break up?)\nSee I be driving through your hood (why would you wanna break up?)\n\nNow would you, break up, break up, break up? Yeah\nI'm back, baby...",
 "image": "https://images.genius.com/fcad347279bb7f699eefc7d39c8a7780.600x600x1.jpg"
}