{
 "title": "Dancin On Me",
 "album": "Whoop Top",
 "year": null,
 "lyrics": "Pull up to the club, she dancin on me\nI don't really know what she doin to me\nBut I really know how she really want me\nI'm like girl you're dancin on me (DJ WEBSTAR!!!)\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nI don't know about you but she dancin on me\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\n\nI wanna see you cop that bottle, pop that bottle\nShake that bottle, then pour it on a model\nYou follow\nThen do your little dance like a genie in a bottle!\nShorty ain't let me leave when I move she move\nShe ain't lettin me breath!!!\nShorty ain't let me leave when I move she move\nShe ain't lettin me breath!!!\n (Jim Jones)\nPull up to the club, she dancin on me\nI don't really know what she doin to me (Stop touchin..)\nBut I really know how she really want me\nI'm like girl you're dancin on me (Take dat)\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nDancin on me she dancin on me\nI don't know about you but she dancin on me\n(I don't know about you but she dancin wit a G)\nGO GIRL! (Go girl!) GO GIRL! (Go girl!)\nGO GIRL! (YO' girl!) GO GIRL! (YO' girl!)\nGO GIRL! (Is MY girl!) GO GIRL!\nGO GIRL! GO GIRL!\n\n(JONES!)\nIf bein fine was a crime, you'd be servin a dime (10!)\nHer brains was insane, she said I'm all on her mind (Damn!)\nWatchin her every move and stalkin her body parts\nThe way I might attack her, she might need her a bodyguard\n(Er-RAUGH!!) Heh, the Jones had her like gosh\nChampagne to us is nothin but mouthwash (Got 'em)\nYou get it from ya mama, shake what she gave ya (And..)\nDrop it like it's hot, I couldn't take this behavior (Take dat!)\nPull up to the club and that Lambo is lookin sweet (SWEET!)\nDon't know 'bout you, but her hands was on me (Stop touchin..)\nThen she start to feel like the hammer was on me\nBut she want to lick the rapper like the candy was on me (BLOAW!)\nJONES!\n\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nDancin on me she dancin on me\nI don't know about you but she dancin on me\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\n\nGrind on me (Go!), whine on me (Go!)\nNow turn around and put yo' behind on me (Go!)\nNow grind on me (Aye), now grind on me (Aye)\nNow lemme take you home, you can ride on me (Aye)\nSee ladies love me, girls they adore me\nThe haters hate me, but they can't avoid me\nShe wanna get kinky, she's all on me\nI wanna get freaky, me so horny (AYYYE!)\nSo I whispered in her ear like, \"What is we gon' do?\" (Huh?)\nShe looked at her friend, I'm like, \"She could come, too\" (Let's go)\nAll three of us should get one room\nAnd do the things we like to do, ay! (BLOAW!)\n\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nDancin on me she dancin on me\nI don't know about you but she dancin on me\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\n\nShake your little diggy dong dong dong!!!\nShake your little diggy dong dong dong!!!\nDi dong dong dong diggy dong dong dong\nDi dong dong dong!!!\nShow me what your mama gave ya!\nShow me what your mama gave ya!\nHa fa la la dong dong dong\nDi dong dong dong AAAAAAAAHHHHHHHHHH!!!!\n\nPull up to the club she dancin on me\nI don't really know what she doin to me\nBut I really know how she really want me\nI'm like girl you're dancin on me\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nDancin on me, she dancin on me\nI don't know about you but she dancin on me\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!\nGO GIRL! GO GIRL!",
 "image": "https://images.genius.com/0ab266859e0e4ef98f1ac76db4cedc81.390x390x1.jpg"
}