{
 "title": "Diva",
 "album": "I Am... Sasha Fierce",
 "year": "2009-01-20",
 "lyrics": "I'm a-a diva (hey), I'm a, I'm a-a diva (hey)\nI'm a, I'm a-a diva (hey), I'm a, I'm a-a diva\nI'm a, I'm a-a diva (hey), I'm a, I'm a a diva\nI'm a, I'm a a diva (hey), I'm a, I'm a a di...\n\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\n\nStop the track, lemme state facts\nI told you, gimme a minute and I'll be right back\nFifty million 'round the world and they say that I couldn't get it\nI done got so sick and filthy with Benjis, I can't spend it\nHow you gon' be talkin' shit? You act like I just got up in it\nBeen the number one diva in this game for a minute\nI know you read the paper - the one that they call the Queen\nEvery radio 'round the world know me 'cause that's where I be (first!)\n\nI'm a-a diva (hey), I'm a, I'm a-a diva (hey)\nI'm a, I'm a-a diva (hey), I'm a, I'm a-a diva\nI'm a, I'm a-a diva (hey), I'm a, I'm a a diva\nI'm a, I'm a a diva (hey), I'm a, I'm a a di...\n\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\n\nWhen he pull up, wanna pop my hood up\nBet he better have a six-pack in the cooler\nGettin' money, diva's gettin' money\nIf you ain't gettin' money, then you ain't got nothin' fo' me\nTell me somethin', (Tell me somethin')\nWhere yo boss at (Where yo' boss at?)\nWhere my ladies up in here that like to talk back? (That like to talk back)\nI wanna see her (I wanna see her)\nI'd like to meet ya (I'd like to meet her)\nWhat you say? (Not to me)\nShe ain't no diva (She ain't no diva)...\n\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\n\nSince 15 in my stilettos, been struttin' in this game\n\"What's yo age?\" was the question they ask when I hit the stage\nI'm a diva, best believe her, you see how she gettin' paid?\nShe ain't callin' him to greet her, don't need him, her bed's made\nThis is a stick-up, stick-up (I need them bags, all that money)\nWe're gonna stick-up, stick-up (You see them ask, \"Where that money?\")\nAll my ladies get it up, I see you, I do the same;\nTake it to another level, no passengers on my plane\n\nI'm a, I'm a-a diva (hey), I'm a, I'm a a diva\nI'm a, I'm a a diva (hey), I'm a, I'm a a di...\n\nThis is a stick-up, stick-up (I need them bags, all that money)\nStick-up, stick-up (You see the mask, \"Where that money?\")\n\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla\nNa-na-na, diva is a female version of a hustla, of a hustla, of a, of a hustla...\n\nI'm a, I'm a-a diva, I'm a, I'm a-a diva, I'm a, I'm a-a diva.....\n(Hey)",
 "image": "https://images.rapgenius.com/2112fc7f7bc42bc31ae82e00221c1bb2.300x300x1.jpg"
}