{
 "title": "I Run",
 "album": "Boss of All Bosses",
 "year": "2008-12-02",
 "lyrics": "Geyeah\nSlim Thugga\nBoss Hogg Outlawz,\n \nJim Jonsin,\n ha\nRepresentin this Texas mayne\nBack\n\nI run, the streets all night and day (the hood love Thug)\nCause I still run, the streets all night and day\n(If you tryin to find me)\n(I rep for my city, go hard for the hood)\n(Still posted on the block, what's good?)\nAnd I run, the streets all night and day (ha)\nI can't stay away\n\nThey don't make too many niggas like me\nBonifide hustler, certified G\nStill got that work if you got the right fee\nYou thankin shit fake? Well nigga come see\nIt's bigger than the jewels, it's bigger than the cars\nIt's bigger than the fact that we fuckin rap stars\nThe street niggas know me, these boys got my contacts\nKnowin any given minute I can come back\nI put a bitch on I-10 and tell her run dat\nGive her ten and tell her don't brang nuttin back\nI'm still in the hood, I can't leave the streets\nIt's in my blood, I'm a thug 'til I be deceased\n\n\nIt's hot on my block, somebody turn the fan on\nI've been paid, I'm just tryin to turn my mans on\nAnd get my bread strong, streets miss me when I'm gone\nI \"Put On\" for my city like Jeezy's song\nPlease believe me homes; matter fact check my stats\nI ain't drop in three years, but I'm back\nWhere the money at? That's the first question\nYou better pack a strap; that's the first lesson\nHard times got the whole United States stressin\nI'm writin a book - \"How to Survive in a Recession\"\nMr. Obama, we so tired of sellin crack\nIf you lookin for me ask the streets where I'm at\n\n\nIt's home sweet home where the D-boys roam\nMovin stone for stone, or zone for zone\nAll night gettin it on 'til 6 in the morn'\nThe shit I'm smokin on, stronger then cologne\nYou can probably smell the smoke through your headphones\nIf you still broke better get your bread long\nCall me on that burner cause them feds on my phone\nAnd I'mma run the streets 'til I'm under my headstone",
 "image": "https://images.genius.com/ed55eaaa73ecb8a731d37ae6edf12851.953x953x1.jpg"
}