{
 "title": "Just Like Me",
 "album": "Intuition",
 "year": "2008-08-19",
 "lyrics": "Say Foxx? (Yeah-eah-eah...)\nI had, I had a chick man (Yeah-eah-eah...)\nShe went and did me real wrong, I mean (Yeah-eah-eah...)\nI did the same thing to her but\nShe ain't have no right to do me like that though dawg, for real\n(Yeah-eah-eah...)\n\nYou, been seeing him, and I know\nAnd I was with her, and you knew about it\nBut I was too bli-i-ind to see it baby\nAnd you was out here doing the same thing as me\nI wanna ask, has he been by the crib?\nHas he been in our, car? And did you let him, drive?\nCause she's been by the house, she's been in the car\nI've even let her push the Porsche around a couple times\n\nOh, we were so the same\nI don't know why I can't see it baby\nAnd it ain't a point to feeling blue\nYou're just like me and I'm just like you\n\nYou're just like me, shorty all up in the club\nPopping bottles of that Bub, giving all them dudes hugs\nAnd you just like me, she don't know how to act\nOn the floor backin it back, man I can't be mad\nShe just like me-e-ee-e-e\nShe just like me-e-ee-e-e\nShe just like me-e-ee-e-e\nShe just like me...\n\nNow it's so easy for me to imagine what you been doing baby\nSo I don't even have to ask (No)\nCause you ain't the only one that's been keeping secrets baby\nSo it ain't no sense in me playing back\nAnd I, can't say nothing cause I did you wrong\nAnd I was on some bullshit when I let that bitch up in our home\nShe's also known just like me\nAnd she played the game like one of my homies\n\n\nYou're just like me, shorty all up in the club\nPopping bottles of that Bub, giving all them dudes hugs\nAnd you just like me, she don't know how to act\nOn the floor backin it back, man I can't be mad\nShe just like me-e-ee-e-e (Getting money, having fun, man she)\nJust like me-e-ee-e-e (In the club, throwing ones, man she)\nJust like me-e-ee-e-e (24's on the Range)\nJust like me... (Go on shawty do your thang)\n\nHey!\nShawty who you fooling? You, know I'm way too cool for you\nTo run that game when we play me, trying to do me like I be doing you\nSay you heard I was screwing her just like I hear he doing you\nWhy you worried about me doing me? I see you doing you\nI can make her better though, you gonna let him ruin you\nJust for the record know I wouldn't have her unless I could have the two of you\nI know why he pursuing you, that booty do be moving boo\nLate night, straight pipe, that ain't nothing new to you\nWait a minute, can't tell me shit, wanna tell me something, tell me this\nIf I would've never would've hit that chick, would you even ever know that dude existed?\nNaw, got me twisted, yo ass goodbye I've kissed it\nNow you all on his dick, shawty look at this bitch",
 "image": "https://images.genius.com/c4994f5b772486b941eb46287bbf7999.600x600x1.jpg"
}