{
 "title": "My President",
 "album": "The Recession",
 "year": "2008-09-02",
 "lyrics": "Yeah, be the realest shit I never wrote\nI ain't write this by the way, nigga\nSome real shit right here, nigga\nThis'll be the realest shit you ever quote\nLet's go!\n\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy mama ain't at home and Daddy's still in jail\nTryna make a plate, anybody seen the scale?\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy money's light green and my Jordans light grey\nAnd they love to see white, now how much you tryna pay?\nLet's go!\n\nToday was a good day, hope I have me a great night\nI don't know what you fishin' for, but catch you a great white\nMe, I see great white, heavy as killer whales\nI cannot believe this, who knew it came in bales?\nWho knew what came with jail?\nWho knew what came with prison?\nJust 'cause you got opinions, does that make you a politician?\nBush robbed all of us, would that make him a criminal?\nAnd then he cheated in Florida, would that make him a Seminole?\nI say, and I quote, \"We need a miracle.\"\nAnd I say a miracle 'cause this shit is hysterical\nBy my nephews and nieces, \nI will email Jesus\nTell him forward to Moses and CC Allah\nMr. Soul Survivor, guess that make me a Konvict\nBe all you can be, now don't that sound like some dumb shit\nWhen you die over crude oil as black as my nigga Bu\nIt's really a Desert Storm, that's word to my nigga Clue\nCatch me in Las Vegas, A.R., Arizona\nRep for them real niggas, I'm winnin' in California\nWinnin' in Tennessee, hands down Atlanta\nLandslide Alabama, on my way to Savannah\n\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy mama ain't at home and Daddy's still in jail\nTryna make a plate, anybody seen the scale?\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy money's light green and my Jordans light grey\nAnd they love to see white, now how much you tryna pay?\nLet's go!\n\nI said I woke up this mornin', headache this big\nPay all these damn bills, feed all these damn kids\nBuy all these school shoes, buy all these school clothes\nFor some strange reason my son addicted to Polo's\nLove me some spinach dip, I'm addicted to Houston's\nAnd if the numbers is right I'll take a trip out to Houston\nAn earthquake out in China,\n \na hurricane in New Orleans\nStreet Dreams Tour, I showed my ass in New Orleans\nDid it for Soulja Slim, brought out B.G.\nIt's all love, Bun, I'm forgivin' you, Pimp C\nYou know how the Pimp be, that nigga gon' speak his mind\nIf he could speak down from Heaven he'd tell me stay on my grind\nTell him I'm doin' fine,\n \nObama for mankind\nWe ready for damn change so y'all let the man shine\nStuntin' on Martin Luther,\n \nfeelin' just like a king\nGuess this is what he meant when he said that he had a dream\n\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy mama ain't at home and Daddy's still in jail\nTryna make a plate, anybody seen the scale?\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy money's light green and my Jordans light grey\nAnd they love to see white, now how much you tryna pay?\nLet's go!\n\nYeah, our history, black history\nNo president ever did shit for me\nHad to hit the streets, had to flip some keys\nSo a nigga won't go broke\nThen they put us in jail, now a nigga can't go vote\nSo I spend dough on these hoes strippin'\nShe ain't a politician, honey's a pole-itician\nMy president is black, Rose golden charms\n22-inch rims like Hulk Hogan's arms\nWhen thousands of peoples is riled up to see you\nThat can arouse your ego\nWe've got mouths to feed so\nGotta stay true to who you are and where you came from\n'Cause at the top will be the same place you hang from\nNo matter how big you can ever be\nFor whatever fee or publicity, never lose your integrity\nFor years there's been some prize horses in this stable\nJust two albums in, I'm the realest nigga on this label\nMr. Black President, yo, Obama for real\nThey gotta put your face on the 5000 dollar bill\n\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy mama ain't at home and Daddy's still in jail\nTryna make a plate, anybody seen the scale?\nMy president is black, my Lambo's blue\nAnd I'll be goddamned if my rims ain't too\nMy money's light green and my Jordans light grey\nAnd they love to see white, now how much you tryna pay?\nLet's go!\n\nSo I’m sittin' right here now, man\nIt’s June 3rd, haha, 2:08 AM\nNigga, I wanna say win, lose or draw\nMan, we congratulate you already, homie\nSee, I motivate the thugs, right?\nYou motivate us, homie, that’s what it is\nThis a hands-off policy\nY'all touch him, we ridin', nigga\nYeah, first black president, win, lose or draw, nigga\nHaha, matter of fact, you know what it is, man?\nShouts out to Jackie Robinson, Booker T. Washington, homie\nOh, you ain’t think I knew that shit?\nSydney Poitier, what they do?\nI’m important too though\nI was the first nigga to ride through my hood in a Lamborghini",
 "image": "https://images.genius.com/1b0e8d5c8ba78942c07465f1565ca9c0.1000x1000x1.jpg"
}