{
 "title": "Who Dat",
 "album": "The Recession",
 "year": "2008-09-02",
 "lyrics": "(Yeah ya'll must done lost ya'll mind)\nShawty Redd on the track\n(Aye bruh)\n(they rappin' like you... makin' beats like me?)\nI hear 'em nigga\nShawty Redd on the track\nI trap all day trap all night\nMoney all day I count money all night\nI count money all night...\n\nWhy they keep sayin' (YEAH)?\nI don't even know...\nI got court tomorrow\nI don't need to go\nI don't need a show...\nI got shit to do\nOnly God can judge me...\nWho the fuck is you?\nThey say who dat? (who dat?)\nNigga we dat (we dat)\nToday is trey day so I guess I'm tryin' to three dat\nNever have I ever served a nigga where he sleep at...\nD's be at ya door nigga you ain't tryin to see that...\nSee my suicide watch stay on suicide watch....\nKill ya'self yeah them suicide rocks... (YEAH)\nHad the nerve to write me a dear Young letter...\nKillin' em Young you shoulda known better (haha)\nI paid too much\nYou niggas play too much\nLet the swag do the talking I don't say too much\nYou niggas sayin' too much\nMr. 175 you niggas payin' too much\n\nThey say who dat? (who dat?)\nNigga we dat (we dat)\nShawty Redd on the track...\nThey say who dat? (who dat?)\nNigga we dat (we dat)\nReportin' live from the trap\nThey say who dat? (who dat?)\nNigga we dat (who dat?)\nShawty redd on the track\nThey say who dat? (who dat?)\nNigga we dat (who dat?)\nYoung live from the trap!\n\nI don't chase no broads I chase money and vodka...\nNext time I re-up I'mma buy me a chopper...\nAnd I ain't talkin AK's I'm talkin shit wit propellers\nFly to the club make my old bitch jealous...\nThug motivation this is straight celebration\nI see Gizzle in his chopper outside Central Station\nThis ain't a mixtape but the tape's mixed\nBlack tape red tape all on one brick...\nGet it on the flo' get get it on the flo'\nLast night I swear to God half a mil on the flo'\nFell asleep on the money like a pillow on the flo'\nWoke up got money had to get it off the flo'\n\nDey say who dat? Nigga we dat\nShawty Redd on the track\nDey say who dat? Nigga we dat\nReportin' live from the trap\nDey say who dat? Nigga we dat\nShawty Redd on the track\nThey say who dat? Nigga we dat\nYoung live on da track\n\nWhat you know about twenty grand stuffed in a white sock?\nPull off in a white drop like I play for the White Sox\nPlay with them white blocks play with them white squares...\nYou call it what you want who the fuck cares?\nI don't never sleep (why?) too paranoid...\nState of paranoia, all I do is call my lawyer\nTell 'em I know them niggas that might have a lil' trouble\nOk you knows me if you beat it I pay you double\nYa'll niggas knows me if I want to I make it double\nJust know it's water whipped so you might have a lil trouble...\nMight move a little slower might get a few complaints\nSay he ran outta gas he might need a half a tank\nThank God it's Friday fresh off the highway...\nSeen too many's out he bout to pull in the driveway\nWhere? In the driveway - take the work out, cut the duct tape...\nCheck the work out - YOUNG\nI keep tryin' to tell y'all man\nY'all need to find y'all own style homie!\nWe do this, we been doin' it for years\nWho dat? We dat\nHa hah",
 "image": "https://images.genius.com/1b0e8d5c8ba78942c07465f1565ca9c0.1000x1000x1.jpg"
}