{
 "title": "All Glocks Down",
 "album": "Takin Mine",
 "year": null,
 "lyrics": "I can break it down like whatever you want\nI can break it down like whatever you want\n\nAll Glocks down, arriving is the bulletproof lyricist\nAll rude boy, big up, now hear this\nI'm classic like a Coca-Cola, why don't you roll a L\nAnd make it spiffy?\nAre the L's twisty? Oh yes, let's get lifty\nLong live the rugged female Heather B\nSo all you gun waving niggas put down your Glocks, please\nNo need for playing the hard anymore\nThe bulletproof lyricist is knocking at your door\nSo open up, let me in, let's get nasty if you wanna\nI'll freak dat butt like a film by Heather Hunter\nTouch you, cut you, I might just buss you\nBuss your shit MC turned pretty\nEast coast, kid, how I swing\nBounce to Brooklyn\nNo need to tell you what I partook in\nJust know Heather B. is back in town\nIt's no question, all Glocks down\n\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\n\nWalking with middle finger up, brown Timbs steppin' through\nComing soon to a corner spot near you\nIt's the sidewalkin' rap talkin'\nHip-hop sister, no need to try me, mister\nYou got rhymes, go for it, we need no chorus\nFreestyles comin' from the door\nAnd who's testin' the untestable? Style's flexible\nYou gonna have to bounce, twelve rounds\nTKO by the third, fuck what you heard\nI didn't feel like playing around\n'Cause you's part-time with a part rhyme\nCommitting no crimes and claiming to be hard on the block\nSo feel my funk, my beat, my vibe\nRecognize that I'm live, all live, you know the time\nKid, just raise up, rise up, open your eyes up\nAlready got you sized up, so wise up, bitch\nA L to the neck, a double deuce of Becks\nAnd now my mind's set, I'll be rowdy to the death\nDo us part, one love rock crew, right here in heart\nDon't even play me, son, you'll get did, done\nTurnin' all gats or guns\nI'll leave your shorty with her hair undone\nAnd then you know Heather B. is back in town\nSo no question, all Glocks down\n\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\n\nI got my peeps to my left side and then my right\nCan't wait until tonight when real niggas turn trife\nI love the orange light from the Dutch Master tip\nMy whole crew bent, a half a hunnid gone, spent\nChocolate Thai, true dat, yo, who him?\nWho dat snatchin' up da L like a sniper?\nSon, you will surely miss the next cipher\nIf you ever try to hog up the L again\nLast one to put in, first son to dig in\nNow I hear you riffin' me while I'm countin' your tokes\nThe Hen-loc burns my throat with no chaser\nI'm feelin vibes by my hip from the black pager\nBlowin' up for the nine-four or the nine-five\nFor da nine square, either way, say word-word\nHeather B. is in there to the most high\nAnd to the most def no quest', all Glocks down\n\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\n\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want\nGlocks down, hit 'em with that funky sound\nI can break it down like whatever you want",
 "image": "https://images.genius.com/916409d7eb67a4d46ae35db017135795.600x600x1.jpg"
}