{
 "title": "Baby",
 "album": "Brandy",
 "year": "1994-12-24",
 "lyrics": "Oh, yeah\n\nBaby, baby, baby, baby\nDon't 'cha know that you're so fine, hey yeah-yeah?\nBaby, baby, baby, baby (Baby, baby)\nThink about you all the time, hey yeah-yeah\n\nGuess it's time to say, baby, baby\nHow you make me feel when you come to mind\nI can't keep my cool, baby, baby\nI can't hold it inside\nI can't wait each day just to see you walk\nTrying to move in close to get to where you are\nNot trying to be rude, baby, baby\nNothin' ventured, nothin' gained, so I'm tellin' you\n\nBaby, baby, baby, baby (Oh-yeah)\nDon't 'cha know that you're so fine, hey yeah-yeah? (Whoa-oh)\nBaby, baby, baby, baby (Oh yeah, oh yeah-yeah)\nThink about you all the time, hey yeah-yeah\n\nWords just ain't enough, baby, baby\nBut that's all I can use to state my intentions\nHope it gets to love, baby, baby, yeah\nIt's a perfect situation\n'Cause we fit together like a hand in glove\nJust to be with you is all I'm thinkin' of, whoa-yeah\nWhat else can I say, baby, ooh, baby?\nWe are alone, and I'm singin' this song to you, baby\n\nBaby, baby, baby, baby (Ooh yeah)\nDon't 'cha know that you're so fine, hey yeah-yeah? (You're so fine, you're so fine, you're so fine, yeah)\nBaby, baby, baby, baby (Oh yeah)\nThink about you all the time, hey yeah-yeah (Whoa, whoa-yeah)\n\nBaby, baby, baby, baby (Baby, baby)\nDon't 'cha know that you're so fine, hey yeah-yeah? (Baby, you're so fine, you're so fine, so fine, so fine, yeah)\nBaby, baby, baby, baby\nThink about you all the time, hey yeah-yeah (Oh-no, baby)\n\nMy darling (My darling)\nOh, baby (Oh, my baby)\nYou're all I'm thinkin' of (You're all I'm thinkin' of, baby)\nMy darling (Whoa-oh)\nOh, baby (Baby, baby-yeah)\nYou're all I'm thinkin' of\n\nHey-yeah, yeah, yeah, yeah (Oh, baby)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Yeah)\nHey-yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Yeah, yeah)\nHey-yeah, yeah, yeah, yeah (Yeah, yeah)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Yeah, yeah)\nHey-yeah, yeah, yeah, yeah (Yeah, yeah)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Ooh yeah)\n\nBaby, baby, baby, baby (Baby, baby, baby, baby, my baby, yeah)\nDon't 'cha know that you're so fine, hey yeah-yeah? (You're so fine, you're so fine that you've blown my mind)\nBaby, baby, baby, baby (Yeah, yeah)\nThink about you all the time, hey yeah-yeah (Thinkin' about you all the time)\n\nBaby, baby, baby, baby (Whoa-oh)\nDon't 'cha know that you're so fine, hey yeah-yeah? (Oh, yeah-yeah)\nBaby, baby, baby, baby (Yeah, yeah)\nThink about you all the time, hey yeah-yeah (Baby, yeah)\n\nHey-yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nHey-yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nHey-yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nHey-yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nHey-yeah, yeah, yeah, yeah (My darling)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Oh, baby)\nHey-yeah, yeah, yeah, yeah (Whoa, baby)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (You're all I'm thinkin' of)\nHey-yeah, yeah, yeah, yeah (You're all I'm thinkin' of)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Ooh yeah-yeah)\nHey-yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah (Ooh yeah-yeah, yeah)\nHey-yeah, yeah, yeah, yeah\n\nBaby, baby, baby\nBaby",
 "image": "https://images.genius.com/90319ada8b87ded0f2d705055380adb0.700x700x1.png"
}