{
 "title": "Foe Life",
 "album": "Mack 10",
 "year": "1995-01-01",
 "lyrics": "Mack 10 you know you rule hip-hop and\nIce Cube you know you rule hip-hop and\nMack 10 you know you rule hip-hop and\nWait a minute, that ain't how the West Coast rock, nigga!\n\nMack 10, nutty as they come leave 'em face down\nAnd numb from the waist down\nIt's a Sunday a gun day\nRollin' down a one way\nIn my 'lac front and back\nOver train tracks\nOn yak and herb nigga swerve\nIt get's on my nerves, banked my Danas on the curb\nIn the gutta lane\nI'm butta man\nFoot to the flo'\nWhat you want from the sto'\nI'm broke as a muthafucka nigga buy my single\nComin' from Ingle (Foe Life) is my jingle\nSeen yo' bitch at the sto' coulda took her\nBut niggas start to handcuff they hoes like T.J. Hooker\nFool I'mma vet you can bet\nThat I can dance underwater and not get wet\nIt's the nappy headed nigga that can kill and rap\nEverybody run when I bust a cap\nPuttin' Inglewood up on the map\nLook at what I do when I pulls my strap\nBust 2 rounds nigga about to clown\nBitch hit the silent alarm it's goin' down\n\nFoe life, foe life\nMack 10 comin' through the hood with stripes\nFoe life, foe life\nMack 10 comin' through the hood with stripes\n\nKhaki suit ski mask is my attire\nWith my luck cut my chucks on the barbed wire\nFool where ya keep the rims and tires\n'fo yo' life expires, I'm as nutty as Michael Myers\nDidn't think about the Rottweiler\nA lot of stiches in the ass, blood in the Impala\nSittin' in the County with a gold record\nIce Cube send me pictures of bitches naked\nCaught with a contraband in my hand\nMack 10 take the stand, your Honor I'mma changed man\nSo please let me go so I can flow\nGot a show had to ask my P.O. can I go? and if he say no\nI'mma have to say bitch get out the car slow and leave ya fuckin' dough\nCause a nigga gotta eat fuck the world\nLet the bullets hurl and feed my baby girl\n\nFoe life, foe life\nMack 10 comin' through the hood with stripes\nFoe life, foe life\nMack 10 comin' through the hood with stripes\n\nCall 911 there's a son of a bitch on the roof\nYarned up in his birthday suit\n(Mack 10 to the rescue)\nMy momma wanna know why I do what I do\nCause I'm superman superbad supermad superfly\nFool you can die\nThere's gonna be a lot of cars with they lights on\nAnd I'm at home sewing stripes on\nCause I'm the General and you's a stowaway\n'bout to buck you down with this throw away\nWith no serial number it's the summer\nWhere niggas die, it's hotter than July\nYou better stay low fo' you get a halo\nPlus wings and a gown when I come around\nSo take 10 paces\nAnd try to guess the color of my shoelaces\n\nFoe life, foe life\nMack 10 comin' through the hood with stripes\nFoe life, foe life\nMack 10 comin' through the hood with stripes",
 "image": "https://images.genius.com/f01a8204b6a2b2c82cf6a6be87531f05.300x300x1.jpg"
}