{
 "title": "Get Down",
 "album": "Project: Funk Da World",
 "year": "1994-12-12",
 "lyrics": "And bass up the track a little bit\n'Cause I wanna hear that \"boompsh, boompsh\"\nYou know I'm sayin'?\nAhhh!\n\nNow who got the flav' that comes a dime a dozen that keeps ‘em buzzin’\nThinking that they fat when they wasn't\nWelcome to the world of Mack, or Mackman\nLeave you small guys sayin', I eat MC's like Pac-Man\nI'm incredible, better eats ya vegetables\n'Cause, I does what I do you (Do it!)\nI fake the roof off of soft suckers\nSuper smackin', mackin', full effect mike check one two\nI'ma reign, reign forever\nRain like bad weather, reign like whoever, never\nYou can't bite my style\n'Cause my style ain't a style that is a style so I can go buckwild\nBet you figured you got more funk for flow, it ain't so\nFlava in Ya Ear letcha know\nNow I'm about a second from the hook, dook\nScrap ya rap book, 'fore you get ya wet style shook\n\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\n\nThe Mack's like a superintendent\nBurning MC's leaves a foul scent\nSee, I'm like what ya call, king of yes ya'll\nMy style's rick, sick, I mean real sick\nShit's thick, I come with the ammo\nThe real whammo-slammo stuff that I be droppin'\nAnd I'll wake the great, let's warm up the hot plate\nI'm changing fate from the neck I'ma castrate\nMy rap loves to alienate\nShake ya ass to 'til it stank, you stomp, I dominate\nSee, I ain't scared of you mothafuckas\nTo me ya all suckers 'cause I make the ruckus\nDon't try to buck us, we roll bulletproof\nNo cooth, on the roof, \nbitin' like a sabertooth\nI pound on the ground when I get down\nSo let me get down, let me get down\n\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\n\nCan leap a tall building, crush the Earth for fun\nBut I'm sayin' ain't no fair, yo, when MC's run (Ain't no fair, ain't no fair)\nThe mic's now in the right hands\n'Cause the Mack’s on the Earth just to spoil your plans\nMore pep than the pepper that's in ya pepper shaker\nRuff earthquaker, couldn't take me if ya mama make ya\nI back up the funk that I bring with unknown to man slang\nWith bigger bite than the Devil fang\nI ain't met who could hang, if ya testin' in ya lesson\nGot me dressin' for ya funeral session\nMan, it won't even matter no more\nCraig in '94 just won the war\nMy style was definite to take ya over\nHave ya sittin' lookin' over in a four door Chevy Nova (Why I oughta)\nI figure its a slaughter\nIn the world of dollars, ya shit ain't nothing but a quarter\nThe name of the track is \"Get Down\"\nSo let me get down and pound other MC's in the ground\n\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\nCan I get down?\nGet on down, can I get down?\n\nGet down, boy (Down, down)\nCan I get down? (Hah)\nCan I get down? (Down, down)\nCan I get down?",
 "image": "https://images.genius.com/44600b8f0b48972b2c4a473eb25f56fa.600x601x1.jpg"
}