{
 "title": "How High",
 "album": "The Show (Original Soundtrack) ",
 "year": "1995-08-15",
 "lyrics": "Takin' it from the top?\nTop\nTippy?\nCome on, my people\nSing it, daddy\nHey, yeah\nTaking my mind where it's never gone before\nAnd so like a mushroom in cow shit\nAnd I'm taking it just to get the ultimate high, baby\nThe ultimate high\n\nExcuse me as I kiss the sky\nSing a song of sixpence, a pocket full of rye\nWho the fuck wanna die for their culture?\nStalk the dead body like a vulture, Ticalion, hmm\nBlacker than your blackest stallion\nHit your housing projects\nI represent yo' Shaolin, my nigga\nNow yes, Apocalypse now, the gun blaow\nIt be goin' down, diggy diggy down, diggy down, down\n\nWhile the planets and the stars and the moons collapse\nWhen I raise my trigger finger all y'all niggas hit the deck\n'Cause ain't no need for that, hustlers and hardcore\nRaw to the floor raw like Reservoir Dogs\nThe Green-Eyed Bandit can't stand it\nWith more fruitier loops than that Toucan Sam bitch\nPlus the Bombazee got me wide (Fucking with us)\nIs a straight suicide\n\nTen, nine, eight, seven, six, five, four\nThree, two, murder one lyric at your door\nTical bring it to that ass raw\nBreakin' all the rules like glass jaws\nNigga, you got to get mines to get yours\nFucker, we don't need no rap tour\nI'd rather kick the facts and catch you with the rap-ture\nMore than you bargained for\nTical, I stays open like an all night store\nFor real I keeps it ill like a piece of blue steel\nPointed at your temple with the intent to kill\nAnd end your existence, M-E-T\nAin't no use for resistance, H-O-D\n\nI be's the ultimate rush to any nigga on dust\nThe Egyptian Musk used to have me pull mad sluts\nI shift like a clutch with the Ruck\nExamine my nuts, I don't stop 'til I get enough\nYour shit broke down, light your flare\nSince the dark side tears you into Hollywood Squares\nSix million ways to die, so I chose\nMade it six million and one with your eyes closed\nThe blindfold cold so you can feel the wrath\nAnd shatter the glass and second half on your funky ass\nAyo, my man (Tical), hear me now (Huh)\nBitches used to play me now they can't forget me now\nThey get me mad, I rock the spot, check Glock\nEmpty off a licking off in hip-hop\nFuck the Billboard, I'm a bullet on my block\nHow you dope when you payed for your Billboard spot?\n\nLook up in the sky, it's a bird, it's a plane\nIt's the Funk Doctor Spot smoking buddha on a train\nHow high? So high that I can kiss the sky\nHow sick? So sick that you can suck my dick\nLook up in the sky, it's a bird, it's a plane\nRecognize Johnny Blaze, ain't a damn thing changed\nHow high? So high that I can kiss the sky\nHow sick? So sick that you can suck my dick\n\n'Til my man Raider Ruckus come home\nIt ain't really on 'til the Ruckus get home\nPuff a meth bone, now I'm off to the red zone\nWe don't need your dirt weed, we got our fuckin' own\nCheck it, I brings havoc with my hectic\nBring the Pain lyrics screaming for the antiseptic\nMoving on your left kid, and I'm Method\nOut my fucking dome piece, plus I got no love for the beast\nHailing from the big East Coast, where niggas pack toast\nHome of the drug kingpin and cut throats\n\nHey boy, you the rude boy on the block\nYou try to stop the bum rush, you will get popped\n\nAs I run a mile with a racist\nMy style was born in the pissy staircases\nDig it, F a rap critic\nHe talk about it while I live it\nIf Red got the blunt, I'm the second one to hit it\n\nLook up in the, I got the verbs, nouns and Glocks in ya\nEnter the center, lyrics bang like Rico-chet Rabbit\nI brings havoc with an A-K 'matic\nRollin' blunts an all day habit\nI get it on like Smith & Wes', who clique's the best?\nPunks take a sip and test, who splits your vest?\nThe funk phenomenon, I'm bombing you like Lebanon\nBlow canals of Panama just off stamina\nStyles not to be fucked with or played with\nFuck them pretty hoes, I love those Section 8 bit-ches\nHitting snitches, twisting wigs with\nFat radical mathematical type scriptures\nI dig up in your planets like Diga-boo\nScared you, blew you to smithereens\nFuck the Marines, I got machines\nThat like to spit and read MAD magazines\nI fly more heads than Continental\nWreck ya five times like U.S. Air off an instrumental\nLook, I'm not a halfway crook with bad looks\nBut I may murder your case like your name was Cal Brooks\nI breaks 'em off proper\nAsk Biggie Smalls who shot ya\nFunk Doctor with the 12-gauge Mossberg\nLook, I got the tools like Rickle\nTo make your mind tickle\nFor the nine nickel\n\nYo, Red, yo, Red (Punk ass pussy ass)\nYou ain't got the shade no more, man, that's it, man (Word up, man)\nWe out, it's over\nFake ass niggas",
 "image": "https://images.genius.com/cf5f2dddbd6558568aeee3ed43a32801.600x601x1.jpg"
}