{
 "title": "I Wish",
 "album": "I Wish",
 "year": "1995-06-27",
 "lyrics": "Hey, this is radio station WSKEE\nWe're taking calls on the wish line\nMaking your wacky wishes come true\nHello?\n\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\n\nI wish I was like six-foot-nine so I can get with Leoshi\n'Cause she don't know me but, yo, she's really fine\nYou know I see her all the time, everywhere I go\nAnd even in my dreams, I can scheme of ways to make her mine\n'Cause I know she's livin' phat\nHer boyfriend's tall and he plays ball, so how am I gonna compete with that?\n'Cause when it comes to playing basketball\nI'm always last to be picked and in some cases never picked at all\nSo I just lean up on the wall\nOr sit up in the bleachers with the rest of the girls who came to watch their man ball\nDag y'all! I never understood, black\nWhy the jocks get the fly girls, and me, I get the hood rats\nI tell 'em, \"Scat, skittle, scabobble\"\nGot hit with a bottle and put in a hospital for talkin' that mess\nI confess, it's a shame\nWhen you livin' in a city that's the size of a box and nobody knows yo' name\nGlad I came, to my senses\nLike quick-quick, got sick-sick to my stomach\nOvercometh by thoughts of me and her together, right?\nSo when I asked her out, she said I wasn't her type\n\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\n\nI wish I had a brand new car so far, I got this hatchback\nAnd everywhere I go, yo, I gets laughed at\nAnd when I'm in my car I'm laid back\nI got an 8-track, and a spare tire in the backseat, but that's flat\nAnd do you really wanna know what's really wack?\nSee, I can't even get a date, so what do you think of that?\nI heard that prom night is a bomb night\nWith a hood rat t'you can hold tight\nBut really though, I'm Figaro\nWhen in my car, I can't even get a hello\nWell, so many people wanna cruise Crenshaw on Sunday\nOne day I'mma have to get in my car and go\nYou know I take the 110 until the 105\nGet off at Crenshaw, tell my homies, \"Look alive\"\n'Cause it's hard to survive\nWhen you're living in a concrete jungle and these girls keep passing me by\nShe looks fly, she looks fly\nMake me say, \"my, my, my\"\n\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\n\nI wish I was a little bit taller\nI wish I was a baller\nI wish I was a little bit taller\nI wish I was a baller\nI wish I was a little bit taller, y'all\nI wish I was a baller\nI wish I was a little bit taller\nI wish I was a baller\n\nHey, I wish I had my way\n'Cause every day would be a Friday, and you could even speed on the highway\nI would play ghetto games\nName my kids ghetto names: Little Mookie, Big Al, Lorraine\nYo, you know that's on the real\nSo if you're down on your luck then you should know just how I feel\n'Cause if you don't want me around\nSee, I go simple, I go easy, I go Greyhound\nHey, you, what's that sound?\nEverybody look what's going down\nAh, yes, ain't that fresh?\nEverybody wants to get down like that\n\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\nI wish I was a little bit taller, I wish I was a baller\nI wish I had a girl who looked good, I would call her\nI wish I had a rabbit in a hat with a bat\nAnd a six four Impala\n\nI wish, I wish\nI wish, I wish\nI wish, I wish\nI wish, I wish\nI wish, I wish\nI wish, I wish",
 "image": "https://images.genius.com/22cda7394266c80d878b106be9ebfd1f.1000x1000x1.png"
}