{
 "title": "Love Ambition (Call on Me)",
 "album": "Love Ambition",
 "year": "1995-05-22",
 "lyrics": "Baby\nWhenever you get that love ambition\nCall on me\n\nDon't know why\nI'm so into you\nCould it be the first impression\nI made of you in June?\nSince then my mind\nHas been thinkin' of ways\nTo put you in submission, and make you my new prey\n\nI don't even know your name\nSo how can we get together?\n(Don't even know if you have a man)\n(Don't even care 'cause I know) One things for sure, baby\n(Chorus)\nYou will like the way I do ya baby (Yeahhh, huuh)\nTake my time to love from front to back\n(Whenever you get that)\nSo whenever you get that love ambition baby\n(Call on me sugar) Call on me and I'll come runnin' back\n(Come on)\nUp and down, baby\n\nDon't know why (Don't know why)\nI keep thinkin' of you (Keep thinkin' of you)\nCould it be your every motion, in my fantasies with you? (My fantasies with you)\nStill every time, I see you around (I see you around)\nI can't control my desire\nTo feel you up and down\n\nBut I don't even know your name\nSo how can we get together?\n(Don't even know if you have a man) Yeah\nDon't even know, but I know one thing's for sure\n(Chorus)\nYou will like the way I do ya, baby\n(Yet I'll take my time, my time, my time)\nTake my time to love from front to back\n(So whenever you get that love)\nSo whenever you get that love ambition, baby (Uh)\n(Hold me baby, and I'll) Just call on me and I'll come runnin' back\nI'll keep runnin' (Keep thinkin' of you)\nYou will like the way, aw yeah, aw yeah\nTake my time to love from front to back\nSo whenever you get that love (Keep thinkin' of you)\nSo whenever you get that love ambition, baby\nBaby, call on me\nJust call on me and I'll come runnin' back\nHo, ho (Ho, ho)\nUp and down, baby\n(Breakdown)\nLa, la, la\nLa, la, la, la, la, la\nLa, la, la, (Laaa, laaa)\nOh, oh, (Ho, oh)  oh, oh\n\nSaid I don't even know your name\nHow can we get together? (Keep thinkin' of you) Oh!\n(Don't even know if you have a man) Yeah, yeah, yeah!\n(Don't even care 'cause I know) Because I know one thing's for sure\n(Chorus)\nYou will like the way I do ya baby (You will like the way, sugar)\nTake my time to love from front to back (Ho, ohhhh, woahhh, woahh)\nSo whenever you get that love ambition, baby (Ha! Call on me!)\nJust call on me (Call on me!) and I'll come runnin' back\nI'll come runnin' back (Keep thinkin' of you)\nYou will like the way I do ya, baby\nI'll come runnin' back\nTake my time to run from front to back\nSo whenever you get that love (Keep thinkin' of you)\nSo whenever you get that love ambition, baby\nBaby call on me, yeah yeah\nJust call on me and I'll come runnin' back\nAll night long (Keep thinkin' of you)\nYou will like the way I do ya, baby\nBaby all night long (Keep thinkin' of you)\nTake my time to love from front back\nBaby all night long (Keep thinkin' of you)\nSo whenever you get that love ambition, baby\nCall on me (Keep thinkin' of you) Call on me\nJust call on me and I'll come runnin' back\n\n(Well)\nOooooh, oooooh\nHoooooh, ooooooh\n(adlibs until the music fades)",
 "image": "https://images.genius.com/eb1a1efa59045c3403a41ba10b5175a6.300x298x1.jpg"
}