{
 "title": "This Is How We Do It",
 "album": "This Is How We Do It",
 "year": "1995-02-06",
 "lyrics": "(Background chatter)\nThis is how we do it!\n(This is how we do it!)\nSha la la la la la lo\nShabada lo lo lo, whoa\n(This is how we do it!)\nLo lo lo low-oh-oh\n\nThis is how we do it\nIt's Friday night, and I feel alright\nThe party is here on the West Side\nSo I reach for my 40 and I turn it up\nDesignated driver, take the keys to my truck\nHit the 'shaw cause I'm faded\nHonies in the street say, \"Monty, yo, we made it!\"\nIt feels so good in my hood tonight\nThe summertime skirts and the guys in Kani\nAll the gangbangers forgot about the drive-by\nYou gotta get your groove on, before you go get paid\nSo tip up your cup and throw your hands up\nAnd let me hear the party say\n\nI'm kinda buzzed and it's all because (This is how we do it)\nSouth Central does it like nobody does (This is how we do it)\nTo all my neighbors, you got much flavor (This is how we do it)\nLet's flip the track, bring the old school back (this is how we do it)\n\nThis is how we do it, all hands are in the air\nAnd wave them from here to there\nIf you're an O.G. mack or a wannabe player\nYou see the hood's been good to me\nEver since I was a lower-case g\nBut now I'm a big G\nThe girls see I got the money\nHundred-dollar bills, y'all\nIf you were from where I'm from then you would know\nThat I gotta get mine in a big black truck\nYou can get yours in a '64\nWhatever it is, the party's underway\nSo tip up your cup and throw your hands up\nAnd let me hear the party say...\n\nI'm kinda buzzed and it's all because (This is how we do it)\nSouth Central does it like nobody does (This is how we do it)\nTo all my neighbors you got much flavor (This is how we do it)\nLet's flip the track, bring the old school back (This is how we do it)\nI'm kinda buzzed and it's all because (This is how we do it)\nSouth Central does it like nobody does (This is how we do it)\nY?N-Vee\n, \nSCC\n (This is how we do it)\nI'll never come wack on an old school track\n (This is how we do it)\n\nCheck it out!\nOnce upon a time in '94\nMontell made no money and life sure was slow\nAll they said was 6' 8\" he stood\nAnd people thought the music that he made was good\nThere lived a D.J. and Paul was his name\nHe came up to Monty, this is what he said\nYou and Oji are gonna make some cash\nSell a million records and we're makin' tha dash\n\nOhh, I'm buzzin' because... (This is how we do it)\nSouth Central does it like nobody does (This is how we do it)\nTo all my neighbors you got much flavor (This is how we do it)\nI'll never come wack on an old school track (This is how we do it)\nI'm kinda buzzed and it's all because (This is how we do it)\nSouth Central does it like nobody does (This is how we do it)\n\nOh, it's party time! (This is how we do it)\nStraight up comin' from the West Side (This is how we do it)\nOG's got the flavor, yeah (This is how we do it)\nAnd Monty does it like nobody does (This is how we do it)\nC'mon now, Def Jam, you know what it is (This is how we do it)\n\nYo Montell, this Percy, man\nThe barber, your barber\nMan I'm sitting up here listening to ya tape, dude\nAnd this shit is on, man\nYou gon' make it, fool\nKeep on doing what you doing, man\nMy phone number is area code\nNine oh nine, zero, eighty-\nGimme a call, man\nWe getting ready to step out to the Fox Hills Mall right now\nBut, uh\nIt's Monday morning, about a quarter to eleven, peace",
 "image": "https://images.genius.com/b01f6593df2673c2f6448c4f71f37a24.500x489x1.jpg"
}