{
 "title": "Damn!",
 "album": "Drankin’ Patnaz",
 "year": "2003-06-16",
 "lyrics": "They calling me to come back to the streets\nSean P., aka \"A Sharp Crease\"\nSaid it was necessary, these sucka niggas out here very scary\nThey cuffing hoes, they living in the month of February\nOK then, put a sissy nigga on display then\nKick in your door and have my folks bring them K's in\nI'm still Attic A-double T-I-C\nIt ain't a hoe out there, for real, who don't know bout me\nBitch I'm for sure with it\nDon't make me pop that trunk to the 'Lac\nBitch I will go get it\nAnd I ain't selfish, I will let you and your ho feel it\nWon't catch me sipping on no Cris and got a cold belly\nIt's Youngbloodz A-Town malt liquor sipping\nComing straight from the gutter\nToe-tag a motherfucker, leave them under a cover\nLil John he drop the beat that make you bounce like rubber\nSean Paul he tote the heat to make you mug then slug ya, yeah\n[Chorus: Sean Paul & \nLil' Jon\n]\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\n(\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\n)\n\nI post up get to it, drink hand in hand\nThey call me Mr. Herringbone cause that's my right hand man\nOld-school straight foolish like no other indeed\nWith Lil Jon, it's YoungbloodZ, \nthey crunk as can be\nAttic Crew 105 that's if you looking to rumble\nCock back bust aim now I done got your number\nIn the club you gone feel it when it drop this summer\nLike rain we gone pour and hit you hard like thunder\nCause in the Dirty we them boys that drank you under the table\nWhere them niggas pimp hoes in fly suits and gators\nIn my Chevy so super I'm the one to call\nJust dial 1-800-430 slash ALCOHOL\nAnd dog I'm not the one that you really just wanna clown\nI'm cool in my way, but shit still I shut them down\nAnd piss on them haters J-Bo he cuts a fool\nIn the cut bout slizzard somewhere that's how we do\n[Chorus: Sean Paul & \nLil' Jon\n]\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\n(\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\n)\n\nOut of town hard heads get Swiss cheesed up\nAnd you gonna need more than stitches to patch that leak up\nChump like me up my mouth TB'd up\nWith the plush leather guts steady gripping the butt\nOh you for sure with it, then pull your pistol\nShow a nigga you ain't hoe with it\nAnd I ain't selfish I will let you and your folk feel it\nTalking big-boy shit\nMean mugging like a motherfucker, my hand on my dick\n\nCause off the rip we keep it jumping like it ain't nothing new\nWe started off with Shake Em Off so look partner, oh guess who?\nIt's them boys from the bottom who took you down 85\nAnd hit you with that U-Way so look here don't be surprised\nWe bucking, blowing, chilling and sipping on something good\nI'm peeping out the scenery, wishing a nigga would\nIn case it just might pop off I'm ready to lock and load\nTo take you through the South to show you how we throw them bows\n[Chorus: Sean Paul & \nLil' Jon\n]\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\n(\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\n)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\nIf you don't give a damn, we don't give a fuck (Hey!)\n(\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\nDon't start no shit, it won't be no shit!\n)",
 "image": "https://images.genius.com/1788f9168a6fd43a3c6b96adf1196f6a.600x597x1.jpg"
}