{
 "title": "Gangsta Nation",
 "album": "Terrorist Threats",
 "year": "2003-10-14",
 "lyrics": "Consider this an invitation, to my gangsta nation\n\nNa na na na na na na na (Westside)\nNa na na na na na na na (Ohh, ohh)\nNa na na na na na na na (What?, what?)\nNa na na na na na na na (soo good)\nNa na na na na na na na (Yeah, yeah)\nNa na na na na na na na (we dream gangsta shit)\nNa na na na na na na na (supreme gangsta shit)\nNa na na na na na na na\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\nAnd with my peers I'm comin' up\nFools talk real loud but don't run up\nWhen we come through, they'll run'n'duck\nWe still right here so what the fuck?\n\nNigga, I'm tired of these niggas barkin' that shit, talkin' that shit\nFrom the concrete but ain't chalkin' that shit\nIn videos in a bitch pose and a throw back\nHoldin' a gat, ain't gonna bust and know that\nIt's a Dub-S-C thang, W.C. brain\nAnd we don't fuck with niggas in khaki g-strings\nFuck movin', I'm clearin the crowd\nIt's that hoo-bangin' ban-dana cri-mi-ni-mi-nal, the ori-gi-nal\n\nEvacuate the building, bitch, here come a plane\nNo, it's the mad ass Westside Connect Gang\nAnd fuck what you playin' nigga, this who bang\nWith enough game to drive a swear bitch insane\nAnd we number one gunners, no, we ain't stunners\nIt's real with us homey, killers and drug runners\nAnd Mack need a D-bo in a H2 Hummer\nLookin' hotter than a muthafuckin' L.A. summer, let's go\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\nAnd with my peers, I'm comin' up\nFools talk real loud but don't run up\nWhen we come through, they'd run'n'duck\nWe still right here so what the fuck?\n\nWhat the fuck is Ice Cube talkin' about?\nThat's how you get these nuts parked in you mouth\nWestside ride bitch, the same old shit\nI don't conversate with pussy, I ain't gon get\nI don't holla at these hoes that sing like Ashante\nBody like Beyonce, face like Andre (Uhh)\nBitch you kinda strangé\nBut I'm rich so my entré\nGot to be bombay\n\nHave you seen us? Nah\nHaters can't see us\nConnect Gang we the G'est, nigga\nCountless calls and countless charges\nStreet niggas makin' blunts out of Cuban cigars\nBig by the linnas hyp-notic by the liters\nWith a flank of hoes on us cause the chronic is the greenest\nAnd to my niggas incarcerated and on probation\nI'mma stay bangin' for the whole G Nation, nigga\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\nAnd with my peers, I'm comin' up\nFools talk real loud but don't run up\nWhen we come through, they'd run'n'duck\nWe still right here so what the fuck?\n\nIt's a Gangsta Nation, if you in, you a G\nAnd the whole world influence by the B and the C\nNow, tell the truth rappers, you don't ball like me\n'Cause I'm really from the gang, y'all is industry\nAnd while I'm servin' up and comin' young hustlas and cluckas\nBangin' for the hood, causin' havoc and ruckus\nYou niggas at the label, kissin' ass like suckas\nAnd you're bitches, so sit down when you piss, motherfuckas\n\nOne thing I do know, I ain't the uno\nBig puno, rap sumo, on pruno (You know)\nI'd like to thank the congregation\nAnd my affiliation to the Gangsta Nation\nI'm hard on them, yeah, I'm ruthless\nYou like a stick, pussy, nigga, you're useless\nYou know the side bitch, better get up on it\nCause it must be a single with Nate Dogg singin' on it\n\nLook here man\nCheck this shit out man look\nYa'll might as well say: \"Fuck it and join this Westside thing, man\"\nCause we got a muthafucking Gangsta Nation goin' over here\nAnd once you join this shit you as G as can motherfucking be!\nBelieve that, homie\nLook, it ain't a hit til Nate Dogg spit\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\nAnd with my peers, I'm comin' up\nFools talk real loud but don't run up\nWhen we come through, they'd run'n'duck\nWe still right here so what the fuck?\n\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\n(Consider this an invitation, to my gangsta nation)\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na",
 "image": "https://images.genius.com/24f2644c283021835eb0e239edd98ca9.605x600x1.jpg"
}