{
 "title": "Happy People",
 "album": "Happy People/U Saved Me",
 "year": "2004-08-24",
 "lyrics": "Ladies and gentlemen\nThis here is another one for the steppas\nDJ Wayne Williams... put the record on\nWhoooooa oh whoa oh whoa oh woah yeah, whoa yeah\nWhoooooa oh whoa oh whoa oh woah yeah, whoa, whoa\n\nTell me - what do we do, when the DJ's playin' our favorite groove?\nWe step - to when? - the whole night through\nAnd what do we do, when we all dressed up and in the mood?\nWe step - to what? - a steppas groove\nWhere do we go soon as the weekend gets here?\nThe club - why? - to party and have some fun\nWhat is it's that, can come and take away all your stress?\nTell me - music - no further questions, you have passed my test\n\nHappy people (yeah, yeah, yeah, yeah)\nKeeps the world turnin, turnin\nOh I believe that, happy people (yeah, yeah yeah, yeah)\nKeep us\nDancin, dancin, dancin\nHappy people (yeah, yeah, yeah, yeah)\nKeep us\nSteppin, keep us steppin, steppin\nHappy people (yeah, yeah, yeah, yeah)\nKeeps us groovin, groovin, groovin\n\nTell me - now what do you do, when the feeling has come over you?\nYou let go - and what? - let it take control\nAnd what do you say, when the gentleman ask you to dance\nYou say yes - and then - get on the dancefloor\nEven when it seems with goin' through some hard times\nWhat do we do? Keep smilin' - cause we know - we're gonna make it through\nWhat is it's that, can come and take away all your stress?\nTell me - music - no further questions, you have passed my test\n\nHappy people (yeah, yeah, yeah, yeah)\nKeeps the world turnin, turnin\nOh I believe that, happy people (yeah, yeah yeah, yeah)\nKeep us\nDancin, dancin, dancin\nHappy people (yeah, yeah, yeah, yeah)\nKeep us\nSteppin, keep us steppin, steppin\nHappy people (yeah, yeah, yeah, yeah)\nKeeps us groovin, groovin, groovin\n\n(I just wanna get dressed and go out, yeah)\nI wanna get dressed, I wanna go out\nCan you tell me where the spot is?\nWhere the party is all night, and everybody's havin a good time\nI wanna get nice, I wanna get loud\nCan you tell me where the spot is?\nCome on and take me to that place, where there ain't nuthin but happy\nWhoooooa (happy, happy, happy)\n\nHappy people (yeah, yeah, yeah, yeah)\nKeeps the world turnin, turnin\nOh I believe that, happy people (yeah, yeah yeah, yeah)\nKeep us\nDancin, dancin, dancin\nHappy people (yeah, yeah, yeah, yeah)\nKeep us\nSteppin, keep us steppin, steppin\nHappy people (yeah, yeah, yeah, yeah)\nKeeps us groovin, groovin, groovin\n\nUh-uh-uh, alright, uh-huh\nNow if you wanna step, you gotta play it by the rules\nYou gotta do what I do - when I do, what I do\nIf you wanna step, you gotta play it by the rules\nYou gotta do what I do - when I do, what I do\nNow, step to the left, step to the right\nSpin around and bring it down tonight\nBring it on up, move in close\nLet me see you and your partner stroke\nStep to the left, step to the right\nSpin around and bring it down tonight\nBring it on up, move in close\nLet me see you and your partner stroke\nStep to the left, step to the right\nSpin around and bring it down tonight\nBring it on up, move in close\nLet me see you and your partner stroke\nStep to the left, step to the right\nSpin around and bring it down tonight\nBring it on up, move in close\nLet me see you and your partner stroke\n\nBrake it down ya, brake it down\nAll the way to the ground\nHappy people baby, Happy people baby\nHappy people baby, Happy people baby\nAnd bring it up, bring it up\nAnd tell ya all, standing up\nHappy people baby, Happy people baby\nHappy people baby, Happy people baby\n{*laughing*} Wayne Williams, keep the groove right there baby\nWe gonna have some fun, uh-uh, Chocolate Factory\nMy people, now we all know no matter how much I sing about\nHappy people and all of those good things is still gon' be somebody out there\nWhat I do... Right? (Right...)\nRight? (Damn right...!)\nBut that's OK, because this album\nWe gon' change things with this album\nBecause I know... in my heart\nThat there is way more people out there lovin' then it is hatin'\nHey Deborah (Yeah...) Huh? (oh yeah...)\nHaha... well there's people with love in their hearts\nThat's positive and feels real good about themselves and love themselves\nI wan't ya'll repeat after me, and maybe those few haters - they'll tag along\nAy... Ya'll ready? (Yeah...!)\nCome on... One, two, three\nNow first of all: love god (Love god), love myself (Love myself)\nLove one another (Love one another), no matter what the color (No matter what the color)\nRespect that woman (Respect that woman), respect that man (Respect that man)\nYou see a person down (You see a person down), then give them a hand (Then give them a hand)\nHit the health club (hit the health club), ev'ry now and then (ev'ry now and then)\nPut a smile on your face (Put a smile on your face), and make a friend (And make a friend)\nStop that hatin' (Stop that hatin'), and negativity (And negativity)\nLove your neighbor (Love your neighbor), said the powers that be (Said the powers that be)\nIf you're going through somethin (If you're going through somethin), don't take it out on me (Don't take it out on me)\nJust ask god to fix it (Just ask god to fix it), now be happy! (Now be happy!)\nHappy people baby! {*crowd cheering*}\n{*R. Kelly ad-libs til fade*}",
 "image": "https://images.genius.com/2dd5b038150a5705c321e62a33775b31.640x640x1.jpg"
}