{
 "title": "Hotel",
 "album": "Split Personality",
 "year": "2003-09-23",
 "lyrics": "Ladies and gentlemen! (uh)\nYou are listenin to the sounds of Swizz Beatz\n (uh)\nWe got Cassidy in here, \nKels\n!\nWe in our throwbacks (uh), this is for the ladies\nWe got room keys (Whoooo!)\n w/ {Swizz Beatz in background}\nGirl you wanna come to my hotel\nBaby I will leave you my room key\nI'm feelin the way, you carry yo self girl\nAnd I wanna get wit you, cause you's a cutie\nSo if you wanna come to my hotel\nAll you gotta do is holla at me\nWe still havin a after-party\nCheckin out six in the mornin\n(Six in the mornin, six in the mornin, six in the mornin)\nCheckin out six in the mornin\n(Six in the mornin, six in the mornin, ...the mornin)\n + (Swizz Beatz)\n(Talk to 'em Cass) I be stayin in a \nho-tel, not the mo-tel\nOr the Holiday Inn (Say whaaa?!)\nIf that girl, don't participate\nWell then I'm gon' take her friend (Say whaaa?!)\nBut if, mami is wit it then, mami could get it if\nMami a rider, I'mma slide up inside the bomb\nI got a suite, you could creep on through\nI know you tryin to get yo freak on too (c'mon)\n + (R. Kelly)\nI do it all for the (ladies) yeah I ball for the (ladies)\nHit the mall for the (ladies) keep it fly for the (ladies)\nKeep my eye on (ladies) hot tub for (ladies)\nPop bub for the (ladies) I got love for my (ladies)\n\n + (Swizz Beatz)\nWe the new car-tel, R. Kel\nAnd the kid Cassidy (Say whaaa?!)\nGirl if ya man, start actin up\nAsk for him, or ask for me (Say whaaa?!)\nCause see, we could go get it crackin, but you know what'll happen\nWe be under the covers, makin love to each other\nI got a double bed, one to sleep on\nThe other to get my freak on (frk-frk-frk-frk-frk)\n + (R. Kelly)\n\n\nWe goin Chi-Town step it out, to the club lettin out\nThen we gon' sex it out, til we all checkin out\nI got my chicks, I'm gon' bring to the telly\nWe bout to do the damn thing, sing to 'em Kelly\n w/ {Swizz Beatz in background}\nIt's alright (It's alright)\nIf you wanna come wit me\nIf I fill ya fantasy\nBaby in my hotel suite\nAnd it's ok (It's ok)\nIf you wanna party night, til day\nI will do anything ya say\nJust come - to - my - hotel\n\n\nYou have just heard (you have just heard)\nA classic (a classic)\nFeaturing (featuring)\nThe one and only (the one and only)\nKels! Cassidy {*scratched - \"R. Kelly\"*}\nSwizz Beatz the monster (yes I am)\nFull Surface the label (yes, yes)\nRockland the family (Rockland the family)\nRuff Ryders the family (Ruff Ryders the family)\nWhooo! (whooo!) This one's for the ladies y'all\nTh-th-the ladies, the ladies (please believe it)\nGetcha hands up (getcha hands up)\nGetcha hands up, getcha-getcha hands up (whooo!)\nGetcha hands up, getcha-getcha hands up (this part one y'all)\n(C'mon!) Getcha hands up, getcha-getcha hands up (part one)\n(Ladies!) Getcha hands up, getcha-getcha hands up\n(C'mon!) Getcha hands up, getcha-getcha hands up\n(Bounce wit a) Getcha hands up, getcha-getcha hands up\n(Ladies!) Getcha hands up, getcha-getcha hands up\n(Bounce wit a) Getcha hands up, getcha-getcha hands up\n(C'mon) Getcha hands up, getcha-getcha hands up...",
 "image": "https://images.genius.com/f97dd825a47206b86388a2b925e1e452.500x500x1.jpg"
}