{
 "title": "I Don’t Wanna Know",
 "album": "Hurt No More",
 "year": "2003-11-18",
 "lyrics": "Hold up, let me answer my phone. Some bitch callin' me about some bullshit probably. I'mma call you right back, I'm doin' this mixtape right now. Now back to what I was sayin'...\n\nSomebody said they saw you\nThe person you were kissing wasn't me\nAnd I would never ask you\nI just kept it to myself\n\nI don't wanna know\nIf you're playin' me, keep it on the low\n'Cause my heart can't take it anymore\nAnd if you're creepin', please don't let it show\nOh baby, I don't wanna know\n\nOh baby\nI think about it when I hold you\nWhen lookin' in your eyes, I can't believe\nI don't need to know the truth\nBaby keep it to yourself\n\nI don't wanna know\nIf you're playin' me, keep it on the low\nCause my heart can't take it anymore\nAnd if you're creepin', please don't let it show\nOh baby, I don't wanna know\n\nDid he touch you better than me? (Touch you better then me)\nDid he watch you fall asleep? (Watch you fall asleep)\nDid you show him all those things, that you used to do to me (Do to me baby)\nIf you're better off that way (Better off that way)\nThere ain't more that I can say (More that I can say)\nJust go on and do your thing and don't come back to me\n(Stay away from me, baby)\n\nI don't wanna know where your whereabouts or how you movin'\nI know when you in the house or when you cruisin'\nIt's been proven, my love you abusin'\nI can't understand how a man got you choosin' (Yeah)\nUndecided, I came and provided\nMy undivided, you came and denied it (Why?)\nDon't even try it, I know when you lyin' (I know when you lyin')\nDon't even do that, I know why you cryin' (Stop cryin')\nI'm not applyin' no pressure, just wanna let you know\nThat I don't wanna let you go (I don't wanna let you go)\nAnd I don't wanna let you leave\nCan't say I didn't let you breathe\nGave you extra cheese (C'mon), put you in the SUV\nYou wanted ice so I made you freeze\nMade you hot like the West Indies (That's right)\nNow it's time you invest in me\nCause if not then it's best you leave\nHolla, yeah\n\nI don't wanna know\nIf you're playin' me, keep it on the low\nCause my heart can't take it anymore\nAnd if you're creepin', please don't let it show\nOh baby, I don't wanna know\nIf you're playin' me, keep it on the low\nCause my heart can't take it anymore\nAnd if you're creepin', please don't let it show\nOh baby, I don't wanna know\nIf you're playin' me, keep it on the low\nCause my heart can't take it anymore\nAnd if you're creepin', please don't let it show\nOh baby, I don't wanna know",
 "image": "https://images.genius.com/0c57d601f01695dfe1e83d167456487d.600x600x1.png"
}