{
 "title": "In My Life",
 "album": "Juve the Great",
 "year": "2003-12-23",
 "lyrics": "Ladies and Gentlemen, boys and girls, lil' children, dogs and cats\nRight about now you are listening to the incredible drum patterns of\nDJ Mannie, Fresh, Fresh, Fresh\nFresh, Fresh, Fresh, Fresh\nFresh, Fresh, Fresh, Fresh\nLADIES AND GENTLEMEN!\n (2x)\n\nI'mma buy cars\nI'mma get clothes\nI'mma rock jewels\nI'mma fuck hoes,\nI'mma smoke weed\nGot alot of drinks\nSteppin out; gators\nCoca-Cola mink\n\nI need it in my life\nI want it in my life\nCome put it in my life\nI'mma keep it in my life\n\nIts that nigga Juve, from the Magnolia, still loc'in\nYou hoes know what's happenin' with me, bust that pussy open\nLoose titty, loose booty, round down and up\nIf a gangsta can't touch it, what you bouncin it fu'\nNow give me leadway, watch how a G play\nWatch how my name get caught up in he and she say\nIt's UTP day, we what the streets made,\nThey represent us when they hear us at the DJs!\nBreak bread with me, nigga, is you mad with me?\nThought we was people, y'all supposed to spend ya cash with me\nI mean ya last with me, hold me down\nGive me a whip, give me a bitch, and let her blow me down!\nI'm so gutta, I'm so slick, I'm so grimy\nI promise you something, and I bet you ya don't find me\nLook, I'mma eat, purchase whatever I please\nCO, give me the ki's or a brick, I need two of these!\n (2x)\n\nI'mma be so courageous, and so contagious\n'Til my fuckin rap sheets gonna receive mo' pages\nListen to Juve cause this my year mon (my year mon)\n+400 Degreez+ and I'm bout to kick it in gear mon (in gear mon)\nDon't you see the soldiers and vogues when I appear mon (appear mon)\nAbout bein written on my face cause I don't fear none (don't fear none)\nMe and my team got a scheme to go light the block up\nSkip's movin' the work, and Wacko poppin' the chopper\nI scream the \"U\" cause I mean it\nThe difference is you be throwin yo' shit up when you scream it - I seen it!\nShit all the obstacles that I been through\nWhat made you think, I'mma be scared of a bitch like you?\nI'm ya dawg, let me get it on consignment\nYou ain't paid them last people yet, dawg, don't even remind me\nI gained knowledge, my game polished and it's obvious\nYou can't block it, you can't knock it, this is profit!\n (2x)\n\nCan I untape the clips and chill?\nShow my niggas it's real?\nCan my people shop in Beverly Hills?\nI got a lot of work I know that's gonna be ahead of me still\nBut my beast mentality gon' keep me ahead of the field!\nPardon me, but I got paper to chase\nNow cut through the talking and bring me straight to the safe\nI know where the cameras at and I'm destroying the tape\nI'm not leaving no evidence for the forensic to trace\nI got a problem on my hand, a few bills I ain't been payin'\nI figured about a lil' less than 75 grand\nAnd my dog Rocky caught a nickel for a pistol\nIts serious when the federales comin' to get you!\nLife is at a standstill out here in this damn field\nWhat you say can get you and ya mans killed\nIt's my last chance to come up, its gotta be it\nJuvi comin' out, the first-round lottery pick!\n (2x)",
 "image": "https://images.genius.com/cbe3d08315d1a5d90263977e7455b5d5.500x500x1.jpg"
}