{
 "title": "Mujer Negra",
 "album": "AP Spanish Literature and Culture",
 "year": null,
 "lyrics": "Todavía huelo la espuma del mar que me hicieron atravesar.\nLa noche, no puedo recordarla.\nNi el mismo océano podría recordarla.\nPero no olvido el primer alcatraz que divisé.\nAltas, las nubes, como inocentes testigos presenciales.\nAcaso no he olvidado ni mi costa perdida, ni mi lengua ancestral\nMe dejaron aquí y aquí he vivido.\nY porque trabajé como una bestia,\naquí volví a nacer.\nA cuanta epopeya mandinga intenté recurrir.\n                       Me rebelé.\nSu Merced me compró en una plaza.\nBordé la casaca de su Merced y un hijo macho le parí.\nMi hijo no tuvo nombre.\nY su Merced murió a manos de un impecable lord inglés.\n                       Anduve.\nEsta es la tierra donde padecí bocabajos y azotes.\nBogué a lo largo de todos sus ríos.\nBajo su sol sembré, recolecté y las cosechas no comí.\nPor casa tuve un barracón.\nYo misma traje piedras para edificarlo,\npero canté al natural compás de los pájaros nacionales.\n                        Me sublevé.\nEn esta tierra toqué la sangre húmeda\ny los huesos podridos de muchos otros,\ntraídos a ella, o no, igual que yo.\nYa nunca más imaginé el camin a Guinea.\n¿Era a Guinea? ¿A Benín? ¿Era a\nMadagascar? ¿O a Cabo Verde?\nTrabajé mucho más.\nFundé mejor mi canto milenario y mi esperanza.\nAquí construí mi mundo.\n                        \nMe fui al monte.\nMi real independencia fue el palenque\ny cabalgué entre las tropas de Maceo.\nSólo un siglo más tarde,\njunto a mis descendientes,\ndesde una azul montaña.\n                        Bajé de la Sierra\nPara acabar con capitales y usureros,\ncon generales y burgueses.\nAhora soy: sólo hoy tenemos y creamos.\nNada nos es ajeno.\nNuestra la tierra.\nNuestros el mar y el cielo.\nNuestras la magia y la quimera.\nIguales míos, aquí los veo bailar\nalrededor del árbol que plantamos para el comunismo.\nSu pródiga madera ya resuena.\nEnglish Translation\nI still smell the foam of the sea they made me cross.\nThe night, I can not remember it.\nThe ocean itself could not remember that.\nBut I can’t forget the first gull I made out in the distance.\nHigh, the clouds, like innocent eyewitnesses.\nPerhaps I haven’t forgotten my lost coast,\nnor my ancestral language.\nThey left me here and here I’ve lived.\nAnd, because I worked like an animal,\nhere I came to be born.\nHow many Mandinga epics did I look to for strength.\n                        I rebelled.\nHis Worship bought me in a public square.\nI embroidered His Worship’s coat and bore him a male child.\nMy son had no name.\nAnd His Worship died at the hands of an impeccable Englishlord.\n                         I walked.\nThis is the land where I suffered\nmouth-in-the-dust and the lash.\nI rode the length of all its rivers.\nUnder its sun I planted seeds, brought in the crops,\nbut never ate those harvests.\nA slave barracks was my house,\nbuilt with stones that I hauled myself.\nWhile I sang to the pure beat of native birds.\n                        I rose up.\nIn this same land I touched the fresh blood\nand decayed bones of many others,\nbrought to this land or not, the same as I.\nI no longer dreamt of the road to Guinea.\nWas it to Guinea?  Benin?\n                         To Madagascar? Or Cape Verde?\nI worked on and on.\nI strengthened the foundations of my milllenary song and of my hope.\n                         I left for the hills.\nMy real independence was the free slave fort\nand I rode with the troops of Maceo.\nOnly a century later, together with my descendents,\nfrom a blue mountain\n                       I came down from the Sierra\nto put an end to capital and ursurer,\nto generals and to bourgeouis.\nNow I exist: only today do we own, do we create.\nNothing is foreign to us.\nThe land is ours.\nOurs the sea and sky,\nthe magic and vision.\nCompañeros, here I see you dance\naround the tree we are planting for communism.\nIts prodigal wood resounds.",
 "image": "https://images.genius.com/cb71cb94713fa300787182ab7c604d46.1000x1000x1.jpg"
}