{
 "title": "Nolia Clap",
 "album": "Nolia Clap",
 "year": "2004-08-31",
 "lyrics": "1, 2, 3, 4 bust it\nCome on, come on\nJuvenile, Wacko, Skip\n\nWhere that Melph at\nWhere the Yo at\nWhere that Thomas at\nWhere VL at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\n\nI'm in the Calliope, You know I'm headed front of town\nBy Chaotic and the Real One, cause it's goin' down\nYou see the DB's tell em' Wacko lookin' for em'\nI got some dro, I got some change, I got some pussy for em'\nIf they ask you where I'm at I'm in the Melph pickin up Chuck\nIn a chromed out bubblegum pickup truck\nSlide on Josephine, holla at Lil' Kia and Pluck\nMy nigga Troy'll tell it, hey they keep it real as fuck\nWe goin' to House of Blues tonight after the DJ in the Nolia\nOn Washington and Freret, across the street from Babosca\nBut first I'm bout to snatch up all Saratoga\nHead straight to Foot Action and snatch me two pair of Soldiers\nTake a left on Toledano get a oh of that doja\nTerror night at my trial, I'll get them guards and let's roll up\nI'm bout to hit Julio, let's get to blazin' some soda\nI got Geezy waiting on VL we about to bang up the 'Yola\n\nWhere that Melph at\nWhere the Yo at\nWhere that Thomas at\nWhere VL at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\nWhere Hollygrove at\nGert Town at\nP Town at\nNigga Town at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\n\nI'm in Hollygrove searchin' for the Skip dog (wahhh)\nH2 chromed out, nice whip dog\nLet's hit Gert Town, I heard they pop it off\nOr hit P town, I heard they drop it off\nMy cousin Leaf from the Vill told me to swing through, on St. Lou\nHe got two hoes that'll eat and drink too\nWe can bounce through the Lafitte and we can fuck with these hoes\nThey take dick in they ass, they take dick in the throat\nThey take dick in they ear, they take dick up they nose\nThey take a dick, anywhere your dick can go\nBut look, it ain't nothin' like my bitch out the St. Bernard\nA gangsta broad, get Wacko gangsta hard\nShe said we might could run a train if I pursue my G\nIf not I got it poppin' off on Music Street\nLast week I had to do about two of them freaks\nBut them niggas through there be trippin' so bring two of them heats\n\nWhere that Iberville at\nThe St. Bernard at\nLafitte at\nThe 8th Ward at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\nWhere that Desire at\nThat Florida at\nAL at\nCross the Canal at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\n\nI see you learnin', see you peepin' out that Nolia Clap\nI bet you nine times out of ten that whole Nolia strapped\nOK, we fell off for a minute but that Nolia back\nWe got quarters, ounces, and halfs and birds of smack\nEver since Soulja got killed I keep a murder gat\nStand on the middle of my projects where the murders at\nAnd every nigga, every bitch who ain't heard of Wack\nI bang women, bang children, bang them murder cats\nI bang blocks, bang cribs, bang the Burban Lac'\nI bang anything in sight without the murda tats\nI'm just the hit to represent where I was born and raised\nAnd every nigga in my section love to roam with K's\nYou got beef holla at me, get it on today\nYou not quickly Uptown Bon Temps Rouler\nKnock off your face, taste, waist, take arms and legs\nDrop off your neck, wrist, toes, hair, palms, and head\n\nWhere that Melph at?\nWhere the Yo at?\nWhere that Thomas at\nWhere VL at?\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\nWhere Hollygrove at\nGert Town at\nP Town at\nNigga Town at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\nWhere that Iberville at\nThe St. Bernard at\nLafitte at?\nThe 8th Ward at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap\nWhere the Desire at\nThat Florida at\nAL at\nCross the Canal at\nY'all hear that Nolia Clap\nY'all hear that Nolia Clap",
 "image": "https://images.genius.com/a75bb14b2594372bec1fe7f8d0544d57.600x600x1.jpg"
}