{
 "title": "On Fire",
 "album": "The Hunger for More",
 "year": "2004-06-29",
 "lyrics": "New York City (\"Hunger for More!\")\nYou are now rocking with the best\nLloyd Banks\nG-Unit!\n\nWe on fire\nUp in here, it's burning hot\nWe on fire!\nShorty take it off if it get too hot, up in this spot\nWe on fire!\nTear the roof off this motherfucker, light the roof on fire\nUh, nigga what you say\nWe getting loose in this motherfucker, light the roof on fire, fire, fire this\n\n(Right?)\nNah, I ain't putting nothing out, I smoke when I wanna\n26-inch chrome spokes on the Hummer\nThis heat gon last for the whole summer\nRunning your bitch faster than the Road Runner\nRocks on my wrist, rolls gold under\nGlocks on my hip, those throw thunder\nI'm buying diamond by the pier\nBut when you stop, the only thing still spinning is your hair\nYeah, I'm riding with that all black snub\nRaiders cap back, all black gloves\nI'm 80's man, but the boy smack thugs\nThese record sales equal more back rubs\nNot to mention I bought a pack of clubs\nHis impacts about as raw as crack was\nNow all these new artists getting wrong deals\nI'm only 21, sitting on mills\n\nWe on fire\nUp in here, it's burning hot\nWe on fire!\nShorty take it off if it get too hot, up in this spot\nWe on fire!\nTear the roof off this motherfucker, light the roof on fire\nUh, nigga what you say\nWe getting loose in this motherfucker, light the roof on fire, fire, fire\n\n(Ugh)\nIf you know anything about me, then you know I'm a baller\nIf I don't hit the first night, I ain't gon' call her\nI'm trying to play, you trying to have my daughter\nBut I can't blame her for what her momma taught her\nAnd I don't care bout what the next nigga bought her\nCause I ain't putting no baguettes in her butter\nI got a diamond about as clear as water\nAnd I got bread, but I ain't sparing a quarter<\nSo cut the games ma, let's go in the back\nMatter fact, turn your ass 'round, back a nigga down\nAnd I ain't bias when I'm riding through the town\nLike 'em small, like 'em tall, like 'em black, like 'em brown\nShe gotta be able to come when I need her\nTight ass pants, little wife beater\nRegular chick or R&B diva\nBitch say something, I ain't a mind reader\n\nWe on fire\nUp in here, it's burning hot\nWe on fire!\nShorty take it off if it get too hot, up in this spot\nWe on fire!\nTear the roof off this motherfucker, light the roof on fire\nUh, nigga what you say?\nWe getting loose in this motherfucker, light the roof on fire, fire, fire",
 "image": "https://images.genius.com/d56cf2b0a4da6a548896942e962323c1.640x585x1.jpg"
}