{
 "title": "Slow Motion",
 "album": "Juve the Great",
 "year": "2004-03-01",
 "lyrics": "Slow motion for me\nSlow motion for me, move in slow motion for me (C'mon)\nSlow motion for me\nSlow motion for me, move in slow motion for me\n\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\n\nI'm a dick thrower, \nher neck and her back hurting\nCut throater, have you like a brand new virgin\nIt's like when you get used of it then you start serving\nHop up on top and start jicky-jicky-jerking\nSlow down for me, a-you moving too fast\nMy fingers keep slipping, I'm tryna grip that ass\nKeep being hard-headed and I'ma make you get off me\nGot human enough disguise but my face is a doggy\nIf you loving my bark let me bury my bone\nI got four or five bad married bitches at home\nOne of my bitches feel in love with that outside dick\nThat outside dick keep them hoes sick like\n\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\n\nIt's like I got the world in my palms\nYour girl up under my arms, she fucked up from the charm\nShe love the way the dick stay hard from 12 'til early in the morn'\nFine bitches if you listening, you heard me, I'm strong\nIf you going through your cycle, I ain't with it, I'm gone\nYou must have heard about them hoes that I beat up in my home\nThey wasn't telling the truth baby, you know they was wrong\nNow, make it official, wind up some of that dome\nI don't mind buying blue, your riding to\nDon't be asking nigga questions about where I'm driving you\nLil mama my shit together, I ain't jiving you\nI don't think that nigga could do you better then I could do, ya know\nAnd Juvenile from cross the street by the derby\nSame nigga that used to be running with Rusty and Kirby\nCan a playa from the 'Nolia get a chance with it?\nBut I can't bounce with you without using my hands with it\n\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\n\nSlow motion, she open, I'm hoping she don't leave my dick broken\nWith brush burns and swollen\nI'm toting, she wanted me to make her out a believer\nI gurantee ya I'ma see ya when I see ya\nAnd just don't holla out my name like we was all that\nYour pussy throw back and you know that\nSo stop stunting, slow motion for a real nigga\nI'm going off that incredible potion and I'ma deal with ya\n\nI like how that Victoria Secret sit in that ass\nLet me pour some more hip and Hennsey in your glass\nWould I be violating if I grab me a handful?\nI know what's happening, all I want is a sample\nWho you with? I'm in the rental today\nIt's going down and happening and I remember the way\nLess money we spend on bullshit, the more for the weed\nWhat's it gonna take for you to come slow motion with me?\nLike\n\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me\nUghh! I like it like that\nShe working that back, I don't know how to act\nSlow motion for me, slow motion for me\nSlow motion for me, move in slow motion for me",
 "image": "https://images.genius.com/3ed53151836ce46277c49b354c4d9058.1000x1000x1.png"
}