{
 "title": "Slow Jamz",
 "album": "The College Dropout (Original Version)",
 "year": "2003-12-02",
 "lyrics": "Kanye, it's Foxx, man\nI'm just sayin' I was talkin' to the girls you know\nAnd we don't put enough emphasis on the ladies sometime\nYou know, I was talkin' to this girl\nShe was talkin' about the music all fast in the club you know\nShe gotta drink water 'cause she thirsty\nShe danced like 92 hundred songs back to back\nWith ain't nobody really try to find out what she feelin'\nLike how she feel... you know what she told me?\n(Are you gonna be?) Check it out, this is what she said\n(Say that you're gonna be) Ooh, ooh, ooh, ooh, oooh\n[Chorus: Jamie Foxx & \nLuther\n]\nShe said she want some Marvin Gaye, some Luther Vandross\nA little Anita will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\nShe said she want some Ready for the World, some New Edition\nSome Minnie Riperton will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\n\nIt definitely will!\nYou know what I told her?\n\nI told her to drive over in yo new whip, bring some friends you cool wit\nI'ma bring the cool whip, then I want you to strip\nSee you is my new chick, so we get our grind on\nShe be grabbin', callin' me Biggie like Shyne home\nMan I swear she fine homes, why she always lyin' though?\nTellin' me them diamonds, when she know they rhinestones\nShe got a light-skinned friend look like Michael Jackson\nGot a dark-skinned friend look like Michael Jackson\nI played Ready for the World, she was ready for some action\nMy dog said you ain't no freak so you 'bout to prove my man wrong\nI'ma play this Vandross, you gon' take yo pants off\nI'ma play this Gladys Knight, me and you gon' get right\n[Chorus: Jamie Foxx & \nLuther\n]\nShe said she want some Marvin Gaye, some Luther Vandross\nA little Anita will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\nShe said she want some Ready for the World, some New Edition\nSome Minnie Riperton will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\n\nSmokey Robinson, Smokey Robinson\nFreddie Jackson, everything, everything (Well well well well)\nSmokey Robinson, Ashford & Simpson (Are you gonna be)\nSet the party, really set the party off right\nYes it will, yes it will (Well well well well)\nAl Green, oh! Al Green, ohh yeah!\nOooh!!!\nWhatcha know about the Isley Brothers?\n[Interlude: Aisha Tyler & \nKanye West\n]\nNow Kanye, I know I told you to slow it down, baby\nIt's good, it's all good, it's beautiful\nBut now I need you to do it faster baby\nCan you please? Do it faster, baby, do it faster!\nDamn, baby; I can't do it that fast... but I know somebody who can, Twista!\n\nGot you looking at the glist on my hands and wrist\nWhile I'm layin' back and smoking on my cannabis\nWhen it come to rockin' the rhythm like Marvin and Luther\nI can tell you ain't no messin' with Kan Man and Twist\nIn the Chi and I be sippin' Hennessy, play some R&B\nWhile I smoke a b, you can preferably find that I'm a G\nAnd all this (Well well well well)\nCome wit me and sip on some Evelyn Champagne\nYou ain't know Twista could work it like the Whispers?\nHit the stop light, \nmove it to some Isleys\nRims still movin' so I bump a lil' Spinners\nWhile I'm smoking on a b, dippin' through the streets\nBumpin' R&B and I got the heat on the 23's\nAnd I do it (Well well well well)\nWit my Earth in the Wind smoking Fire\nLet me get ya sheets wet listenin' to Keith Sweat\nPut you in a daze wit Maze\nFulfilling our every temptation\nSlow jammin', havin' deep sex\nYou ready for the world girl, come on go wit me\nI touch you all over your body baby don't say no to me\nAnd every moment be controlling me\nI'm lovin' the way you be holdin' me when I be listenin' to Jodeci\nAnd when I come over and bend ya ass\nYou be bumpin' Teddy Pendergrass\nI done hit it from the back, to the melody and rode it slow\nNow I got to go up in it fast, but I'ma finish last\nNo matter how much of a thug you see\nI still spit it like it's R&B, come to the club wit' me\nAnd when some Luther come on I hope you feelin' me\nAnd still will be in love wit' me, Chi ride\n[Chorus: Jamie Foxx & \nLuther\n]\nShe said she want some Marvin Gaye, some Luther Vandross\nA little Anita will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\nShe said she want some Ready for the World, some New Edition\nSome Minnie Riperton will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\n\nSly and the Family Stone (Sly and the Family Stone)\nLet's get the party on (Let's get the party on)\nSly and the Family Stone (Sly and the Family Stone)\nLet's get our party on (Let's get our party on)\nEarth, Wind and Fire, baby (Earth, Wind and Fire, baby)\nLet's take it higher, sweetie (Let's take it higher, sweetie)\nLet's really set, let's really set this party off\n[Chorus: Jamie Foxx & \nLuther\n]\nShe said she want some Marvin Gaye, some Luther Vandross\nA little Anita will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)\nShe said she want some Ready for the World, some New Edition\nSome Minnie Riperton will definitely set this party off right\n(\nAre you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well\n)",
 "image": "https://images.genius.com/05033c92156c1d3f9cc521ce500cf6cc.1000x1000x1.jpg"
}