{
 "title": "This Way",
 "album": "Neighborhood Watch",
 "year": "2004-04-06",
 "lyrics": "[Intro: Kanye West, \nSample\n, \nChoir\n, & \nEvidence\n]\nNow turn it up (\nA little louder!\n)\nTurn it up (\nA little louder!\n)\nTurn it up (\nA little louder!\n)\nCan't live my, I, I can't live my\nI can't live my, I, I can't live\nTurn it up (\nA little louder!\n)\nI, I can't live my\nCan't live my life...\n\nYeah, yo, I can't live my I, I can't live my\nLife this way, continually get high\nInstead of running 'round, lock one bird down (Yeah)\nIt's a new day, gotta do it big just to get by (Right, right)\nShow no respect? Can't live that way (Nah, nah)\nYou hold my check? Can't live that way\nWithout my chick on deck? Can't live that way (Yeah)\nThey say what they like, but I've been that way (Woo!)\nI moves calculated through the lens, almost here (Yeah)\nSuccess will be the best revenge (Yeah)\nMan, from Clint East' to Kanye West (What up! What up!)\nThe sun can't chill but everyday it sets (Evidence!)\n[Hook: Men's Choir + (Women's Choir) & \nKanye West\n]\nThis time, I made up my mind\nThis time, I'm back on my grind\nI know there's things in my life\nThat I'ma let go starting tonight\n(I can't live my, I, I can't live my)\n(I can't live my, I, I can't live my)\nI can't live my, I, I can't live my\nI can't live my life\nThis way (Can't live my, I, I can't live my)\nThis way (I can't live my, I, I can't live my)\n(This Way) I can't live my, I, I can't live my\nI can't live my life this way (\nYeah, Kanye to the\n)\n\nMy favorite girl wanna leave me just because I got a girlfriend\nMy freak girl told me now, she a Christian\nMy white girl wanna move back to Michigan (Okay)\nI'm pulling girls off the bench like a sixth man\nI'm in the club, doing the same ol' two step\nWhile Omegas doing the same ol' \"Q\" step (Q!)\nI have my money on my mind, I was thinking green\nShe a pledge A.K.A., she was pink and green\nI want a good girl, she want a gentleman (Okay)\nWe saying the same thing like a synonym\nI wasn't really spitting game, I was scrimmaging\nMy penmanship so hard it need censorship (Woo!)\nI'm a Chicagoan 'til Chicago ends (Yeah!)\nTill we blow like Chicago wind\nI don't know what's better, getting laid or getting paid (Haha)\nI just know when I'm getting one, the other's getting away\nThis way!\n\nThis time I made up my mind (\nUgh\n)\nThis time I'm back on my grind (\nYeah\n)\nI know there's things in my life\nThat I'mma let go starting tonight\n(I can't live my, I, I can't live my)\n(I can't live my, I, I can't live my)\nI can't live my, I, I can't live my\nI can't live my life this way (can't live my, I, I can't live my)\nThis way (I can't live my, I, I can't live my)\nThis way, I can't live my, I, I can't live my\nI can't live my life this way\n\nGo 'head, flip a coin so the game can start\nBelieve I know the drama, kid name the part\nI learned before the hot flame came the spark\nIt's like before the pop fame came to 'Pac\nBut this industry'll play with your life man\nThey playing with your rent, food, water and lights man\nThat's why Rakaa brings it like that ol' Toddy Tee jam\nThe Batterram\n \nthen I'm off to Amsterdam\nTo rest up for strength to deal with this weight\nTo deal with these deals, to deal with this hate\nI dedicate this Jam Master Jay\nRun-D.M.C. showed me how to walk, this way\n\nThis time I made up my mind\nThis time I'm back on my grind\nI know there's things in my life\nThat I'mma let go starting tonight\n(I can't live my, I, I can't live my)\n(I can't live my, I, I can't live my)\nI can't live my, I, I can't live my\nI can't live my life this way (can't live my, I, I can't live my)\nThis way (I can't live my, I, I can't live my)\nThis way, I can't live my, I, I can't live my\nI can't live my life this way",
 "image": "https://images.genius.com/03277d57c7dc97910b5e1f84c94d3206.600x600x1.jpg"
}