{
 "title": "What’s Happnin’!",
 "album": "Me and My Brother",
 "year": "2003-08-15",
 "lyrics": "Miami...\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey\n(4, 3, 2, 1)\n\nBOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (WHAT?!)\nI said BOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (I-YUP!)\n\nHalf step pussy ass nigga\nWhy you lookin' at a nigga like you wanna run one wit' me?\nI got my big gun wit' me\nDon't feel like dukin', I feel like shootin', fool\nAnd I don't like your atitude\nYou do shit that them hoes on a rag'll do\nOl' faggot, you better watch your mouth\n'Fore I be in front your house when your ass come out\nOl' bitch ass, hold another nigga dick ass, snitch ass nigga\nKeep lookin' at a nigga like you gonna tell somethin'\nI'll fuck around and, kill ya (Fuck around and kill yo' ass)\nSo on your mark, get set, get ready, YO!\nIf this shit get silly I'm lettin' it go\nOn Front Street or in the front seat\nYou ever come my way, it's gon' be gunplay\nAnd HEY... I ride wit' the AK\nGet high and spit five out the AK\nOkay, let a nigga play\nAnd watch T-Double-D knock your ass off the free seat\nAll my Dade County Chevy boys\nWe drive candy toys and tote guns galore\nAnd treat the Hummer like a Tonka toy\nAnd got shit you niggas ain't seen before, huh\n\nBOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\n+BOOM!! bitch, what's happnin'? (WHAT?!)\nI said BOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (I-YUP!)\n\nYing Yang and the T-Double-D\nWe, in this motherfucker, crunk in this motherfucker\nAtlanta niggas wit' a Miami boy\nAnd I still like to play wit' my Tonka toy\nI'm a Toys R Us kid, yes I is\nYou can't be serious? Yes I is\nYou think I'm playin', then ask my brother\nYou still don't believe me, then ask my mother\nBecause I love my gun, I play wit' my gun\nI fondle my gun, have sex wit' my gun\nAnd I don't pull that motherfucker out for fun\n'Cause I ain't finna' give yo' ass time to run\nI'ma bust one time, bust two times\nBy the third time, your ass is mine\nHe'll be down for the count, he can't get up\nDamn! He's fallen, he can't get up\n\nBOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (WHAT?!)\nI said BOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (I-YUP!)\n\nYou a soft muh'fucka, and a fag muh'fucka\nIf you mad 'cause you like you never had muh'fucka\nFuck yo' ass muh'fucka, that's the past muh'fucka\nAnd I know the fact make ya mad muh'fucka\nIt is, what a fuck nigga think it ain't\nFor real, you lame and we off the chain\nYing and the T-Double-D, we BOLO\nFuck hoes, niggas, ride by my dolo\nGet the keys to my car, and I jump in\nHit the liquor store, buy my cigars and gin\nGet drunk and I'm off in the wind\nLookin' for a little itty bitty pretty that could hold a sin\n\nWe smokin', and ridin'\nDon't tell nobody be quiet\nMight cut it, lil' buddy\nCan't let this shit get ugly\n\nBOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (WHAT?!)\nI said BOOM!! it's on, bitch nigga, we'll rock yo' dome\nBOOM!! bitch, what's happnin'? (WHAT?!)\nBOOM!! bitch, what's happnin'? (I-YUP!)\n\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey\nOh my God, from the South to the bottom\nTrick Daddy Dollars, Ying Yang Twins, Beat-In-Azz\nCollipark Music Incorporated\nThis the next level right here\nThis that crunk party\nAll these niggas doin' this crunk music, we crunk party, nigga\nWe original wit' it, yeah\nHey man, who really run the South?",
 "image": "https://images.genius.com/085ab56396183b9f7bfa24c05fd53a10.1000x1000x1.jpg"
}