{
 "title": "Yeah",
 "album": null,
 "year": "2004-01-10",
 "lyrics": "Up in the club with my homies trynna get a lil v-i keep it down on the low key you should know how it feelss (hey) I seen shorty, she was checking up on me from the game she was spitting in my ear you should think that she know me I decided to chill (okay!)  conversation got heavy she had me feeling like  she's redy to blow (watch out) oh!\n(Watch out!) she's saying come get me, so I got up and followed her to the flo she said baby let's go! When I told her I said yeah! Shorty got down low said yeah! I got so caught up I forgot she told me her and my girl they use to do thе best of homies (yeah!) Yеah! Next  thing I knew she was all up on me got so caught up, I forgot she told me\n(Yeah!) Yeah!\nHer and my girl, they used to be the best of homies\n(Yeah!) Yeah!\nNext thing I knew, she was all up on me screaming\nYeah (yeah!) yeah (yeah!) yeah, yeah\nYeah (yeah!) yeah (yeah!) yeah, yeah\nShe's all up in my head now, got me thinking\nThat it might be a good idea to take her with me\n'Cause she's ready to leave, ready to leave now (let's go!)\nAnd that I gotta keep it real now\n'Cause on a one to ten, she's a certified twenty\nBut that just ain't me (hey!)\n'Cause I don't know, if I take that chance\nJust where's it gonna lead\nBut what I do know is the way she dance\nMake shorty alright with me\nThe way she get low\nI'm like, yeah, just work that out for me\nShe asks for one more dance, and I'm like, yeah\nHow the hell am I supposed to leave\n(Let's go, bring the beat back!) And I say\nYeah!\nShorty got down low said, come and get me\n(Yeah!) Yeah!\nI got so caught up, I forgot she told me\n(Yeah!) Yeah!\nHer and my girl, they used to be the best of homies\n(Yeah!) Yeah!\nNext thing I knew, she was all up on me screaming\nYeah (yeah!) yeah (yeah!) yeah, yeah!\nYeah (yeah!) yeah (yeah!) yeah, yeah!\nWatch out, my outfit's ridiculous\nIn the club looking so conspicuous\nAnd roar, these women all on the prowl\nIf you hold the head steady, I'ma milk the cow (yeah!)\nAnd forget about game, I'ma spit the truth (what?)\nI won't stop 'til I get 'em in they birthday suit (yeah!)\nSo gimme the rhythm and it'll be off with their clothes\nThen bend over to the front and touch your toes\nI left the Jag and I took the Rolls\nIf they ain't cutting, then I put 'em on foot patrol (let's go!)\nHow you like me now?\nWhen my pinky's valued over three hundred thousand\nLet's drink, you the one to please (yeah!)\nLudacris fill cups like double D's (yeah!)\nMe and Ursh' once more, and we leaves 'em dead\nWe want a lady in the street but a freak in the bed that say\nYeah!\nShorty got down low said, come and get me\n(Yeah!) Yeah!\nI got so caught up, I forgot she told me\n(Yeah!) Yeah!\nHer and my girl, they used to be the best of homies\n(Yeah!) Yeah!\nNext thing I knew, she was all up on me screaming\nYeah (yeah!) yeah (yeah!) yeah, yeah!\nYeah (yeah!) yeah (yeah!) yeah, yeah!\nTake that and rewind it back\nLil Jon got the beat that make your booty go\nTake that, rewind it back\nUrsher got the voice make your booty go\nTake that, rewind it back\nLudacris got the flow to make your booty go\nTake that, rewind it back\nLil Jon got the beat that make your booty go yeah!",
 "image": "https://images.genius.com/76b5cb75f6e0b4da94acdaa4363fe75f.237x237x1.jpg"
}