{
 "title": "Betrayed",
 "album": "TOTAL XANARCHY",
 "year": "2017-06-19",
 "lyrics": "Huh, ayy (Yeah)\nYou are now listening to a Bobby Johnson beat\nWhat? Yeah, ayy, ayy\n\nPop the trunk, I open up\nI sold my soul, a good price, outta sight\nAnd my ho got talent, right?\nWhole squad ran through that shit, yikes\nAyy, I'm a business man, I did my business, damn\nAnd I'ma bend it down, then I'ma lick her up\nAnd then dick her down, she gon' turn around\nThen I'ma kick her out, she gon' talk that shit but still\nAyy, how you make it up? How you fake a love?\nHoly son, I was the chosen one\nI'm sippin' out the grail, she don't kiss and tell\nShe keep my wishes well, I don't need her, well\nOh, yeah, how my enemy a friend of me?\nWhy y'all feed off of my energy?\nLike I ain't dead yet, higher entity\nForeign bitch that think she into me\nWhip the foreign very viciously\nWhy these dudes wanna take pics with me?\nShe said she gay, but still into me\nShe said she gay, still into me\nSaid she hate that I'm in the streets\nAnd I said I hate that I'm in the streets\nI wanna blow up and make history\nSaid she hate my Insta' feed\n\nXans don't make you\nXans gon' take you\nXans gon' fake you\nAnd Xans gon' betray you\nXans don't make you\nXans gon' take you\nXans gon' fake you\nXans gon' betray you (Yeah, ayy)\n\nAnd her pussy tastes like Skittles, what? Yeah, ayy\nYou can really taste the rainbow, what? Hah, no\nYour bitch just like a Crayola, what? Ayy\nYou can draw her on the table, flip her like some yola\nAyy, heart-shaped kisses, I really miss my mistress\nAnd 666, evil bitches want my mentions\nHeart-shaped kisses, really miss my mistress\nAnd it's 666, evil bitches want my mentions\n\nXans don't make you\nXans gon' take you\nXans gon' fake you\nAnd Xans gon' betray you\nXans don't make you\nXans gon' take you\nXans gon' fake you\nXans gon' betray you\n\nXans gon' fake you\nXans gon' betray you\nXans gon' take you\nXans gon' betray you\nXans gon' take you\nXans gon' take you\nWhat? Ayy, what? Ayy\nXans gon' take\nXans gon' take you\nYeah, Xans gon'\nXans' gon take you\nAyy, Xans gon' take you",
 "image": "https://images.genius.com/f6f7cde34aa67ebcf5b99745bad6684d.1000x1000x1.png"
}