{
 "title": "Drip",
 "album": "Invasion of Privacy",
 "year": "2018-04-04",
 "lyrics": "That boy Cassius!\nCardi!\nN-N-Non-stop\n\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\n\nGive me little something to remember (Cardi!)\nTryna make love in a Sprinter (Yeah)\nQuick to drop a nigga like Kemba (Go)\nLookin' like a right swipe on Tinder (Woo)\nShit on these hoes (Shit)\nLight up my wrist on these hoes (Wrist)\nNow I look down on these bitches (Down)\nI feel like I'm on stilts on these hoes (Woo)\nFuck ya' baby daddy right now (Right now)\nAnna Mae, got cake by the pound (Pound)\nGo down, eat it up, don't drown\nMac n' cheese in the bowl, how it sound? (sound)\nI got that gushy\nYeah that's a fact, but I never been pussy\nI've been that bitch since pajamas with footies\nWon MVP, and I'm still a rookie, like woo\nI gotta work on my anger (Ayy)\nMight kill a bitch with my fingers (Ayy)\nI gotta stay outta Gucci (Woo)\nI'm finna run outta hangers (Woo)\nIs she a stripper, a rapper or a singer?\nI'm busting bucks in a Bentley Bentayga\nRide through your hood like \"Bitch, I'm the mayor!\"\nYou not my bitch, then bitch you in danger\n\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\n\nBitch you a thot, ain't trickin' (Thot, thot)\nPut her on her knee, make her lick it (Lick it)\nPatek on my wrist, and it's glistenin' (Drip, drip)\nThe bitch got mad, I dissed her (Hey)\n\nShawty, you ain't nothin' to a rich nigga (Nothin')\nI'll put a check on a bitch nigga (Brrt)\nFuck your whole set and your clique, nigga (Fuck 'em)\nGot a gang full of dud and some broke niggas (Dud)\nDiamonds on me, what's the price? (Price)\nI'm not gettin' involved with the hype (Hype)\nI'm too rich to get into a fight (Too rich)\n50 racks got my jeans fittin' tight (50 racks)\nPay the price and them boys come and wipe ya' (Wipe ya')\nWe had to dispose of the diaper (Dispose)\nYeah we trap every week, every night (Whoa)\nWord my move, we too smooth, no indictments (Hey)\nYeah, freakazoid lightnin' (Lightnin')\n57 90 in this Breitling (Breit')\nWhen I got a mil I got excited (Million)\nFor the cash I'ma turn to Michael Myers\nBaguettes keep dripping, droppin' (Drip)\nMy wrist all liquid watches (Watch)\nTold the bitch, \"Jump on my dick and pop it\" (Yeah)\nGet a little bitch a deposit (Hey, brrt)\n\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\n\nBitch you a thot, ain't trickin' (Thot, thot)\nPut her on her knee, make her lick it (lick it)\nPatek on my wrist, and it's glistenin' (Uh, drip, drip)\nThe bitch got mad, I dissed her (Hey)\n\nTake-Takeoff\nCame through drippin' (Drippin')\nI ain't never slippin', I'm a pimp (Pimp)\nFuckin' with a quarter million, nigga, what a feelin' (Feelin')\nAbort the mission, nigga, they be tellin' off and squealin' (Squealin')\nSplash, took a bitch to Piccadilly (Splash)\nWater in my ear, gave a nigga wet willy (Wet willy)\nCame through drippin', spillin'\nWalkin' with the bag (Bag)\nTryna get my niggas all a milli, stack it to the ceilin' (Ceilin')\nShootin' at civilians ('villians)\nI'm the one dealin', I could make a killin' (Killin')\nBags, can you smell it when I Vac-seal it? (Uh)\nFlag, nigga, throw it up, don't care about your feelings (Fuck 'em)\nOoh, what is this? What you wearin'? I be drippin' (What)\nCal Ripken's hit a nigga, Ken Griffey (Home run)\nThe bitch got thick, so I guess she ate Jiffy\nWhen she leave with me, I'ma fly her back to the city (For sure)\n\nGo get the bag on the day off (Tacks)\nGo get the rings out the playoffs (Rings)\nPots in the beat, it's a bake off (Packs)\nFuck on her, then she get laid off (Smash)\nBig boy tools, Maaco (Big boy)\nMake a bitch dance with a Draco (Dance)\nWalkin' with the cheese, that queso (Cheese)\nThat's Huncho, fuck the Rodeo (Huncho)\nPrivate jet, we don't do layover (Whew)\nOne call, I'm havin' your bae over (Brrt)\nWalk out the spot with a makeover (Woo)\nGot her addicted to payola (Addicted, hey)\n\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nCame through drippin' (Drip, drip)\nDiamonds on my wrist, they drippin' (Ice!)",
 "image": "https://images.genius.com/e47ff3fe78ea33318962284870b5662c.1000x1000x1.png"
}