{
 "title": "Everyday",
 "album": "Bobby Tarantino II",
 "year": "2018-03-02",
 "lyrics": "Yeah, ayy\n\nI work hard every motherfuckin' day-ay-ay-ayy\nI work hard, I work hard every day-ay-ay-ayy, yeah\nBut today is my day, it's my day\nAnd no matter what they say, it's my day\nLa-la-la-la-la-la, yeah\n\nRoll up to the spot, feelin' real good\nThink you gon' talk shit, you better not, my homies real hood\nThey say, \"Logic, why you do that?\" I don't know, I don't know\nYeah, they used to be like, \"Who that?\" I don't know, I don't know\nNow they know my name wherever I go\nUsed to think that's what I wanted, but now just don't know\nNo, I can't fuck with that, knuck if you buckin' back\nYeah, I been workin' but I ain't get nothin' back\nTell me the dealy now, hold up, wait, really now\nAll of that shit you been talkin' just silly now\n\nJust as quick as you rise\nJust as quick as you could fall\nOh, no, no, no, I can't fuck with that at all\nCan't fuck with that at all\n\nI work hard every motherfuckin' day-ay-ay-ayy\nI work hard, I work hard every day-ay-ay-ayy, yeah\nBut today is my day, it's my day\nAnd no matter what they say, it's my day\nLa-la-la-la-la-la, yeah\n\nAll, all she ever wanted was attention\nAnd a bunch of other shit I shouldn't mention\n'Cause she got daddy issues for days, for days and days\nBut today, she ain't got shit to do\nHer right along with you\nSo we gon' fuck around and vibe, and vibe, and vibe, and vibe\nI'm tryna live my life, but am I doing it right?\nYeah, I'm tryna live my life, but am I doing it right?\n'Cause they tell me I'm the man\nYou the man right now, you the man right now\nWith the whole wide world in the palm of your hand right now\nFuck the lights and the cameras and the money and the fame\nI'ma do it for the fam right now\nI'ma get it for the 301 and the R-A-double-T-P-A-C 'cause you know\n\nI work hard every motherfuckin' day-ay-ay-ayy\nI work hard, I work hard every day-ay-ay-ayy, yeah\nBut today is my day, it's my day\nAnd no matter what they say, it's my day\nLa-la-la-la-la-la, yeah",
 "image": "https://images.genius.com/c021dc75bb454159fc1479531b3b0039.1000x1000x1.jpg"
}