{
 "title": "Medicine",
 "album": "Queen Naija",
 "year": "2017-12-31",
 "lyrics": "30Hertz\n\nYou tell me you love me\nBut I ain't been feeling it lately\nYou say you love keeping me fly but\nCan't keep me from looking' so crazy\nCome in at 6 in the mornin'\nWhere you been, where you been?\nWho is that texting your phone?\nJust a friend, just a friend (okay)\nMy intuition never lies\nThere's nothing you can ever hide\nAlready got the screenshots\nSo there is no need to deny\nYou been creepin' and freakin' and sneakin'\nLike you'll never lose me\nSteady claiming that everyone know we together\nBut you steady choosing\n\nSwear I cannot win for losing\nI been out here being faithful\nI always got this on lockdown\nBut that ain't been keeping us stable\nSo I guess I know what I gotta do\nGive you a taste of your own medicine (hey, yeah)\n\nHow would you like it if I do the things you do?\nPut you on do not disturb and entertain these dudes\nI'ma ride him crazy and you'll never have a clue\nGive another guy everything that belongs to you\nI'ma call up Brian, I'ma FaceTime Ryan\nI'ma text Lorenzo and, I'ma leave you cryin'\nDon't get it twisted I can play this game too\nHow would you like it if I did the same to you (same to you)\n\nYou don't like it\nNow you telling' me that I should fight it\nWhy you be out here playing the victim\nWhen I am the one who been cryin'\nWhy dish it out but can't take it\nI want revenge, I can't fake it\nWanna see the look on your face\nWhen I drop my clothes and I get naked\nNot for you, but for him\nNow tell me player, how does that make you feel?\nHow could you play me when the love I gave was real\nI even took you back and you still had no chill\n\nBoy you ain't gone ever learn\nPlay with fire you get burned\nI don't think you'll understand\nUntil I hit you where it hurts\nSo I guess I know what I gotta do\nGive you a taste of your own medicine\n\nHow would you like it if I do the things you do?\nPut you on do not disturb and entertain these dudes\nI'ma ride him crazy and you'll never have a clue\nGive another guy everything that belongs to you\nI'ma call up Brian, I'ma FaceTime Ryan\nI'ma text Lorenzo, and I'ma leave you cryin'\nDon't get it twisted I can play this game too\nHow would you like it if I did the same to you (same to you)\n\nAll of those tears I cried\nI can't count the lonely nights\nTime and time again I've tried\nSo when I turn into a savage, boy, don't ask me why\nAsk me why, don't ask me why, yeah\nGive you a taste of your own medicine",
 "image": "https://images.genius.com/d6a6032f00c122c0fc7843cdfb4bf8f2.500x500x1.jpg"
}