{
 "title": "PICK IT UP",
 "album": "Dex Meets Dexter",
 "year": "2017-10-18",
 "lyrics": "Hey yo, big bro, you fucking with that?\nHa, okay cool\nGood job, 1st\nThat's my fucking brother right there, ya dig?\nDexter, ooh, wait (Yeah, a-what)\n\nPick it up, pick it up, pick it up, groove\nBaby girl watch how you move (What)\nI got them Vans on my shoes, ooh (I do)\nI pop a pill and I lose \nweight\nSpeed it up (Speed)\nLook at them diamonds, they eat it up (Eat)\nGot me two bitches, I eat it up (You what?)\nThey thinkin' of wifing, deleting them (Yeah)\nA-wait, ooh (Dexter) pints in, call up Rocket, ooh (A-what)\nMy brother plug like a socket, ooh\nKick in this door, yeah I got it (Yeah)\nOpen the safe, you can't lock it, ooh (A-what)\nSipping that Wock, yeah I go to the top\nBuss on yo bitch like a Glock, ooh\nShe like to suck on my clock, ooh (Yeah)\nI get the money, don't stop, Dexter!\n\nHah, ya know what I'm saying?\nLike I, I, I know you like this beat too\nBut you a fucking goofy though (Fucking lame ass nigga)\nA-wait, ooh\n\nWord around, word around, word around town (Bitch)\nI heard this boy was a clown, ooh (Was a clown)\nSwim in yo bitch once I drown, ooh (I do)\nCalling my plug for the pound, wait\nOdd Future, yeah it's right on my clothes\nBad bitch, yeah I watch her do coke (What)\nBroke as hell, I used to sleep on the floor\nI never do it no more, ooh (A-what)\nTellin' you broke it's no joke, ooh\nI used to kick in that door (Kick in that door)\nWait, now I'm selling out them shows\nOne on my wrist, Fendi right on my clothes, huh (What)\nHold on lil' mama you tweakin' (Baby, you tweakin')\nA bad bitch, Puerto Rican (Puerto Rican, what)\nI get her off molly, she geeking\nCall up your friends, we'll be set for the weekend\nDexter!\n\nYa know what I'm sayin? Like, no no no\nWe can only chill for a weekend then you gotta go\nTell your friend too\nI'm one of the prettiest motherfuckers you’ve ever seen\nA-Dexter\n\nOrder VLONE, color orange mango label\nRotary phone (Whoo) in my old school Mercedes\nSmoke OG Grown (Whoo) when I'm Californicating\nI got three phones, business, conversation, and relation\nHol' up, wait a sec', wait a min', wait a tic\nJacob my wrist, nothing was fake on my wrist\nFour finger ring on my hand\nSay what you say to my wrist, talk to the hand\nDon't wanna resort to the hands\nWhat the face say to the fist? (\nI'm Rick James, bitch!\n)\n\nHah, funny as shit, a fifth of the tab\nSuck on her tits, go back to the pad\nWatched \"Dexter's Lab\" on the 'Flix\n\nUhh, speed it up, speed it up, speed it up (Ah)\nJust did this track then I beat it up (Ah)\nAcne, my jacket from Sweden (Huh)\nMy chicks don't exactly know English (What?)\nThey ain't about that action of no beefing, ahh\nI might as well go back to vegan (Um)\nMy shit might go platinum first week (Uh)\nPlay this shit back and repeat it (Uh)\nWord around, word of mouth, word around town\nYou the one doin' all the murder 'round town\nPullin' up, shootin', leave the burner downtown\nShoot it like the birdy 'cause they all fly south\nWhippin', I'm whippin', I'm whippin' the wrists\nI'm fucking your bitch and I'm up in your fridge\nI only tell stories of tuckin' in kids\nSo how in the fuck can they fuck with the kid?\n\nHah, funny as shit, I was missing a bit\nI'm back in my bag, back to the pad\nWatched \"Dexter's Lab\" on the 'Flix\nGood job, 1st",
 "image": "https://images.genius.com/b45defbd263cc5cec76ad897f17a81e1.928x928x1.png"
}