{
 "title": "Plug Walk",
 "album": "The World Is Yours",
 "year": "2018-02-08",
 "lyrics": "Ayy, ayy (\nTheLabCook\n)\n\nPlug walk (plug walk, plug, plug)\nI don't even understand how the fuck my plug talk\n(Huh? what, what?)\nPick him up in a space coupe, I don't let my plug walk\n(Skrrt, pull up in a space coupe)\nNew freak, had to cut my other lil' bitch off (ooh, ooh, lil' bitch)\n50K, you could come and book a nigga for a plug walk\n\nYou can't reach me (what?)\nSpace coupe like E.T. (E.T.)\nIt's the plug tryna call me (skrrt, skrrt)\nI was up trappin' early in the morning (plug)\nOoh, on the wave like a durag (durag)\nPussy nigga callin' for his boo back (pussy)\nPlug walk, Gucci on my shoe racks (Gucci)\nWalk up in the house, where the stove at? (hit a rat-a-tat)\n'Til I ran into the plug ('til I ran into)\n \n'til I ran into the mud (to the mud)\nI done ran into some racks, I done ran into your girl ( 'to your girl)\nWhy the plug show me love? (Show me love)\nI done came up from a dub (huh?)\n\nPlug walk (plug walk, plug, plug)\nI don't even understand how the fuck my plug talk\n(Huh? what, what?)\nPick him up in a space coupe, I don't let my plug walk\n(Skrrt, pull up in a space coupe)\nNew freak, had to cut my other lil' bitch off (ooh, ooh, lil' bitch)\n50K, you could come and book a nigga for a plug walk\n\nBig ol' Bentley, it's a spaceship (woah)\nCall me on my phone, I don't say shit (what?)\nI make money when I talk (when I talk)\nI'm a boss, take a loss (I'm a what?)\nI could introduce you to the plug (to the plug)\nBitch, this ain't no Henny in my cup (lil' bitch)\nStayed down, now the racks up (racks up)\nShe gon' let me fuck, ass up\n (ass up)\nPlug, I stuck kis in the Louis V (Louis V)\nFuck 12, I’m a G, ain't no stoppin' me (ain't no stoppin' me)\nAnd my wrist is on overseas (drip)\nRich nigga, you can't talk to me (rich)\n\nAyy, plug walk (plug walk, plug, plug)\nI don't even understand how the fuck my plug talk\n(Huh? what, what?)\nPick him up in a space coupe, I don't let my plug walk\n(Skrrt, pull up in a space coupe)\nNew freak, had to cut my other lil' bitch off (ooh, ooh, lil' bitch)\n50K, you could come and book a nigga for a plug walk",
 "image": "https://images.genius.com/e661fffce978e015660f7c8c5d37d489.500x500x1.jpg"
}