{
 "title": "Buddy",
 "album": "3 Feet High and Rising",
 "year": "1989-03-14",
 "lyrics": "[Intro: Dove + \nQ-Tip\n]\nHello\nMeany, meany, meany, meany (\nSay what?\n)\nMeany, meany, meany, meany (\nSay what?\n)\nMeany, meany, meany, meany, mean\nYou gotta do that again, Dove\nMeany, meany, meany, meany (\nSay what?\n)\nMeany, meany, meany, meany (\nSay what?\n)\nMeany, meany, meany, meany, mean (\nOkay\n)\n\nHello it's the Soul\nTroopin' in wit the Jungle patrol\nAnd this one's about the KO's, the knockouts out there\nWho's holdin' my buddy\nHold up (Wait a minute)\n\nNow just wait\nWe're gonna talk about Buddy on this plate\nBut before we let the herd out the gate\nMake sure the all the levels are straight out the jungle\n(The Jungle, the Brothers, the Brothers)\n\nDe La Soul, from the soul\nBlack medallions, no gold\nHangin' out wit Pos, hangin' out wit Mase\nBuddy buddy buddy all in my face\n\nFor the lap, Jimbrowski must wear a cap\nJust in case the young girl likes to clap\nAin't for the wind but before I begin\nI'll initiate the buddy with a slap\n\nNow for the next\nI'm the Q-Tip from A Tribe Called Quest\nAnd when I quest for the buddy I don't fess\nFor my jimmy wants nothin' but the best (the best)\nThe best (ooh wee!)\nLet's stick out jimmy and see what we can catch\n(Stick em up, stick em up jimmy)\nNets won't be needed unless\n(Jenny wanna get right to the flesh)\n(Sweet little woman, sweet little woman)\n\nI won't lie, I love B-U-D-D-Y (why)\n'Cause I never let it walk on by\nWhen it comes to me and Jenny I seem\n(Very serious) like a Peek Freen\nBuddy is the act that occurs on the lift\nWhen Jenny and jimmy start shootin' the gift\nBoy let me get shot I won't even riff\n\nBuddy buddy, don't you know you make me go nutty\nI'm so glad that you're not a fuddy duddy\nNot too skinny and not too chubby\nSoft like Silly Putty\nMiss Crabtree\n, I hope that you're not mad at me\n'Cause I told you that it was your buddy\nThat was making me ever so horny\nJunglelistically horny\n\nOn the dial my buddy talks to me for a while\nPlug Two is the (Q-Tip: Q to her Tip)\nOn the A side or sometimes the flip\n(Never gonna flip this record)\nBuddy is the bud to my daisy tree\nAnd the Luden to my do-re-mi\nAnd the pleaser to my man Plug 3\n(Plug 3 gets all the buddy)\n\nBehind my bush, my buddy likes the way that I push\nAnd like a champ just knock it on out\nNever ever once sellin' out\n(Or let loose the juice)\nMy buddy helps me to\n(De La my Soul)\nKeepin' jimmy in total control\nWithout Jimmy I'd be on a roll\n(La la la l-la la la la, la la la l-la la la la)\n\nHey girl I heard ya lookin' for some good times\nIf you Quest from the Soul, here's what we'll find\nA whole lot of fun, lots of fun together\nJust like kissin' cousins (yeah that's kinda clever)\nClose like bosoms, bosoms stay close\nIf you be my buddy, I will boast\nThat we're like \nEthel Mertz and Lucille MacGillicuddy\nYou can be mine and I can be your buddy\n\nThe best buddy's in evening wear\nLong lovin' lets Tru know (he's in there)\nI feel sorry for those who pay a fare (a fee) word to the D\nI don't beg I just tease my buddy with my right leg\nAnd when it's ready what's said is buddy is best in bed\n(Word)\n\nFly buddy told us all to get into a circle\nSaid don't worry cause I won't hurt you\nAll I really wanna do is freak you (she freaked us)\n\nAnd I watched and then I checked my Swatch\nTo see the time\nThe Soul had formed a buddy line\nAnd that buddy was (mine all mine)\n\nNow when Tribe, the Jungle, and De La Soul\nIs at the clubs our ritual unfolds\nGrab our bones and start swingin' our hands\n(Then Jenny start flockin' in every brand)\n'Cause Jenifa just wants to stay aware\nYo fellas, should we keep her aware?\n(Mmm Hmm, yeah!)",
 "image": "https://images.rapgenius.com/122b88d714dbe8909502a6d7af7a2e94.448x450x1.jpg"
}