{
 "title": "Girls Nite Out",
 "album": "Girls Nite Out",
 "year": null,
 "lyrics": "Get up!\nOw!\nNa, na, na, na, na, na\nWe're sick and tired of being left at home\nWhile the boys go out and leave us all alone.  Yeah\nI wanna go out with my girlfriends and party all night\nAnd this time you won't change my mind\n'Cause I've got my mind made up\nSo don't wait up for me\nIt's the girls' nite out, na, na, nite out\nAnd there's nothing you can say, baby\nIt's the girls' nite to play, our nite to play\nSo don't wait up for me\nNa, na, na, na, na, na\nWe're stepping out and we're leaving our troubles behind\nYeah, oh yeah\nI've got the girls and we've only got one thing on our mind\n(Where are we going tonight?) Oh, oh\nThe time is right, so are you ready to party all night?\nAnd this time I'm leaving you behind\n'Cause I've got my mind made up\nSo don't wait up for me\nIt's the girls' nite out, na, na, nite out\nAnd there's nothing you can say, baby\nIt's the girls' nite to play, our nite to play\nSo don't wait up for me\nGet up!\nGo!  Go!  Go!  Go!  Go!  Go!  Go!\nGet up!\nGo!  Go!  Go!  Go!  Go!  Go!  Go!\nGet up!\n(Go!  Go!  Go!  Go!  Go!  Go!  Go!) I like to party\nGet up!\n(Go!  Go!  Go!  Go!  Go!  Go!  Go!) I'm outta here\nNa, na, na, na, na, na, na, na\nNa, na, na, na, na, na, na, na\nNa, na, na, na, na, na, na, na\nNa, na, na, na, na, na, na, na.  Ow!\nNa, na, na, na, na, na, na, na\nNa, na, na, na, na, na, na, na. Na, na\nNa, na, na, na, na, na, na, na.  Na, na\nNa, na, na, na, na, na, na, na.  Bridge\nThe time has come for the boys to realize\nThat it's our turn to have some fun\nAnd it's gonna be tonight\nIt's the girls' nite out, na, na, nite out\nOh, oooh, oh, oooh, oh, yeah\nIt's the girls' nite to play, our nite to play\nIt's the girls' nite out, na, na, nite out\nThere's nothing you can say, baby\n(It's the girls' nite to play,) Oh, oh\n(Our nite to play.) Oh, oh, oh, oh, oh, oh\n(It's the girls' nite out,) Oh, oh.  Oh, oh, oh, oh, oh, oh\n(na, na, nite out.)\nThere's nothing you can say, baby",
 "image": "https://images.genius.com/3a37d2aaef6bbdf2e210da82e74e92fe.300x300x1.jpg"
}