{
 "title": "Black and Blue",
 "album": "Batman v Superman: Dawn of Justice",
 "year": null,
 "lyrics": "Cut to: GOTHAM ROOFTOP\nThe armored Batman stands in the rain, the Batsignal glowing in the sky above him.\nCut to: DAILY PLANET\nLOIS LANE\nI need a chopper to Gotham. Call the heliport.\nPERRY WHITE\nChopper? We can barely afford a bicycle. You want to chase a story? Go to the ship. Superman's probably there already.\nLOIS LANE\nPerry, it's not for a story.\nPerry and Lois stare at each other for a while.\nPERRY WHITE\nJenny, get her a chopper to Gotham. And forget the heliport, put her on the god damn roof. On the roof, Lois!\nCut to: DAILY PLANET ROOFTOP\nLois imbarks on the helicopter.\nPILOT\nWhere're we headed?\nShe points to the Bat-Signal.\nLOIS LANE\nThere!\nCut to: GOTHAM ROOFTOP\nBatman’s wait is over as Superman is gliding above him. He lands with a loud thud on the ground.\nBATMAN\nWell. Here I am.\nSUPERMAN\nBruce, please.\nSuperman starts walking towards him.\nSUPERMAN\nI was wrong. You have to listen to me. Lex wants us...\nSuperman eventually triggers a trap, with two loudspeakers playing high-frequency noises at him.\n He winces in pain, but eventually takes a manhole cover from the ground, rips it in half, and throws each part at the speakers. He stands to recover, and then continues his walk. Batman decides to go for him as well.\nSUPERMAN\nYou don't understand. There's no time!\nBatman comes face to face with Superman.\nBATMAN\nI understand.\nSuperman pushes Batman with one hand, making him fly a high distance. Batman groans before starting to rise up again. When Superman takes another step, he triggers another trap, \nwith gatling guns that fire with tremendous force, pushing him backwards\n before he decides to fly and use his heat vision to destroy the trap.\nBatman is now upright again, and watches Superman walking along the flames of the destroyed traps. He then fly-tackles Batman into a nearby building, and tosses him onto the Bat-Signal. Batman breaks the roof’s ledge, but is still conscious and begins to rise again as Superman lands again and walks towards Batman.\nSUPERMAN\nStay down! If I wanted it,you'd be dead already!\nBatman unpins and throws a smoke grenade. Superman flies through the smoke, but doesn’t see Batman, who is now behind him with a shotgun of sorts. He fires a bullet, \nSuperman catches it, and the cartridge explodes, exhuding Kryptonite gas\n. Superman loses his breath and falls to his knees, contorting in pain. Batman puts the gun down, and stares down his weakened opponent.\nBATMAN\nBreathe in. That's fear. You're not brave.\nSuperman tries punching Batman, who manages to block the fist with his arm.\nBATMAN\nMen are brave.\nAgain, Superman punches and is countered, twice. Then Batman headbutts him, throws punches – some of whom are blocked – and kicks him in the gut, before hitting Superman in the throat and kicking him onto a nearby glass ceiling. \nBatman then jumps on his opponent, landing feet-first on his stomach and pushing both into the abandoned building.\n When they land, Superman groans in pain. Batman then kicks Superman away, kicks him in the face, and lands some punches before grabbing him by the neck and bashing his head against the wall, before delivering more punches and a headbutt. Superman stares, feeling his strength returning, and catches Batman’s leg as he tries another kick. He then throws Batman through a nearby wall, and gets up. Both heroes run towards one another, with Batman grappling his opponent and pushing him against a wall. He delivers punches to the face, but after the fourth, the sound is similar to hitting a steel pillar… and with Superman barely flinching. Batman realizes what happened, Superman nods in disapproval, and after rising from the ground tackles Batman, breaking them onto the lower floor. He throws Batman onto some bathroom stalls, and prepares to jump onto his opponent again, who grabs his shotgun and fires another Kryptonite dust shell on Superman – but not before the hit connects, throwing Batman onto the other room and partially breaking his mask. Superman still writhes in pain as \nBatman takes a kitchen sink from a wall and bashes it onto Superman’s head.\n Batman grabs his seemingly unconscious opponent by the head, and carries Superman on his shoulder before the summit of a round staircase, and throws Superman through the newel. He crash-lands on the ground floor. Batman uses his grappling gun to land softly afterwards. After recoiling the grappling hook, he lassoes it onto Superman’s foot and drags his opponent along, closer to where the Kryptonite spear is.\nBATMAN\nI bet your parents taught you, that you mean something. That you're here for a reason. My parents taught me a different lesson. Dying in the gutter. For no reason at all.\nAs Superman appears awakened and ready to get up, Batman fires the hook and throws him around the room, breaking various pillars.\nBATMAN\nThey taught me the world only makes sense, if you force it to.\nBatman removes the spear from the ground and approaches Superman.\nOutside, Lois’s helicopter lands, and she rushes towards the building\nBatman now stands above Superman.\nBATMAN\nYou were never a god.  You are never even a man.\nBatman slices a cut through Superman’s face, making him bleed.\n As he prepares to impale his opponent’s head, Superman gathers enough strength to talk.\nSUPERMAN\nYou're letting him... kill \nMartha.\nBATMAN\nWhat does that mean? Why did you say that name?\nSUPERMAN\nFind him! Save...Martha.\nBATMAN\nMartha.\nBatman has a flashback to the tomb reading \"MARTHA WAYNE 1946 – 1981” and the murder of his parents\nTHOMAS WAYNE\nMartha.\nBATMAN\nWHY DID YOU SAY THAT NAME?\nSUPERMAN\nMartha!\nBATMAN\nWhy did you say that name?\nLois has entered the room, and runs towards the downed Clark.\nLOIS LANE\nClark! Stop! Please! Stop!\nBATMAN\nWhy did you say that name?\nLOIS LANE\nIt's his mother's name. It's his mother's name.\nBatman takes his foot off Superman, thinks for a while and then angrily throws the spear away.\nCut to Outside Kryptonian ship\nLightning is coming from the sarcophagus as a news crew is gathered near the military barrier.\nREPORTER\nWe're no getting any answers. We're stil right outside the containment center. A dangerous situation.Military and police personnel surrounding the area.\nCut to WAREHOUSE\nAnatoli readies a flamethrower as Martha Kent watches. The digital clock on the table has just passed 10 minutes.\nCut to Gotham Building\nSuperman is rising again.\nSUPERMAN\nLuthor. He wanted your life for hers. She's losing time.\nLOIS LANE\nThe scout ship seems to be drawing power from the city. It's got to be Lex.\nBATMAN\nThey need you at that ship. I'll find her.\nSUPERMAN\nMy mother needs me.\nAs Superman tries walking away, Batman holds him by the chest.\nBATMAN\nWait! I'll make you a promise. \nMartha won't die tonight.\nBoth men nod approvingly. Lois puts her hand on Clark’s neck, and he nods before flying away.",
 "image": "https://images.rapgenius.com/7e20da0ba93fb92f26d127d2ed0f31fe.1000x625x1.jpg"
}