{
 "title": "Gyrlz, They Love Me",
 "album": "Big Tyme",
 "year": "1989-06-12",
 "lyrics": "(Cause he's The Overweight Lover Heavy D!)\n\nCoolin in my crib and I'm cold, maxin\nCall up a cutie, I'm in the mood for relaxin\nGet my phone book from, top o' the shelf\nI'll dial 66 - hm, I better keep it to myself\nCall up a cutie with a triple star next to it\nShe says, \"Hello, \" we con-versate a bit\nInvite her over for a candlelight dinner\nBelieve me when I tell you that this girlie is a winner\nShortly after that, I hear the doorbell ring\nTurn on the radio, Anita Baker starts to sing\nOpen up the door and I kiss her on the cheek\nShe's so nice, polite, petite, so sweet\nSit her on the couch and uh, remove her coat\nSquat next to her, *ahem* clear my throat\nWhisper in her ear, told her what she wants to hear\nLet her know that, \"Have no fear - Heavy D.'s here\"\nAnd...\n\nGyrlz they, gyrlz they love me\n(Cause he's The Overweight Lover Heavy D!)\nGyrlz they, gyrlz they love me\n(Cause he's The Overweight Lover Heavy D!)\n\nTake my hand, walk with me\nI'm the imperial, Overweight Lover MC Heavy D\nNow that I've introduced myself correctly\nDo you have a moment to spend some time with me?\nWould you like a drink, maybe a Piña, Colada\nA strawberry Daiquiri, a wine from Havana\nIt really doesn't matter, the choice is yours\nAnd when you're through with your drink, we'll take a walk out-doors\nGazed at the stars, walked down the boardwalk\nSit by the beach and talk lover's talk\nMake a quick call on my cellular phone\nSome type of limousine to pick us up and take us home\nAhh! - an enjoyable night\nThe mood was smooth and everything was alright\nIt may be hard for you, but it's easy for me\nCause girls, the girls, the girls, THEY LOVE ME!\n\n \"Funky! \"\n\nMe, Glenn, and Troy went to a disco (word)\nPete Rock and CL Smooth was on stage drinkin Cisco\nDamien had his girl Michelle (of course!)\nCraig Boogie had a girl that I never seen before\nEddie F. was home makin a beat \nMick T. was at the crib on a hundred and twenty-two street (chillin)\nTootie had a cutie that was dope (Damn!)\nGroovy Lou, Quan, and Little Dow was crackin jokes (YOU BIG!)\nGrapp had the dancefloor packed (GO, GO, GO)\nJoe Black was in the corner lookin meanie when he {? }\nTommy, George, Jeff and Butta was on the spot\nBuyin champagne from the crew a hundred dollars a pop!\nMe, I was casin the joint\nClockin all the people as they stared and point\nIt feels really good to be Heavy D\nBecause the girls, the girls, they LOVE me!\n\nGyrlz they, gyrlz they love me...\n\n(Cause he's The Overweight Lover Heavy D!)",
 "image": "https://images.genius.com/a6c97d6ebc7f1131c0d1977ccb7f1926.600x588x1.jpg"
}