{
 "title": "4 the Lord",
 "album": "Flydays",
 "year": "2020-11-11",
 "lyrics": "You know what it's like?\nYou know what it's like to be big man on campus?\nYou know what this- you know what that's like?\nThe big man on campus all my life\nYou know what it's like to have all the l-, all the fly bitches lookin' at you wherever-, every-, every-\n\nIt's Lord Taylor, voice of the fly niggas\nLast time I saw your girl she touched it like , stay\nFocused on your own, don't worry my niggas, 'cause\nWe lettin' the hoes disrupt the flow of our figures, uh\nEatin' steaks over Benihana plates\nDiscussions on real estate and how to stack this cake\nI see, a opportunity, I wait then I take\nMy foot on thе gas, and no brakes\nTrust me I make no mistakеs\nAnd my last girl mad 'cause I had to dismiss her\nNew chick so bad they ask if she got a sister\nI don't kiss and tell, I just wish 'em well\nAfter I fuck 'em, leave 'em seein' mad wishin' wells\nIt's whatever though, that's just the way the weather blows\nThrough her curly 'fro while Lalah Hathaway sings \"Heaven Knows\"\nThis that New York City rap, play it 'fore\nI hit the train station just to give out hunnids to the sax players\nI felt the jazz like Utah, Salt Lake City do you miss me?\nI'm in that S550, please be\nGenuine when you approach us in the crib\nItalian leather sofa, CG got the Rover\nI don't go back and forth, I just, clap the toast\nAnd I mack your hoes, then I go back to flowin'\nAin't no stoppin' the champagne from poppin'\nThe drawers from droppin', the whores from watchin'\nVersace silk button ups from the 1992 Spring collection just in time to fuck the summer up\nA lot of niggas tryna compete with the V boys, they just some runner ups\nThey know they can't fuck with us, truth is they look up to us, what's up with them\n[Outro (\nLord Taylor\n)]\nYou know what it's like to have all the l-, all the fly bitches (\nYeah\n) lookin' at you wherever-, every-, everywhere you go, my nigga?\nYou know-, you know what it's like?\nShe'll do anything for the lord\nCan ask and she'll do anything for the lord\nHer friends, they'll do anything for the lord\nGet in the Benz and do anything for the lord\n(For the lord, for the lord, for the lord)\nUh, lord\nThese niggas don't know what that's like (that's like, that's like) (\nLord, lord\n)",
 "image": "https://images.genius.com/34ca2b2a92d9431aa4c543e66ccca146.680x680x1.jpg"
}