{
 "title": "Foh",
 "album": null,
 "year": null,
 "lyrics": "Disclaimer: For all Bar for Bar threads, we are ignoring all politics and focusing only on how they rap. Influence, discographies, sales, beats, etc. should be ignored. We’re focusing solely on RAP PERFORMANCE\nPlease also remember that the verses posted are not the only verses being compared. All the verses in all of these verses are being compared however some verses are posted over others in order to save space, show the highlights, and other reasons. For songs you are not familiar with please look at all the lyrics which is linked in each comparison while also watching/listening to the song/video that is also posted\nBoth are considered to be the among the best white emcees of all time and some of the biggest lyrical heavyweights in the rap game period. Both seem to have their softer and more heartfelt moments while they can also get wild and crazy. In order to properly compare the two lets compare songs of both emcees catalogs in the following categories\nTechnical Lyrical Abiltiy: Generally in music lyricism is the ability to write lyrics for a song and convey a message, story, and etc.. However, in the context of hip hop discussions we will limit technical lyrical ability to mean the way an emcee rhymes. Their utilization of multiple complex rhyming techniques such as intricate rhyme schemes, multisyallble rhymes, internal rhymes, and etc… Things such as storytelling, song writing, content and other things usually associated with the word lyricism or lyricist in music generally will be analyzed in other categories. This is strictly the technical side of rhymes\nStorytelling: This category will strictly analyze the way the emcees convey a story, while keeping in mind the uniqness and intricacies of the story plot themselves along with the way the artist conveys the story by utilizing poetic devices such as vivid imagery, and etc…\nSocially Conscious/Content: A lot of emcees could rap very technical, however technicality is not the only thing when it comes to rap. This category will focus on what the emcee is saying and comparing the emcees most substantive and socially conscious songs, which includes songs with a message along with commentary on social issues, history, politics, religion, and etc…\nQuotables/Punchlines: This category will compare the best individual lines of the emcees. The lines will be a mixture of\n1. Punchlines, which is typiucally a line that is humorous, clever, witty, and uses wordplay or something along these lines\n2. Quotables, which is a line that is not necessarily witty but is.. quotable. For example nas saying “I never sleep, because sleep is the cousin of death” is an example of a hard hitting quotable. It could be some type of law of wisdom that is timeless and never get’s old. Jadakiss has SOO many of these with a broad example when he said: “And you know they say that you deserved it whenever you die with your eyes open”\nA good mixture that oscillates between the two would be a test of their wittiness, wordplay, and even substance\nTechnical Lyrical Abiltiy 1\nRap God vs Definition of a rap flow\nHttp://genius.com/Eminem-rap-god-lyrics\nHttp://genius.com/Ra-the-rugged-man-definition-of-a-rap-flow-lyrics\nRap God: I will only post the longest and highlight verse of the song to save space but we are comparing all the verses in each of the songs\nHttps://www.youtube.com/watch?v=XbGs_qK2PQA\nCause I'm beginnin' to feel like a Rap God, Rap God\nAll my people from the front to the back nod, back nod\nThe way I'm racing around the track, call me NASCAR, NASCAR\nDale Earnhardt of the trailer park, the White Trash God\nKneel before General Zod this planet's Krypton No Asgard, Asgard\nSo you be Thor and I'll be Odin, you rodent, I'm omnipotent\nLet off then I'm reloading immediately with these bombs I'm toting\nAnd I should not be woken\nI'm the walking dead\nBut I'm just a talking head, a zombie floating\nBut I got your mom deep throating\nI'm out my Ramen Noodle\nWe have nothing in common, poodle\nI'm a doberman, pinch yourself in the arm and pay homage, pupil\nIt's me\nMy honesty's brutal\nBut it's honestly futile if I don't utilize what I do though\nFor good at least once in a while\nSo I wanna make sure somewhere\nIn this chicken scratch I scribble and doodle\nEnough rhymes to\nMaybe try to help get some people through tough times\nBut I gotta keep a few punchlines\nJust in case cause even you unsigned\nRappers are hungry looking at me like it's lunchtime\nI know there was a time where once I, was king of the underground\nBut I still rap like I'm on my Pharoahe Monch grind\nSo I crunch rhymes, but sometimes when you combine\nAppeal with the skin color of mine\nYou get too big and here they come trying to censor you like that one line\nI said on \"I'm Back\" from the Mathers LP 1\nWhen I tried to say\n\"I'll take seven kids from Columbine\nPut 'em all in a line, add an AK-47, a revolver and a nine\"\nSee if I get away with it now that I ain't as big as I was but I'm\nMorphin' into an immortal\nComing through the portal\nYou're stuck in a time warp from 2004, though\nAnd I don't know what the fuck that you rhyme for\nYou're pointless as Rapunzel with fucking\nCornrows\nYou write normal? Fuck being normal\nAnd I just bought a new raygun from the future\nJust to come and shoot ya, like when Fabolous made Ray J mad\nCause Fab said he looked like a fag at Mayweather's pad\nSinging to a man while they played piano\nMan, oh man, that was a 24/7 special on the cable channel\nSo Ray J went straight to the radio station\nThe very next day, \"Hey Fab, I'ma kill you!\"\nLyrics coming at you at supersonic speed (J.J. Fad)\nUh, summa-lumma, dooma-lumma, you assuming I'm a human\nWhat I gotta do to get it through to you? I'm superhuman\nInnovative and I'm made of rubber\nSo that anything you say is ricocheting off of me and it'll glue to you and\nI'm devastating, more than ever demonstrating\nHow to give a mothafuckin' audience a feeling like it's levitating\nNever fading, and I know the haters are forever waiting\nFor the day that they can say I fell off, they'll be celebrating\nCause I know the way to get 'em motivated\nI make elevating music, you make elevator music\n\"Oh, he's too mainstream\"\nWell, that's what they do when they get jealous, they confuse it\n\"It's not hip-hop, it's pop\"\nCause I found a, hella way to fuse it\nWith rock, shock rap with Doc\nThrow on \"Lose Yourself\" and make 'em lose it\n\"I don't know how to make songs like that\nI don't know what words to use\"\nLet me know when it occurs to you\nWhile I'm ripping any one of these verses that versus you\nIt's curtains, I'm inadvertently hurting you\nHow many verses I gotta murder to\nProve that if you were half as nice\nYour songs you could sacrifice virgins too?\nUngh, school flunky, pill junkie\nBut look at the accolades, these skills brung me\nFull of myself, but still hungry\nI bully myself cause I make me do what I put my mind to\nAnd I'm a million leagues above you\nIll when I speak in tongues\nBut it's still tongue-in-cheek, fuck you\nI'm drunk so Satan take the fucking wheel\nI'm asleep in the front seat\nBumping Heavy D and the Boyz\nStill \"Chunky but Funky\"\nBut in my head there's something I can feel tugging and struggling\nAngels fight with devils and here's what they want from me\nThey're asking me to eliminate some of the women hate\nBut if you take into consideration the bitter hatred I have\nThen you may be a little patient and more sympathetic\nTo the situation and understand the discrimination\nBut fuck it\nLife's handing you lemons, make lemonade then\nBut if I can't batter the women\nHow the fuck am I supposed to bake them a cake then?\nDon't mistake him for Satan\nIt's a fatal mistake\nIf you think I need to be overseas and take a vacation\nTo trip abroad\nAnd make her fall on her face and don't be a retard\nBe a king? Think not\nWhy be a king when you can be a God?\nDefinition of a Rap Flow- RA the rugged man\nHttps://www.youtube.com/watch?v=VGiwITaso_g&nohtml5=False\nRugged Man's flow is uglier than blind dates\nMy mental is heavy like Heavy D & Chubb Rock combined weights\nI love myself, I'm so vain\nI'm not just the king of New York, I'm the king of the whole game\nPutting rappers in hibernation, they're hiding away\nFor retirement they're racing, it's funny, like a pie in the face\nAnd devastating, made a mistake\nAnd you're waiting, debating, facing your fate\nAnd creating, hating, raping, imitating, the great\nAnd break in your place and taking your safe and taking your paper\nPaying for faking, this is history in the making, but wait\nSpit at the cops, I'm resisting arrest\nThey wanna see me fry like a chicken wing and a breast\nThe truth is, behind closed doors I’m a bit of a sissy\nSinging love ballads to bitches like Lionel Richie\nNo joking, bragging and boasting hoping to get close and approach 'em\nPoke 'em, perking, and posing, putting poison in the potion\nCooking the coke and cutting your throat, any opponent opposing\nLeave you float in the ocean\nYou was Aaliyah rocking the boat and\nLeaving ya broken, get Smokey to second that emotion\nExplosion of flowing, overdosing, the chosen has spoken, sing!\nHellbound vs Supa\nHttp://genius.com/Eminem-hellbound-lyrics\nHttp://genius.com/Ra-the-rugged-man-supa-lyrics\nHellbound- Eminem\nHttps://www.youtube.com/watch?v=cvDqKwktOpY\nYo.. I'll fuckin.. I'll.. I'll puke, eat it, and freak you\nBattle? I'm too weeded to speak to\nThe only key that I see to defeat you\nWould be for me to remove these two Adidas and beat you\nAnd force feed you 'em both, and on each feet is a cleat shoe\nI'll lift you off your feet so fast with a roundhouse\nYou'll think I pulled the fucking ground out from underneath you\n(Bitch!) I ain't no fucking G, I'm a cannibal\nI ain't tryin to shoot you\nI'm tryin to chop you into pieces and eat you\nWrap you in rope and plastic, stab you with broken glass\nAnd have you with open gashes strapped to a soakin mattress\nCoke and acid, black magic, cloaks and daggers\nFuck the planet, 'til it spins on a broken axis\nI'm so bananas I'm showin up to your open casket\nTo fill it full of explosive gasses and close it back\nWith a lit match in it while I sit back and just hope it catches\nBlow you to fragments, laugh, roll you and smoke the ashes\nSupa- Ra the rugged man\nHttps://www.youtube.com/watch?v=gvlgid_2mK4\nI used to sneak in windows and steal Nintendos\nPimp hoes, white mandingos, I wear black, I don't wear pink clothes\nSuffolk county anything goes\nWhy you trying to copy my shit like Kinkos?\nI drop brickloads, sick flows, I done did those\nHit hoes, ripped shows, quotables kicked those\nAll the criminal shit and the sinning\nThey wanna know do I have a religion\nIs there a god, do I believe in him?\nOh yes, how the fuck else could I be so blessed?\nGod put me on this earth to be one of the best (of all time)\nAnd don't question it, it's a definite\nThe all time best in it, kept in it, repping it\nThe last one left in it\nI'm A plus, you get a F in it\nNegative, pessimist, effortless\nCaucasoid, leporacy, lepedist, method in repping this\nFresher, so fresh in this, catching the specialist\nI'm ol' D, special K, treacherous, I'm supaaa\nRenagade vs And God Said to Cain\nHttp://genius.com/Jay-z-renagade-lyrics\nHttp://genius.com/Jedi-mind-tricks-and-god-said-to-cain-lyrics\nRenegade- Eminem\nHttps://www.youtube.com/watch?v=0jmVU2OOcgU&nohtml5=False\nSince I'm in a position to talk to these kids and they listen\nI ain't no politician but I'll kick it with em a minute\nCause, see, they call me a menace and if the shoe fits I'll wear it\nBut if it don't, then y'all'll swallow the truth, grin and bear it\nNow who's the king of these rude, ludicrous, lucrative lyrics\nWho could inherit the title, put the youth in hysterics\nUsing his music to steer it, sharing his views and his merits\nBut there's a huge interference: they're saying you shouldn't hear it\nMaybe it's hatred I spew, maybe it's food for the spirit\nMaybe it's beautiful music I made for you to just cherish\nBut I'm debated, disputed, hated and viewed in America\nAs a motherfuckin' drug addict, like you didn't experiment, nah nah\nThat's when you start to stare at who's in the mirror\nAnd see yourself as a kid again, and you get embarrassed\nAnd I got nothing to do but make you look stupid as parents\nYou fucking do-gooders, too bad you couldn't do good at marriage\nAnd do you have any clue what I had to do to get here\nI don't think you do so stay tuned and keep your ears glued to the stereo\nCause here we go, he's {​*Jigga j-Jigga*}​\nAnd I'm the sinister Mr. Kiss-My-Ass, it's just the\nAnd God Said to Cain- RA the rugged man\nHttps://youtu.be/8G7FTO3HxAA?t=67\nYo, to the piano blue diablo, do an Amadou Diallo\nOut the Kilimanjaro, animal, Italiano\nMario Bava giallo, I beat apollo, you eat a hollow\nHole in your middle, look like a seed of avocado\nLife gone, I'm beyond body harm, carry an arm in my palm\nLeave you bloodier than Carrie at the prom\nMan, Van Damme kick a foe, Mantan\nWigger, whoa Bam Bam Bigelow, bigger flow, Riddick Bowe\nSummer eighties Bananarama, da ha da ha\nHad the hammer to Alabama to where the crackers are\nAnimated Hanna Barbera rather Cameron's Avatar\nStamina like the man out of Panama, Paz and Allah\nMacking Mary Magdalene, Howard Hewett from Shalamar\nRapping assassin like I'm back with Rawkus and Agallah\nPill to a blondie, the ill Bill Cosby\nIll hobby, kill the body, Ingagi, I killed Gandhi\nI like Chi-Lites, dice and knife fights\nMics syllables slang slit you, scissor precise slice\nSacrifice, lose suitable beautiful life price\nAnd I could conquer the Devil and I could revise Christ, c'mon\nStorytelling 1\nStan vs Uncommon Valor\nHttp://genius.com/Eminem-stan-lyrics\nHttp://genius.com/Jedi-mind-tricks-uncommon-valor-a-vietnam-story-lyrics\nStan- Eminem\nHttps://www.youtube.com/watch?v=gOMhN-hfMtY\nDear Mr. I'm-Too-Good-to-Call-or-Write-My-Fans\nThis'll be the last package I ever send your ass\nIt's been six months and still no word, I don't deserve it?\nI know you got my last two letters\nI wrote the addresses on 'em perfect\nSo this is my cassette I'm sending you, I hope you hear it\nI'm in the car right now, I'm doing 90 on the freeway\nHey, Slim, I drank a fifth of vodka, you dare me to drive\nYou know the song by Phil Collins \"In the Air of the Night\"\nAbout that guy who could've saved that other guy from drowning\nBut didn't, then Phil saw it all, then at a a show he found him\nThat's kinda how this is, you could've rescued me from drowning\nNow it's too late, I'm on a thousand downers now, I'm drowsy\nAnd all I wanted was a lousy letter or a call\nI hope you know I ripped all of your pictures off the wall\nI loved you Slim, we could've been together, think about it\nYou ruined it now, I hope you can't sleep and you dream about it\nAnd when you dream\nI hope you can't sleep and you scream about it\nI hope your conscience eats at you\nAnd you can't breathe without me\nSee, Slim, shut up bitch, I'm tryna talk\nHey, Slim, that's my girlfriend screamin' in the trunk\nBut I didn't slit her throat, I just tied her up, see I ain't like you\nCause if she suffocates she'll suffer more and then she'll die too\nWell, gotta go, I'm almost at the bridge now\nOh shit, I forgot, how am I supposed to send this shit out?\nUncommon Valor- RA the rugged man\nHttps://www.youtube.com/watch?v=kGZsGX3B_BY\nTrue story\nCall me Thorburn, John A., staff sergeant\nMarksman, skilled in killing, illing, I'm able and willing\nKill a village elephant, raping and pillage a village\nIllegitimate killers, U.S. Military guerrillas\nThis ain't no real war, Vietnam shit\nWorld War II, that's a war, this is just a military conflict\nSoothing drug abusing, Vietnamese women screwing\nSex, gambling and boozing, all this shit is amusing\nBitches and guns, this is every man's dream\nI don't wanna go home where I'm just an ordinary human being\nSpecial Op, Huey chopper gun ship run shit\nGook run when the minigun spit, won't miss\nKill shit, spit four-thousand bullets a minute\nVictor Charlie, hair-trigger, hit it, I'm in it to win it\nGet it, the lieutenant hinted, the villain, I been it\nThe killing, I did it, cripple, did it, pictures I painted is vivid, live it\nA wizard with weapons, the secret mission, we bout to begin it\nGovernment funded, behind enemy lines\nBullets is spraying, it's heating up a hundred degrees\nThe enemy's the North Vietnamese, bitch please\nAin't no sweat, I'm told be at ease\nUntil I see the pilot got hit, and we bout to hit some trees\nTail rotor broke, crash land\nAmerican man in Cambodia, right in the enemy hand\nTake a swig of the Whiskey to calm us\nThem yellow men wearing black pajamas, they wanna harm us\nThey all up on us, bang, bang, bullet hit my chest, feel no pain\nTo my left, the captain caught a bullet right in his brain\nBody parts flying, loss of limbs, explosions\nBad intentions, I see my best friend's intestines\nPray to the one above, it's raining, I'm covered in mud\nI think I'm dying, I feel dizzy, I'm losing blood\nI see my childhood, I'm back in the arms of my mother\nI see my whole life, I see Christ, I see bright lights\nI see Israelites, Muslims and Christians at peace, no fights\nBlack, Whites, Asians, people of all types\nI must've died then I woke up, surprised I'm alive\nI'm in a hospital bed, they rescued me, I survived\nI escaped the war came back\nBut ain't escape Agent Orange: Two of my kids born handicapped\nSpastic, quadriplegia, micro cephalic\nCerebral palsy, cortical blindness - name it, they had it\nMy son died, he ain't live, but I still try to think positive\nCause in life, God take, God give\nAs the World Turns vs The Greatest\nHttp://genius.com/Eminem-as-the-world-turns-lyrics\nHttp://genius.com/Ra-the-rugged-man-the-greatest-lyrics\nAs the world turns- Eminem\nHttps://www.youtube.com/watch?v=I_-xTRrSan0\nWe drive around in million dollar sports cars\nWhile little kids hide this tape from their parents like bad report cards\nOutsidaz, and we suing the courts\nCause we dope as fuck and only get a 2 in The Source\nHypochondriac, hanging out at the laundromat\nWhere all the raunchy fat white trashy blondes be at\nDressed like a sailor, standin' by a pail of garbage\nIt's almost dark and I'm still tryna nail a trailer park bitch\nI met a slut and said \"What up? It's nice to meet ya\nI'd like to treat you to a Faygo and a slice of pizza\nBut I'm broke as fuck and I don't get paid 'til the first of next month\nBut if you would care to join me, I was about to roll this next blunt\nBut I ain't got no weed, no Phillies, or no papers\nPlus I'm a rapist and a repeated prison escapist\nSo give me all your money and don't try nothing funny\nCause you know your stinking ass is too fat to try to outrun me\"\nI went to grab my gun, that's when her ass put it on me\nWith an uppercut and hit me with a basket of laundry\nI fell through the glass doors, started causing a scene\nSlid across the floor and flew right into a washing machine\nJumped up with a broken back\nThank God I was smokin' crack all day and doped up on coke and smack\nAll I wanted to do was rape the bitch and snatch her purse\nNow I wanna kill her but yo, I gotta catch her first\nRan through Rally's parkin' lot and took a shortcut\nSaw the house she ran up in and shot her fuckin' porch up\nKicked the door down to murder this divorced slut\nLooked around the room that's when I seen her bedroom door shut\nI know you're in there bitch, I got my gun cocked\nYou might as well come out now, she said \"Come in, it's unlocked\"\nI walked in and all I smelled was Liz Claiborne\nAnd seen her spread across the bed naked watchin' gay porn\nShe said \"Come here big boy, let's get acquainted\"\nI turned around to run, twisted my ankle and sprained it\nShe came at me at full speed, nothing could stop her\nI shot her five times and every bullet bounced off her\nI started to beg \"No, please let go\"\nBut she swallowed my fuckin' leg whole like an egg roll\nWith one leg left, now I'm hoppin' around crippled\nI grabbed my pocket knife and sliced off her right nipple\nJust tryna buy me some time then I remembered this magic trick\nDuh-dah-duh-dah-duh-duh, go-go gadget dick!\nWhipped that shit out, and ain't no doubt about it\nIt hit the ground and caused an earthquake and power outage\nI shouted, now bitch, let's see who gets the best\nStuffed that shit in crooked and fucked that fat slut to death\n(Come here bitch, come here, take this mothafuckin' dick bitch, come here)\nThe Greatest- RA the rugged man\nHttps://www.youtube.com/watch?v=sWUeShCe9pI&nohtml5=False\n\nNefertiti queen in a dream\nExotic mix, African-Swedish-Philippine\nStarlet from the silver screen\nPerfect from her painted toes to every last eyelash\nHigh class, she’s a taste of arsenic in your wine glass\nFemme fatale, put the blame on Mame, Rita Hayworth\nShe was worshipped by men the moment that her mother gave birth\nVixen, dark shadow on the wall, Nosferatu\nIf she spots you and she wants you\nShe already probably got you\nCherry lipstick, reckless living, the best description\nHer body got curves that deserve their own geometric system\nGarter belt, deadly red, stiletto heels, don’t trust it\nLong legs, Lana Turner style, film noir, seductress, the greatest\n\nYo, the dame got to me\nShe wanted diamonds but not monogamy\nShe’s rich from a past husband’s life insurance policy\nThis mystery chick is risky\nShe chewed me up and spit me and tossed me like a freesbee\nThe Goddess had her claws in me\nI treated her great but then she told me\nWe needed a break\nShattered my heart of glass like a Blondie-Puppini remake\nNow she's been punched, drunk, and loved\nAnd hung up with bums at clubs\nCheap ass chump thugs and punk scrubs that run drugs\nThose bastards are lying\nThey ain’t satisfying as I am\nNow she’s knocking on my door, wiping her mascara, crying\nGet lost, I’m usually down to earth and I usually never brag\nBut the truth is, girl, I’m the best thing you ever had\nMurder Murder vs Smithhaven mall\nHttp://genius.com/Eminem-murder-murder-lyrics\nHttp://genius.com/Ra-the-rugged-man-smithhaven-mall-lyrics\nMurder Murder- Eminem\nHttps://www.youtube.com/watch?v=78LbqFtRrt4\n\nLeft the keys in the van, with a gat in each hand\nWent up in Eastland and shot a policeman\nFuck a peace plan, if a citizen bystands\nThe shit is in my hands, here's your lifespan\nAnd for what your life's worth, this money is twice than\nGrab a couple grand and lay up in Iceland\nSee I'm a nice man but money turned me to Satan\nI'm thirsty for this green so bad I'm dehydrating\nHurry up with the cash bitch, I got a ride waiting\nShot a man twice in the back when he tried escaping\nI want the whole pie, I won't be denied Nathan\nMaybe I need my head inside straightened, brain contemplating\nClean out the register, dip before somebody catches ya\nOr gets your description and sketches ya\nThen connects you as the prime suspect\nBut I ain't set to flee the scene of the crime just yet\nCause I got a daughter to feed\nAnd two hundred dollars ain't enough to water the seed\nThe best thing would be for me to leave Taco Bell\nAnd hit up Chess King and have the lady at the desk bring\nMoney from the safe in the back, stepped in waving the Mac\nCo-operate, and we can operate, and save an attack\nThis bitch tried escaping the jack, grabbed her by the throat\nIt's murder she wrote, you barely heard a word\nAs she choked, it wasn't nothing for her to be smoked\nThen I slammed her on her back 'til her vertebrae broke\nJust then the pigs bust in yelling: \"Freeze!\"\nBut I'm already wanted for selling ki's\nAnd bunch of other felonies from A to Z like spelling bees\nSo before I dropped to the ground and fell on knees\nI bust shots, they bust back\nHit me square in the chest, wasn't wearing a vest\n\nLeft the house, pulling out the drive backing out\nBlew the back end out this lady's Jag, started blacking out\nPulled the Mac-10 out, stuck it in her face:\n\"Shut your yacking mouth\n'Fore I blow the brain from out the back ya scalp!\"\nDrug her by her hair, smacked her up\nThinking fuck it, mug her while you're there, jacked her up\nStole her car and made a profit, grabbed the tape from out the deck\nAnd lost it out the window like the girl in Set It Off did\nJetted off kid, stole the whip, now I'm a criminal\nDrove it through somebody's yard, dove into they swimming pool\nClimbed out and collapsed on the patio\nI made it out alive but I'm injured badly though\nParents screaming, \"Johnny go in and call the police\nTell em there's a crazy man disturbing all of the peace\"\nTried to stall him at least long enough to let me leap up\nRun in they crib and at least leave with some little cheap stuff\nActing like they never seen nobody hit a lick before\nSmashed the window, grabbed the Nintendo 64\nWhen they sell out in stores the price triples\nI ran up the block jumping kids on tricycles\nAnd collided with an 80-year-old lady with groceries\nThere goes cheese, eggs, milk and Post Toasties\nStood up and started to see stars\nToo many siren sounds, it seemed like a thousand police cars\nBarely escaped, must'a been some dumb luck\nJumped up and climbed the back of a moving dump truck\nBut I think somebody seen me maybe\nPlus I lost the damn Nintendo and I must'a dropped a Beanie Baby\nFuck it I give up, I'm surrounded in blue suits\nCame out with a white flag hollering \"truce-truce\"\nAnd surrendered my weapon to cops\nWasn't me, it was the gangster rap and the peppermint Schnapps\nSmithhaven Mall- RA the rugged man\nHttps://www.youtube.com/watch?v=H1Z3gsPd8sM\nNow let's get back to business\nWitness the finish, shit is menace\nBeing broke make motherfuckers turn to sinners\nI go to Smithaven Mall to see if anybody wants some\nAnybody want some? But this is gonna cost 'em\nI walk in the sneaker store\nMy ass is about to get raw\nLook at my watch it's a quarter past four\nMy mind's blank, flipping, shitting\nThis the dead zone\nI see this Spanish kid listening to reggae on his headphones\nI grabbed him, snatched him backwards\nSmacked him, he tried to react, it's when I was tempted to put a cap in him\nBut I didn't, I figured it was best if he was living\nPulled the SIG out everyone inside the store started shitting\nI made everybody in the spot get down on they fours\nI made a 300 pound woman strip down to her drawers\nIt was sickening, I couldn't believe what I was doing\nMy life is ruined at the age of 22\nAnd it's for real, trying to find the spot the safe is\nCannot escape this, I'm scared to be in jail with all the rapists\nI tried to rule the world but I blew it\nI gave the fat naked bitch the gun to kill me, she wouldn't do it\nSo I took the gun back and beat her down\nI gotta find a place to creep now (I gotta be out)\nYo, yo\nThis where my shit stops\nI turned around, surrounded by six cops\nPut the clip in my SIG, got six shots\nThey made my skull almost cave in for misbehaving\nIt's cause I chickened out and threw the gun down and gave in\nI had no respect on the outside\nBut now I got less respect on the inside (inside)\nI tried to rule the world but I blew it\nWishing I was dead but I still don't got the guts to do it\nGuilty Conscience vs Betcha Life\nHttp://genius.com/Eminem-guilty-conscience-lyrics\nHttp://genius.com/Ra-the-rugged-man-betcha-life-lyrics\nGuilty Conscience- Eminem\nHttps://www.youtube.com/watch?v=Xbw_BxDwdjk\nAlright stop, now before you walk in the door\nOf this liquor store and try to get money out the drawer\nYou better think of the consequence (But who are you?)\nI'm your mothafuckin' conscience!\n:That's nonsense\nGo in, gaffle the money and run to one of your Aunt's cribs\nAnd borrow a damn dress and one of her blond wigs\nTell her you need a place to stay, you'll be safe for days\nIf you shave your legs with Renee's razor blades\n:Yeah but if it all goes through like it's supposed to\nThe whole neighborhood knows you and they'll expose you\nThink about it before you walk in the door first\nLook at the store clerk, she's older than George Burns!\n:Fuck that, do that shit, shoot that bitch\nCan you afford to blow this shit, are you that rich?\nWhy you give a fuck if she dies? Are you that bitch?\nDo you really think she gives a fuck if you have kids?\n:Man don't do it, it's not worth it to risk it (You're right!)\nNot over this shit, drop the biscuit (I will!)\nDon't even listen to Slim yo, he's bad for you\n(You know what Dre, I don't like yo attitude)\nBetcha Life- RA the rugged man\nHttps://www.youtube.com/watch?time_continue=3&v=ZLYlnJT6EFU\n: ''That's it'' was written on the wall in graffiti\nMy insurance, a one way ticket to Tahiti\nThe media says series is tied up, I'm flied up\nAll I can see is Jonesy firing me up\n; Listen, you faggot, and you listen good\nI wanna make sure that it's understood, we don't play this shit in the hood\nI'mma let of lead in your head soon\nBloodshed soon, blood-red soon, you gon' be dead soon\n: Nah, I got this, nobody is coming back for free, yo\nIt's not gonna be down 12-hundred in C-notes\nDon't got that, I'm praying Dodger blew\nA bum out of luck, what's a man gonna do?\n: Two in the morning, time to handle my biz\nIt's 2:15, I got my boys and we up in ya crib\nThey put a slug in your wife, I put a slug in your kid\nWas you really that stupid, thought I'd let you live?\nSocially Conscious/Content 1\nSing for the moment vs Still Get through the day\nHttp://genius.com/Eminem-sing-for-the-moment-lyrics\nHttp://genius.com/Ra-the-rugged-man-still-get-through-the-day-lyrics\nSing For the moment- Eminem\nHttps://www.youtube.com/watch?v=D4hAVemuQXY\nThey say music can alter moods and talk to you\nWell, can it load a gun up for you and cock it too?\nWell if it can, and the next time you assault a dude\nJust tell the judge it was my fault, and I'll get sued\nSee what these kids do is hear 'bout us toting pistols\nAnd they wanna get one cause, they think the shit's cool\nNot knowing we really just protecting ourselves\nWe entertainers, of course the shit's affecting our sales\nYou ignoramus, but music is reflection of self\nWe just explain it, and then we get our checks in the mail\nIt's fucked up ain't it? How we can come from practically nothing\nTo being able to have any fucking thing that we wanted\nThat's why we, sing for these kids who don't have a thing\nExcept for a dream and a fucking rap magazine\nWho post pin-up pictures on they walls all day long\nIdolize their favorite rappers and know all their songs\nOr for anyone who's ever been through shit in they lives\nSo they sit and they cry at night wishing they'd die\n'til they throw on a rap record and they sit and they vibe\nWe're nothing to you, but we're the fucking shit in their eyes\nThat's why we, seize the moment try to freeze it and own it\nSqueeze it and hold it, cause we consider these minutes golden\nAnd maybe they'll admit it when we're gone\nJust let our spirits live on\nThrough our lyrics that you hear in our songs and we can\nStill get Through the day- RA the rugged man\nHttps://www.youtube.com/watch?v=GL90ZmdjZrU&nohtml5=False\nLiving ain’t a breeze, please, life’s full of tragedies\nWe see our friends die, some get murdered, some die by disease\nGot your finger on the trigger, don't do it\nContemplating suicide, just put the gun down, we've all been through it\nAn infant in his crib sprayed by stray bullets and dies\nHe was a future genius, he would have won a Pulitzer prize\nThe racist cop shot an innocent black\nAn 8-year old prostitute hoing getting mommy money for crack\nA little boy molested by his step-father, hopeless\nThe little boy grew up now, he's molesting his own kids\nThe government watching you from a satellite like you ain't had it right\nYour best friend snitching on you; that's animal-like\nIt's horrible watching your loved ones die and having to bury 'em\nTo seeing my cousin found dead, she overdosed shooting heroin\nMy family dying from sickening disorders\nWe found my brother Maxx\nHe was blue and purple and he was stiff with rigor mortis\nMy father got spots on his lungs, they think it's cancer\nI'm praying every night, even if God don't ever answer\nWe can do it together, women hold your mans\nMen hold your women, everybody let's hold hands and sing\nMosh vs Learn Truth\nHttp://genius.com/Eminem-mosh-lyrics\nHttp://genius.com/Ra-the-rugged-man-learn-truth-lyrics\nMosh- Eminem\nHttps://vimeo.com/27790825\nImagine it pouring, just raining down on us\nMosh pits outside the Oval Office, someone's trying\nTo tell us something maybe this is God just\nSaying we're responsible, for this monster\nThis coward that we have empowered, this is Bin Laden\nLook at his head nodding - how could, we allow\nSomething like this without, pumping our fist now\nThis is our, final hour\nLet me, be the voice, and your strength, and your choice\nLet me simplify the rhyme just to amplify the noise\nTry to amplify it, times-it, and multiply it by six-teen\nMillion people all equal at this high pitch\nMaybe we can reach al-Qaeda through my speech\nLet the President answer a higher anarchy\nStrap him with an AK-47, let him go\nFight his own war, let him impress daddy that way\nNo more blood for oil, we got our own battles\nTo fight on our own soil, no more psychological warfare\nTo trick us to thinking we ain't loyal\nIf we don't serve our own country we're patronizing a hero\nLook in his eyes it's all lies\nThe stars and stripes have been swiped, washed out and wiped\nAnd replaced with his own face, mosh now or die\nIf I get sniped tonight, you'll know why - cause I told you to fight!\nLearn Truth- RA the rugged man\nHttps://youtu.be/HWzYIpUZCk8?t=87\nDeath by suicide bomb, protestants, Bibles, a Qoran, or Islam\nFrom Genghis Khan to Vietnam I can smell the napalm\nRape victims, ripped stockings\nRedneck clan members doing church bombings\nInnocent fetus' being aborted with no options\nHuman governments ruin 'em\nWorrying what weapons could be used to be nukin' 'em\nJesus was crucified in Jerusalem\nSlaves treated like property, to Pearl Harbor to Hiroshima to Nagasaki\nAdolf Hitler, to every murderous Nazi\nTo the Gambinos, to the Gottis, to every mafia atrocity\nChild pornography, babies starving and dying in poverty\nSerbians fighting Croatians in Yugoslavia\nMuslim women being raped, up to 40,000 in the war in Bosnia\nThe 50 million killed in the second World War\nThe government's poisoning the minds and the bodies\nOf the babies that are born poor\nAirplanes blown up by Islamic extremists\nIn religion there's always drama\nWhether worshipping the Prophet Mohammed or Jesus\nSmall pox to Napoleon's troops dying from typhus\nFrom the Spanish flu to the black plague, today it's AIDS virus\nBodies in coffins, political extortions\nRacist mobs murdering, Willie Turks, Michael Griffith and Yusef Hawkins\nCheck the murder rate, is it human nature to murder and hate?\nThe Catholic church claimed women were witches and burned 'em at the stake\nPedophile predators attacking\n.38 Beretta used by Ghandi's assassin\n16 bullets in Malcolm, it happened uptown Manhattan\nAnd the homicide, Reagan '80s epidemic of crack\nAnd soldiers in action dying in Iraq and never coming back\nAnd now let's\nThe Way I am vs Media Midgets\nHttp://genius.com/Eminem-the-way-i-am-lyrics\nHttp://genius.com/Ra-the-rugged-man-media-midgets-lyrics\nThe way I am- Eminem\nHttps://www.youtube.com/watch?v=mQvteoFiMlg&nohtml5=False\nSometimes I just feel like my father\nI hate to be bothered with all of this nonsense it's constant\nAnd, \"oh, it's his lyrical content\nThe song \"Guilty Conscience\" has gotten such rotten responses\"\nAnd all of this controversy circles me\nAnd it seems like the media immediately points a finger at me\nSo I point one back at 'em, but not the index or pinkie\nOr the ring or the thumb, it's the one you put up\nWhen you don't give a fuck, when you won't just put up\nWith the bullshit they pull, cause they full of shit too\nWhen a dude's getting bullied and shoots up his school\nAnd they blame it on Marilyn and the heroin\nWhere were the parents at and look where it's at\nMiddle America, now it's a tragedy\nNow it's so sad to see, an upper-class city\nHavin' this happening\nThen attack Eminem cause I rap this way\nBut I'm glad cause they feed me the fuel that I need for the fire\nTo burn and it's burning and I have returned\nMedia Midgets- Ra the rugged man\nHttps://www.youtube.com/watch?v=b04Elfud97I&nohtml5=False\nSee, you ain't rocking for instance\nYou popping, but you robbing hip hop of traditions\nYou ain't rappers, you more like crooked politicians\nPart of who's creation, new nation\nTrying to fuck us with no lubrication\nRaping, never losing to Lucifer Satan\nCalling me Canaan the caveman in the cave, came close but never caved in\nThe false image of a prophet you praising\nYou living in a nation living in intidimation\nDue to primitive media manipulation\nTerror tactics and intidimation, we lack innovation\nLooking for more fame they control your brain\nThe gullible puppets of the public get played like a board game\nGet your jaw reconstructed, I ain't no puppet\nAin't throwing up no diamonds, here's the middle finger, go shove it\nRenegade vs Change Gonna Come\nRenegade- Eminem\nSince I'm in a position to talk to these kids and they listen\nI ain't no politician but I'll kick it with em a minute\nCause, see, they call me a menace and if the shoe fits I'll wear it\nBut if it don't, then y'all'll swallow the truth, grin and bear it\nNow who's the king of these rude, ludicrous, lucrative lyrics\nWho could inherit the title, put the youth in hysterics\nUsing his music to steer it, sharing his views and his merits\nBut there's a huge interference: they're saying you shouldn't hear it\nMaybe it's hatred I spew, maybe it's food for the spirit\nMaybe it's beautiful music I made for you to just cherish\nBut I'm debated, disputed, hated and viewed in America\nAs a motherfuckin' drug addict, like you didn't experiment, nah nah\nThat's when you start to stare at who's in the mirror\nAnd see yourself as a kid again, and you get embarrassed\nAnd I got nothing to do but make you look stupid as parents\nYou fucking do-gooders, too bad you couldn't do good at marriage\nAnd do you have any clue what I had to do to get here\nI don't think you do so stay tuned and keep your ears glued to the stereo\nCause here we go, he's {​*Jigga j-Jigga*}​\nAnd I'm the sinister Mr. Kiss-My-Ass, it's just the\nSee I'm a poet to some, a regular modern-day Shakespeare\nJesus Christ, the King of these Latter-Day Saints here\nTo shatter the picture in which of that as they paint me as\nAs a monger of hate, satanist, scatter-brained atheist\nBut that ain't the case, see it's a matter of taste\nWe as a people decide if Shady's as bad as they say he is\nOr is he the latter, a gateway to escape\nMedia scapegoat; who they can be mad at today\nSee it's easy as cake, simple as whistling Dixie\nWhile I'm waving the pistol at sixty Christians against me\nGo to war with the Mormons, take a bath with the Catholics\nIn holy water, no wonder they tried to hold me under longer\nI'm a motherfucking spiteful, delightful eyeful\nThe new Ice Cube, motherfuckers hate to like you\nWhat did I do, I'm just a kid from the gutter\nMaking this butter off these bloodsuckers\nCause I'm a muthafuckin'\nChange gonna come- RA the rugged man\nHttps://youtu.be/_0mYlvhPAQ4?t=155\nCriminal acts in the dark doubling, the hearts suffering\nThe odds I'm duckin' 'em, all this hatred towards God is troubling\nSavages living sacrilegious, a bunch of babbling bitches\nSatan disguised as media attacking the scriptures, attracting the lizards\nDemons accusing the righteous of being the bigots\nAnd brainwashed children in society believing the critics\nKilling, living in a sin, and sittin' in a cell in prison\nLacking of independent thinking is sickening\nStop following the public opinion\nThey tricking you to support the corrupt system\nKeeping your thoughts limited, inhibited with no knowledge or wisdom\nI'm breaking the demon, the fake heathen, it's Hate Season\nAny snake deceiving, I'll make sure they no longer ain't breathing\nWas I born a savage and having to sin\nCan they mentally and morally civilize a savage and make him a king?\nMaking the misfortunate forfeit, poisoning the piss-poor kids\nBio-hazardous chemicals out the sink faucets\nWhen the moon turn red, that's the end and everybody dies\nMeteor-showers and lambs with 7 horns and 7 eyes\nPutting and end to earth's evils, six-wing creatures\nFour different kinds with faces of lions, ox's and eagles\nCome on\nHeadlights vs Legends Never Die (Daddys Halo)\nHttp://genius.com/Eminem-headlights-lyrics\nHttp://genius.com/Ra-the-rugged-man-legends-never-die-daddys-halo-lyrics\nHeadlights- Eminem\nHttps://www.youtube.com/watch?v=7bDLIV96LD4&nohtml5=False\nCause to this day we remain estranged and I hate it though\nCause you ain't even get to witness your grandbabies grow\nBut I'm sorry momma for \"Cleanin' Out My Closet\"\nAt the time I was angry, rightfully? Maybe so\nNever meant that far to take it though\nCause, now I know it's not your fault and I'm not making jokes\nThat song I no longer play at shows and I cringe every time it's on the radio\nAnd I think of Nathan being placed in a home\nAnd all the medicine you fed us and how I just wanted you to taste your own\nBut now the medication's taking over\nAnd your mental state's deteriorating slow and I'm way too old to cry\nThe shit is painful though but ma, I forgive you, so does Nathan, yo\nAll you did, all you said, you did your best to raise us both\nFoster care, that cross you bear, few may be as heavy as yours\nBut I love you, Debbie Mathers, oh, what a tangled web we have\nCause, one thing I never asked was where the fuck my deadbeat dad was\nFuck it, I guess he had trouble keeping up with every address\nBut I'd have flipped every mattress, every rock and desert cactus\nOwned a collection of maps and followed my kids to the edge of the atlas\nIf someone ever moved 'em from me, that you could've bet your asses\nIf I had to come down the chimney dressed as Santa, kidnap 'em\nAnd although one has only met their grandma, once you pulled up\nIn our drive one night, as we were leaving to get some hamburgers\nMe, her and Nate, we introduced you, hugged you\nAnd as you left I had this overwhelming sadness\nCome over me as we pulled off to go our separate paths\nAnd I saw your headlights as I looked back and\nI'm mad I didn't get the chance to thank you for being my mom and my dad\nSo mom, please accept this as a tribute I wrote this on the jet, I guess\nI had to get this off my chest, I hope I get the chance to lay it 'fore I'm dead\nThe stewardess said to fasten my seatbelt, I guess we're crashing\nSo if I'm not dreaming, I hope you get this message\nThat I'll always love you from afar cause you're my ma\nLegends Never Die (Daddys Halo)- RA the rugged man\nHttps://www.youtube.com/watch?v=-g6UeOOCD8o&nohtml5=False\nYo, part good samaritan, part criminal, a master with weapons\nNice with his hands, he was Rugged Man the original\nAs children we saw you losing your sanity\nEven though we watched you struggle financially\nYou kept the love in the family\nDaddy, I'm thinking about you every day though\nI can see you holding a machine gun in heaven with angel wings and a halo\nYou was always quick to pick a pocket\nYou're the only one in heaven\nProbably slick enough to pull off stealing God's wallet\nIn life the Lord ain't really deal you a fair one\nI watched you bury your baby boy, your daughter and your grandson\nYou lived one hell of a life from being highly decorated\nTo being homeless sleeping in the park with your pregnant wife\nIf I acted up in the restaurant I knew I was being brave\nCause you'd take me to the bathroom and spank me 'til I knew how to behave\nTaught me prayers at night and you'd tell me Bible stories\nTaught me history, Crazy Horse and his tribal glories\nHow many times as a kid I seen you handcuffed by the cops?\nYou taught us black music, Sam Cooke, The Drifters, The Four Tops\nTaught me about boxing, Ray Leonard and Larry Holmes\nAround the same time you left my mother for Debbie Jones\nI told the world your true story and after the record got made\nUncommon Valor, some said I dropped the verse of the decade\nEverywhere you went you would tell the world about your son Rugged Man\nYou was so proud of me, daddy, you was my number one fan\nYou was always bragging about me to no purpose\nOn your deathbed you'd play my Mayweather interview for the nurses\nLosing you, daddy, it hurt more than any physical pain\nYou was too young when the cancer went from your throat and into your brain\nYou was my teacher, my idol, I worshipped you, you was the best, daddy\nYou lived a tough life, now get some rest, daddy\nI love you daddy",
 "image": "https://assets.genius.com/images/default_cover_image.png?1618862777"
}