{
 "title": "Lies",
 "album": "Born to Sing",
 "year": "1990-04-03",
 "lyrics": "Lies, lies, using lies as alibis\nLies, lies, just a devil in disguise\n\nIt's the same game\nPlayed in many ways\nEveryone is the victim too\nIt's just a waste of time\nMade for simple minds\nSo why do people insist on lies?\n\nI'll live my life a different way\nRefuse to let myself become a victim\nGetting caught up in a vicious web of lies\n\nLies (they can hurt you), lies (and destroy you)\nUsing lies as alibis (watch out for lies)\nLies, lies, just a devil in disguise\n(Just a devil in disguise)\n\nThe nation's leaders as well as teachers\nPractice lies as a way of life, yes they do\nSo think before you speak\n'Cause what you sow you reap\nThe truth will always be brought to light\n\nWill we ever learn one day\nThat telling lies will always lead to madness\nMisery and sometimes pain\n\nLies, lies, using lies as alibis (using lies as alibis)\nLies, lies, just a devil in disguise (and it's made for simple minds)\nLies, lies, using lies as alibis (made for simple minds)\nLies, lies (you've got to think about it), just a devil in disguise\n(Those lies)\n\nLies and deceit, yes, it's running real rampant\nCommunities suffering, yo, I can't stand it\nWhen we think of lies, we tend to think of politicians\nBut what about the husband who's on a mission?\nLying to his wife so he can get it on and get some\nComing back home with a dumb expression\nWritten on a face that's guilty as a criminal\nIt's time to change your attitude\nPeople do you hear me though?\nListen, to a funky rhyme that's kickin' knowledge that we need\nWe lie about our hair and we know we got a weave\nPoliticians lie about the things they're gonna do\nAnd they re-lie the tale, affects me and you\nA smoker lies about the money that he stole\nAnd a dope dealer never tells you how he got his gold\nI guess what Debbie T. is really trying to say\nWhen you break it all down, we're really all the same\n\nI'll live my life a different way\nRefuse to let myself become a victim\nCaught up in a vicious web of lies\n\nLies, lies, using lies as alibis (using lies)\nLies (stop lying), lies, just a devil in disguise (stop cheating)\nLies, lies, using lies as alibis (oh yeah, they'll ruin your life)\nLies (you better think twice), lies, just a devil in disguise\nLies, lies, using lies as alibis\nLies, lies, just a devil in disguise\nLies, lies, using lies as alibis\nLies, lies, just a devil in disguise",
 "image": "https://images.genius.com/1d72258d4a15f61541cda608223911a9.600x600x1.jpg"
}