{
 "title": "Big T vs Caustic",
 "album": "A3C Festival",
 "year": "2015-10-09",
 "lyrics": "I said I know not a lot of people here don't want me to win\nBut that's alright\nBut I don't think homeboy's got enough people on his side\nSo if you wanna jump on stage say now's the fucking time\nSaid honestly, you one of my favorites, T\nI don't know anybody else that would fill out the artist registration form and put \"Bagel Bites\" as a basic need\nSo honestly, I just wanna thank you for showing at A3C\nCause they almost kicked his ass off the plane for trying to take three seats\nDawg, y'all know me\nCommon type shit but I like to simplify shit\nI'm direct but I'm clever, I just stick to my biz\nYou want any indication of how fucking big this guy is\nKeep in mind this guy got fucking shot six times and lived\n(Damn, y'all hella mad)\nYo, come bring this shit to my hood, my homeboys will fucking trample you\nLet them real fucking guniees ask you questions you ain't got no answers to\nSo motherfucker I really don't understand your whole attitude\nDon't be mad at me just cause Ben & Jerry's named fucking Chunky Monkey after you\nThis motherfucker got his picture up in Whole Foods because he stole food\nI don't even know how he escaped I thought they cut off his leg at the end of Soul Food\nLook at him up here trying to act like he a cold dude\nYou put a little hot sauce on his grits that shit'll change his whole mood\nI said I wrote nothing but fat jokes for you, bitch\nI brought no bars for you\nWhy the fuck would I? You look like fucking Large-senal\nThis the biggest motherfucker alive\nIf we really got into a fucking fight I would pummel this guy\nBut what I should do is charge everybody inside 20 bucks each to pull out your dreadlocks one at a time\nShit, I didn't come here to be kind\nI just came here to whip yo' ass and give you the peace sign\nGo home for some me time\nShit, this is gon' be real fucking easy to understand dawg, you don't need no rewind\nJust cause we on Don't Flop that don't mean this shit is tea time\nCall me Netflix bitch, I shut down your Block Buster\nI pull up and then I click on him like he go the wrong number\nSee I could do bars but fat jokes are a lot funner\nOne time this motherfucker did a somersault, shit took all summer\nFuck all this serious time and his bullshit yo\nAll fat jokes!\nI said fuck any motherfucker who thinks Terrance is winning\nI don't know if Big T is your fucking rap name or what you wear when you're swimming\nWe in two different leagues dawg, this isn't even fair when I'm spitting\nAnd if you think I OD'd on this fat shit already homie, we are barely beginning\nI said you a pocket protector, nothing but a lead holder\nI could beat you on any day, any time, piss drunk, dead sober\nI said it's the middle of the fucking day and you still got that \"just gotta bed\" odor\nAnd honestly, you lucky Big T don't whip yo' ass cause you getting all his leftovers\nDamn for real? My bad Marv' my bad\nI'm just being extra homie\nBut this motherfucker is so fat he should've team up with fucking Quest McCody\nUp here looking like his heart be beating extra slowly\nBut I don't know what else to expect from a dude who's first words were \"large cheese and pepperoni\"\nI mean who needs enemies when you order everything with extra cheese?\nI mean I don't even gotta kill this motherfucker Domino's gonna do that shit for me eventually\nThis motherfucker know ten languages but he only knows how to say \"Dinner please.\"\nYou the hungriest motherfucker that I've ever met in my life dawg\nThat's why you always in my Twitter feed\nI said you order pizza on your cell phone\nLate night when you need some grub\nSaid you gonna die completely alone\nI think this guy needs a hug\nCause nobody's coming to your funeral\nI'm just playing\nAye ladies, keep it real\nHow many of y'all would fuck with this dude despite his obesity?\nLadies keep it real, how of y'all find him attractive despite the obesity?\nSee that's why I fuck with the ATL man, y'all don't lie so easily\nSee thus far they feeling me\nI mean, look at T's anatomy\nAny bitch that fucks you should be charged with fucking bestiality\nHe an undercover cop, that's how he feed his family\nSo I guess sound effects ain't the only shit he learned at the Police Academy\nI mean, I'm not a mean guy, I just kinda like this shit\nI mean this shit a Tupperware party dawg, I'll put something inside his lid\nI mean you can't fucking rap and the sound effects are kinda shit\nI mean it's funny but the whole time I'm like \"Damn, Malcolm X died for this?\"\nI mean it ain't all black and white, I ain't gotta write about your race\nTo be honest I don't give a fuck though dawg, I said I don't gotta write about your race\nI find you physically disgusting I'd rather write about your weight\nThey said I wouldn't disrespect him but I'm right up in his face\nYou get outta line with me I'll pop that eye back into place\nFat fucking bitch, ain't take your Midol lately\nFucking looking at me on the side all crazy\nDon't be mad at me cause your eye ball lazy\nBitch you ain't clean just cause you look just like the Pin Sole lady\nAye real quick before I forget, for all that black face shit, Uno Lavoz is a clown\nI'll fucking smack the brown off his face he starts talking in my round\nSee that's why ain't nobody even fuck with this clown\nThere's a difference between me, D and Drect and you fucking dumbing it down\nShut the fuck up\nAnybody who named you Big T wasn't fucking around\nI didn't know they started making T-shirts out of comforters now\nI'll make yo' fat ass a deal\nYou tell me what it's like to be a thug in your town and I'll tell you what it's like to fuck a girl that weighs less than 200 pounds\nAye y'all ain't feeling this shit so I'ma just be cool\nMan this shit is just rude I'm done with this fat motherfucker, Soul Khan finish this fool!\n\nPssww pssww pssww\n\nBig Terrance!\nWelcome to A3C\nA long way from Smack DVD when I use to lean in the ACG\nStraight to the gun sounds, blocka, boom, boom, make they team flee\nThis big bitch will have 'em running in circles like Baby D\nYou surprised, but that funny shit don't work where I stay\nI'll put a price on this nigga head, then I'll pay\nI'll take him to the edge of the roof, over the highway\nThen Caustic (cost it), can't drop lower than Black Friday\nYou battled Big T in Chicago, that was suicidal\nAs lifting a side do' Murcielago\nThis bum a square with the cig', I get to talk Lucy I'm home\nI was feeling like I was Ricky Ricardo\nThe Roscoe was under the cargo\nI upped it and dumped the shit horizontal\nNow I'm  like Billy Blanco\nPlay that John Leguizamo\nYou want the fade? This blade will scar bro (Scarborough) like the hood in Toronto\nHe's thinking it's Rocky/Apollo, but this Roscoe is undefeated\nRocky Marciano\nWhat's the point of the convo?\nClips sticking out like it's Gonzo\nAnd the chalk will follow every place y'all go like OJ in a Bronco\nIn the Grind Time days\nYou was the dude that only battled on the stage when the guy that was supposed to battle hasn't shown\nYou the nigga we tell, \"We only ride three deep fam',\" when you tag along\nYou the nigga that get picked last in gym class after the nigga with the glasses on\nIt's funny, ever since the scene in Grind Time Cali gone\nYou from out west but ain't battled nowhere in Madison\nThat's a line for Chicago\nThere's a street called Out West Madison on it\nLong story short Caustic, you're the only opponent\nEurgh cheap ass had at the moment\nIf battle rap was Space Jam, I ain't reach my Michael Jordan caliber moment\nBut I'm like The Alias, I took out the most skilled and talented on it\nNigga, I'll pull up to your door like it had a lift on it\nAnd get to shooting at the door, like somebody hung a plastic rim on it\nExtends on it, with banana clips on it\nBalance beam so big, I can practice gymnastic flips on it\nYou lucky that a  on it\nCause there'd be innocent people dying\nCause it sound like music to my ears to hear the people that love him crying\nFuneral service, funeral service, his mother, brother flying\nThey bringing cuz to more (customer) services than a returning items\nAnd I'll be sitting by him\nThinking of the worst type shit\nLike, \"What if the guy that carry his hearse might trip?\"\nHe slip, and body roll into another guys pit\nWhat if the girl he wife get fucked so hard her cervix might split?\nNiggas bust nuts like Money Mike D when he turned the vice grips\nI hope your kids grow up and get good from the  you guys did\nAnd then they aid get even greater from the  you guys did\nYou fall asleep and they found all the guns you guys hid\nAnd they go down the street and play cops and robbers with the other white kids\nAnd you find time to come with that multi syllable time rhyme\nThat was fine wine up in Eminem prime time up in '99\nBut since your from Grind Time you was Einstein\nNow you on the sideline riding pine so much that you could be a principle\nAnd give out substitute guidelines\nI ain't lying, my career was on a slight decline\nI went from the Dinininon to John John\nThat's like going from Louis Vuitton Don to Sean John\nThat's a pick up game after a prime time with 'Bron Bron\nNah, I ain't Mr. Chillackaboo, NWX, today I'm Mr. Bomb Bomb\nDNA everywhere, Th3 Saga continue\nNah Sean, don't check to see if it's O'fficial, uh uh\nI make Rain check like I couldn't find time\nIn Grind Time you had to come up with something funny\nI would've been like \"Boy your nose chunky as Doug Funny\"\nThat's why Grind Time wasn't for me, that wasn't funny\nI'd rather laugh at the thought of a nigga trying to take something from me\nThe arm in my pants, it wasn't Bundy\nChest shot, expose his heart, he ain't got nothing but love for me\nSoaking wet you a buck twenty, you lunch money,  you run from me\nNot today, I dump the tray/trey like I wasn't hungry\nKeep it funky, enough of this fake shit\nWhy we ain't battle in Chicago?\nThe day before you was perfectly fine, we drank and ate shit\nNext thing, cuz throwing it up in the corner and he ain't tri-\nMJ in game 6 in the flu game, you play sick\nEnough of this racist\nNigga that's gon' get your spaghetti popped\nAin't you the same nigga that called Arsonal a \"moolie\"?\nSo how do you call an Italian a \"nigga\"? Somebody said it's \"wop\"\nSo, you already coming, know it's coming, when you see that steady gwap\nI'll have him missing, he don't come up with that Fetty Wap\nWap wap, I'll speak to your Mexican side too\nI'll run up on him on Cinco De Mayo\nBah, turn the people beside you pico de gallo\nBah, sonic boom, bullets  sweeping through \nGet him red/read as when Jesus Christ speak in the Bible\nWhen I wanted to battle somebody from Oakland, I would've had Day\nNow it's grams in the whip, like \nI ain't gon' lie, auntie ran down get to hitting 'em\nI put auntie body in a bag like penicillin\nNigga, matter of fact, what the hell bro?\nI'm sticking grams in the whip like Charlie Murphy in The Chappelle Show\nThey talking everybody, I thought we was cool\nI'm killing everybody, from his family crew cause they all in the same boat like a family crew\nQuiet",
 "image": "https://images.genius.com/b76e35fcee7cf29ffe0e6189bead619d.1000x563x1.jpg"
}