{
 "title": "Ownlee Eue",
 "album": "A Day in the Life: A Pokadelic Adventure",
 "year": "1990-01-01",
 "lyrics": "Uh\nEhhh!\nUh\nUnnh!\n(heh, heh, heh, heh, heh, heh, heh, heh, heh, heh, heh, heh, heh, heh, heh\nHeh, heh, heh\nHeh, heh, heh)\nYou know, we've been together for some time and\nI've been experiencin' some kind of\nFeelings that's changed and rearranged\nFor the better\nAnd I hope that you been feeling the same way\nAnd pray that you ain't runnin game\nHey, just whatta you have to say?\nAs I sit here thinkin' 'bout you, suddenly I feel ashamed\n(You do?)\nThe feelings deep inside me suddenly begin to change\nWhen I see your face and hear your voice\nI seem to lose despair\nI give a lasting overjoyed whenever you are near\nOwnlee U (Ownlee U)\nCan make me do the things I do\nY-O-U (Y-O-U )\nCan make me bring the world to you\nYes it's true (Yes it's true, o ho)\nIt's you and ownlee U (It's you and ownlee U)\nWell, you seeem to know what I'm saying\nBut let me just explain once more, okay?\nCheck it out\nIt don't take a genius to know I care for you\nLove, cherish, respect, and always be there for you\nWhy not? It's quite simple\nA love affair like this i could truly get my heart into\nHaven't you? 'Cause you're my morning flower\nFor you I'd give my fortune, fame and power\nNo, I'm not kiddin'\nBut shouldn't we just enjoy this and take it as it is\nYou do?\nSo do I\nDon't you see that you're the apple in my sleepy eyes\nMy dear, I must confess\nThat I'm your love slave and you're my emperess\nI love you like a wife, mother, sister, or daughter\nWorship your every move, even drink your bathwater!\nI'm not playin', it's true\nAnd my love is for ownlee U\n\nOwnlee U (Ownlee U)\nCan make me do the things I do\nY-O-U (Y-O-U )\nCan make me bring the world to you\nYes it's true (Yes it's true)\nIt's you and Ownlee U\nI see you got the picture\nSo come over hear and let's get freaky\nYou ready?\nOne-and-a, two-and-a\nOne\nI wanna do it like (Uhh!)\nAnd give it to you just like (Uhh!)\nCome over here and do it like (Uhh!)\nTurn around and I do a little sun'in' like (Uhh!)\nTwo times (Uhh! Uhh!)\nOne more time, hit it! (Uhh!)\nWha? Wha?\nLet me take you by the hand\nAnd talk to you just for a while (uh huh)\nAnd I'll kiss your cheek and say sweet things\nJust to see you smile\nCause your smile brightens my day\nAnd turns my grey skies blue\nThe reason that I'm happy\nI'm happy 'cause of you\nEh, Eh, Only you\nCan make me do all the things I do\n(If it's true, I'm in love with you)\nI'm stuck to you just like crazy glue\n(Call me up for a little rendevous)\nI'm not the kind of guy who just likes to\nSlam, bam, thank you m'am, then I'm through\nYou're the only one for me\nYep, just you\nYou and only you\n(Why?)\n'Cause of the things you do\n(Oh)\nDon't you see I'm the one for you\n(You?)\nThese words are true\nAnd my love is for\n\nOwnlee U (Ownlee U)\nMake me do the things I do\nY-O-U (Y-O-U )\nCan make me bring the world to you\nYes it's true (Yes it's true)\nIt's you and ownlee U\nC'mon sweetheart. Let's go home",
 "image": "https://images.genius.com/15a45f56750837f1b97b3dc4c13910a5.600x600x1.jpg"
}