{
 "title": "Poison",
 "album": "Poison",
 "year": "1990-02-24",
 "lyrics": "Yeah, Spyderman and Freeze in full effect\nUh-huh\nYou ready, Ron?\nI'm ready\nYou ready, Biv?\nI'm ready, Slick, are you?\nOh, yeah, break it down\n\nGirl, I, must (Warn you)\nI sense something strange in my mind\nSituation is (Serious)\nLet's cure it cause we're running out of time\nIt's oh, so (Beautiful)\nRelationships they seem from the start\nIt's all so (Deadly)\nWhen love is not together from the heart\n\nIt's drivin' me out of my mind!\nThat's why it's hard for me to find\nCan't get it out of my head!\nMiss her, kiss her, love her\n(Wrong move you're dead!)\n\nThat girl is (Poison)...\nNever trust a big butt and smile\nThat girl is (Poison)..\n(\"POISON!!\")\n\n(-caution)\nBefore I start to meet a fly girl, you know?\nCause in some (Portions)\nYou'll think she's the best thing in the world\nShe's so - (Fly)\nShe'll drive you right out of your mind\nAnd steal your heart when you're blind\nBeware she's schemin', she'll make you think you're dreamin'\nYOU'LL fall in love and she'll be scheming, scheming\n\nPoison, deadly, movin' in slow\nLookin for a mellow fellow like DeVoe\nGettin paid, laid, so better lay low\nSchemin on house, money, and the whole show\nThe low pro ho she'll be cut like an aaa-FRO\nSee what you're sayin', huh, she's a winner to you\nBut I know she's a loser (How do you know?)\nMe and the crew used to do her!\n\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\n\"POISON!\"\n\"POISON!\"\n\"POISON!\"\n\"POISON!\n\nI was at the park, shake, breakin and takin 'em all\nAnd that night, I played the wall\nCheckin' out the fellas, the highs and lows\nKeepin' one eye open, still clockin' the hoes\nThere was one particular girl that stood out from the rest\nPoison as can be, the high power chest\nMichael Biv here and I'm runnin' the show\nBell, Biv DeVoe \n..now you know!\nYo, Slick, blow..\n\nIt's drivin' me out of my mind!\nThat's why it's HARD for me to find\nCan't get it out of my head!\nMiss her, kiss her, love her\n(Wrong move you're dead!)\n\nThat girl is (Poison)...\nNever trust a big butt and smile\nThat girl is (Poison)..\n(\"POISON!!\")\n\nYo' fellas, that was my end of..\nYou know what I'm sayin', Mike?\nYeah, B.B.D. in full effect\nYo', wassup to Ralph T and Johnny G\nAnd I can't forget about my boy, B. Brown\nAnd the whole NE crew\nPoison..",
 "image": "https://images.genius.com/1c4b7079dcf62b5a837177eb112f6d71.600x600x1.jpg"
}