{
 "title": "The Mission",
 "album": "Legal",
 "year": null,
 "lyrics": "(We're on a mission) --] Salt-n-Pepa\n\nThis is a mission, not a small time thing\nLet me tell you 'bout what happened when the phone went ( *ring* )\nWell, I was coolin at the crib with this girl Suzanne\nAnd everything was goin just accordin to plan\nWhen the phone rang - yo, I couldn't believe it\nTold myself to ignore it, forget it, leave it\nJust when things had started goin great\nIt rang again I said, \"Hold up, wait\"\nPicked up the phone, yelled, \"Who the hell is this?\"\nSomebody said, \"This is serious business\nThere's a tape in the mailbox between your doors\nTake the tape from the box, and put it in yours\"\nI listened to the tape and my mouth just dropped\nI picked up the phone, but the man hung up\nIt said, yo, 'this tape will self-destruct'\nI pressed the deck, but the tape was stuck\nOh well, what the heck, I just cleaned up the mess\nOpened up the closet, got the bullet-proof west\nLoaded up the sawed-off, the double-barrel\nThe rambo knife with the hunting apparel\nThrew on the trench, kissed the girl good-bye\nShe said, \"Special Ed, don't go, you might die\"\nStarted cryin and huggin on me, so I shot her\nI said, \"Sorry baby, but I gotta do what I gotta\n(You're on a mission)\nDo what I gotta\nThis is a mission, not a small-time thing\n\nTook the express on a air force jet\nThe thoughts in my mind broke me out into sweat\nI was thinkin of the message again and again\nIn particular the name of Lu Chin Chen\nYo, I landed in Japan with intent to kill\nYou could tell I wasn't jokin by the look on my grill\nTook a look at the picture of the man that I was after\nA 5 foot 10 black-belt karate master\nKnew where to find him, knew where he would be\nI turned around and showin up Mr. Chen found me\nI looked him in the eye with a stare so cold\nI said, \"I came to revenge for the rhymes you stole\nNow you must die, because that is my mission\"\nHe flipped back, got into a fighting position\nThe tiger style, the shit was wild\nHe threw his hands in the air, he started to smile\nI said, \"You can smile now, but you won't for long\nCause sucker, you'll be sorry that you stole my song\"\nHe said, \"Choose your style\", I broke fool, I said, \"What?\"\nPulled out the knife, tried to shove it in his gut\nIt didn't even cut, I flipped, I started buggin\nPulled out the hand gun, I shot a slug in\nHis chest, he said, \"Buddah bless\" and stood proud\nOut shot the bullet, Mr. Chen just bowed\nSo I shot him again - yo, I couldn't believe\nMr. Chen caught the bullet in this two front teeth\nYo, he kicked me on the floor just like I was a child\nI got fed up, I fought him Flatbush Style\nStood to my feet, threw my hands to the sky\nShaked him then, I faked him, then I caught him in the eye\nHe started stumblin, yo, I started wildin\nHe tripped, busted his lip, I started smilin\nKnew he was defeated, but I wasn't done yet\nSo I shot him with the shotie, then I jetted in the jet\n(You're on a mission)\nJetted in the jet\nThis is a mission, not a small-time thing",
 "image": "https://images.genius.com/10bfbf32f3ce521969c518ae4d922594.500x500x1.jpg"
}