{
 "title": "Charm Offensive: Reviving Interpersonal Elegance in a Snapchatty Age",
 "album": null,
 "year": null,
 "lyrics": "Diana Vreeland was very charming. At the time the peerless fashion avatar and I first met, I was quite feral and schlumpy. After five minutes in her company, I felt as if I had suddenly donned spats and a cape, that’s how charming she was. Like all the great charmers, she had a gift for ratcheting up the joie de vivre experienced by those around her. Hers was an invitational charm with a clear message: Life is a freaky, fantabulous Mardi Gras, and you would be insane not to dig your Lee Press-On Nails into a passing float and climb aboard.\nThough stratospherically charming, DV was not the most charming person I have ever met. That particular honor goes to a bloke you have never heard of. His name was Gerald. He was a not-very-successful mature male model who lived upstairs from me in gritty South London back in the 1970s.\nA World War II vet, tall, mustachioed Gerry embodied the role of distinguished older gentleman, not only in catalogs but also in real life. He looked charming, and he spoke charmingly. He was, whether engaging in light badinage in the local butcher’s shop, recalling the horrors of WWII, or relieving a silver-haired broad of her chinchilla stole whilst thrusting a moderately priced bottle of sherry toward a camera lens, a paragon of charm in every situation—take my word for it.\nIn fact, you have no choice. While I can offer you myriad charming Gerry recollections, I am unable to cook up a theory of how his charm actually functioned. A mysterious combo of wit, poise, and self-deprecation, Gerry’s charm was like thistledown, floating away whenever you try to snag it and dissect it. The dictionary defines charm as a power of pleasing or attracting, as through personality or beauty. Sounds like old Ger to me.\nPeople today are actually quite pleasant and considerate. They are just not charming.\nIt’s telling that in order to find examples of charming individuals I am obliged to take a skip down memory lane—an extended one. Gerry and DV are long dead. Clearly, charm is not a 21st-century attribute. It is a lost language, a forgotten skill. How did this happen? It’s not as if the population has become totally horrid or naff—far from it. People today are actually quite pleasant and considerate. They are just not charming.\nHere’s my stab at why: The digital revolution has sped up, flattened out, and depersonalized communication, stripping away the necessity of charm. When rapid-fire emails have replaced lengthy imploring epistles, who needs charm? When sexts precede conversation, who needs charm? When nobody feels an obligation to entrance/allure/captivate anyone else—now that we all suffer from high self-esteem, we cannot wrap our heads around the idea that another individual might need to be “won over”—what use is charm? Human interaction was once a proud, fluffy, prize-winning chicken; now it’s a simple paillard thereof.\nIn addition to the fact that charm no longer plays a key role in one-on-one situations, it has also vanished from group dynamics. Whether you were lolling around a literary salon or boozing in some squalid gin palace, charm used to be the grease that lubricated a dull social evening. Charming those around you was seen as good manners, a social obligation. Cut to today: If things go a bit soggy, we pull out our phones and perk things up with a little social media blitz. Who can be bothered charming others when you can amuse yourself with selfies? :(\n\nIntroduction\nEven if today’s millennials—a pleasant, smart, ambitious, and altruistic bunch, but not charming—wanted or needed to be charming, they no longer have the opportunity to learn how. When the digital revolution dispensed with all that endless face-to-face communication, it also nuked most opportunities for the acquisition of charm from a charming elder. I was fortunate: I received my charmducation osmotically, effortlessly, courtesy of Gerald the model. On rainy Sundays we would engage in lengthy tea-drinking tête-à-têtes during which I was able to observe the master and receive the baton. (Pardon the expression!) If Gerry and I were neighbors today, we would be hunkered down on separate floors, charmlessly WhatsApping each other once a month.\nHaving demonstrated so convincingly why charm has become an obsolete commodity, why am I braying for its return? Why am I thrusting Gerry’s charm baton in your direction?\nFirst and foremost, charm gives one a competitive edge. Whether you want to seduce somebody or sell that person something (or both), a little charm will, now that it has become endangered, give you a distinct advantage. Here is an au courant example: In NYC Uber cars are eclipsing yellow cabs. Why? Uber drivers look good, smell good, and greet customers with a smile. They are, in other words, almost charming. The result? Those poor, grumpy, monosyllabic yellow cabbies are in a death spiral. If I wasn’t so busy wearing spats and eating lotuses, I would open a charm school just for them.\nSpeaking of charm schools: In the 1980s I once attended the graduation gala of a charm school in Tokyo. All the students and teachers had taken the stilted, archaic 1920s idea of charm and run with it. This made for an unforgettable evening. Cigarette holders and champagne glasses were held aloft. Long pearl necklaces were knotted and windmilled. Chiffon hankies dangled from bangles. Heads were jauntily angled in imitation of art-deco flapper figurines. The entire experience was like being locked in a Japanese production of Thoroughly Modern Millie.\nIn many people’s minds the concept of charm is inexplicably intertwined with the deranged formality and theatrical refinement I witnessed at that Tokyo academy. In order to revive the concept of charm, I will need to update it. In this series, I will take the smarm out of charm. I will also take the marm out of charm. My charm will be a brave new charm, a charm for the digital age. My charm offensive will prove that charm can be shekeltastic. Charm can be modern. Charm can be naughty. Charm is a feel-good thang, and the charming shall inherit the Earth.\n\nHow to become an intensely interesting interlocutor.\nPeople are talking funny. Men are mumbling and grunting à la True Detective. Women are shrieking and bleating like confused, pampered sheep. And—here comes the really insane part—both genders are somehow managing to either grunt or bleat while maintaining a mysteriously blank affect. The emotionless facial expressions displayed by today’s young moderns during conversation are borderline Warholian. (I went borderline Warholian once. Nasty condition, but nothing a bit of light rebirthing and a wheat germ colonic couldn’t cure.) It’s so not charming.\nSimon Doonan Simon Doonan\nSimon Doonan is an author, fashion commentator, and creative ambassador for Barneys New York.\nConversational charm is very much the antithesis of Warholian detachment. Conversational charm requires animation, parry, and dazzle. Conversational charm needs uppers, not downers. It’s about hamming it up and blurting out great aphorisms. It’s about passionate engagement, ribald observations, heartfelt empathy, and the occasional whoopee cushion. It’s wildly un-Warholian. My goal, as you have no doubt guessed by now, is to banish the grunt, the bleat, and the blank—to bring back conversational charm.\nStep One: Check your tone\nStart by make an objective evaluation. Record yourself on your phone and then listen. Better yet, just ask your pals for a brutal assessment: “Am I McConaughey grunty? Am I bleaty and Kardashian-esque? Am I a Dietrich or a Diller—as in Phyllis?”\nLadies first: Chances are your voice is rather more plangent than you realized, especially if you have been raising children. (Subtle vocal stylings do not work on recalcitrant brats.) Don’t panic! Dragging your voice out of your nose and back into its natural home—your chest and throat—is far easier than you think …\nStep Two: Sound like Simone Signoret\nSelect a vocal icon with a deliciously modulated film-noir voice—Joan Crawford, Anne Baxter, Barbara Stanwyck, take your pick—and watch a movie or two. My personal recommendation would be Lauren Bacall. No apologies for the old-school, old-queen movie references. Film noir femmes had beautiful voices. Today’s thesbots? Not so much.\nLet Betty Bacall’s magnificently modulated instrument guide you toward vocal charm. Remember: Out of the nose and into the chest. Imitate her colorations and nuances, and breathe, and, if necessary, smoke too. After a matter of minutes your grating shriek will be transformed into a mesmerizing, cinematic sonata.\nAnd now, lest I be accused of mansplaining, let’s give the menfolk a shot of tough love. Fellahs! Your voices must, if they are to ever become audible again, travel in the opposite direction to those of the ladies. Less grunty chest, more throat and nose. And let’s not forget to vanquish the Warholian detachment. Instead of channeling Andy, how about serving up a little 20th-century British stagecraft? Declaim like Gielgud! Enunciate like Olivier!\nStep Three: Naughty Nancy, Naughty Nancy, Naughty Nancy\nNow that y’all have found your new vocal registers, road-test those little puppies with the following classic tongue twisters: “Rubber baby buggy bumpers.” “Hot toast. Hot Toast. Hot etc.” “A big black bug bit a big black bear.” Video the results, and marvel at the charming transformation.\nStep Four: Banish the boredom\nYou and your new voice are now ready to address the most important, deal-breaking component of conversational charm: conversational content, by which I mean knowing what’s dreary and what’s not. For centuries conversational charm was viewed as a minuet. Observe the fuddy-duddy Downton Abbey choreography and the rigid etiquette (avoid arguments, gossip, and politics; keep your legs nicely crossed; and don’t waive your hands about like a seal) and c-h-a-r-m, a veritable river of honey, would be the inevitable result. Here’s the truth: Twee conventions and dusty formality are never charming and never were. Knowing what’s boring and what’s not is, circa 2015, the only thing that matters.\nThe ability to edit out the quotidian is, I am sorry to say, currently in rapid decline. When everything can be reduced to a text line, everything is, and then everything starts to look the same. Mundane activities acquire the same weight as fascinating occurrences. Since fascinating occurrences are infinitely less frequent, mind-numbing minutiae prevail. The proliferation of mind-numbing minutiae has, horror of horrors, spilled over into actual live, face-to-face conversation: “So the train was running late, which was OK because it gave me time to get a coffee, but they had run out of half-and-half, not the first time. Anyhoo, the train … ”\nCharming conversation is the opposite of turgid, autobiographical minutiae. Charming conversation requires a blitzkrieg of massively profound ideas. A charming conversationalist issues large talk gambits with questions attached. For example: “I dreamt I was watching a woman putting on gloves. I found it strangely arousing. Have you ever experienced anything like that?” Or: “I spend 60 percent of my day in an existential crisis. You?” Or: “I still feel compelled to hide my TV in an armoire. Is this a self-loathing bourgeois trait?” And finally: “I was asked out on a date by an unlicensed fitness professional. Should I hold out for a licensed one?”\nTop Comment\nIt's like we're supposed to get a prime seat for brunch at the corner bistro in the gayborhood and take notes.  More...\n-MuckyDuck\n143 Comments\nJoin In\nOne final dingleberry of advice: In order to cut through the cackle and make your gorgeously modulated voice heard, it will behoove you to jump-start every conversation with a charming signature opener. A signature opener will galvanize your conversee and declare outright war on tedium. An ultracharming friend of mine precedes every conversation by addressing her conversational target as “TREASURE!” Part nickname, part blandishment, part rallying cry, “Treasure!” is a wake-up call. When you hear, “Treasure! How are you?” you, the treasure in question, know that you must gird up for a rip-roaring cracker of a conversation.\nOver the years I have deployed a series of signature openers. “Flower!” worked great in the early ’70s. By the time punk rolled around, I had graduated to “Cherub!” Cherub was abandoned when my friends started thinking I was commenting on their middle-aged weight gain, at which point I graduated to the more innocuous “Petal!” where I remain today. Feel free to steal my Petal. Better yet, hurl some suggestions of your own into the comment box.\nAdvance your personal style from abject to alluring.\n\nNormcore, the recently coined term for dressing with exaggerated, logo-free simplicity, has many advantages: It’s convenient, anonymous, and low-risk. But is it charming? No, emphatically no.\nSimon Doonan Simon Doonan\n\nDefenders of this and other understated approaches to personal style—I can’t help feeling there is a dotted line between the fresh-faced millennial normcorers and those aging, leathery-faced, WASP-y prepsters who dress with equally purposeful anonymity—loathe overtly fashionable dressing and believe that it cheapens the wearer. (I myself enjoy being cheapened every now and then, but, hey, different strokes.) They believe that a subtler approach reveals and even highlights the charm of the person beneath the threads. I fear they may be wildly overestimating the charm potential of the average wearer. When it comes to schmattas, we inhabitants of planet Earth need all the furbelows we can get—a dollop of flamboyance, a burst of glam-rock sass—especially if we wish to appear charming.\nAdding charm to your appearance has become infinitely more challenging in recent years. The style landscape has turned into a seething ocean of conflicting trends and infinite choice. Small wonder that so many have thrown in the Versace towel and taken a vow of normcore. Embarking on a charm-quest, particularly if it involves sartorial experimentation, can be scary. Your only hope is to climb aboard my raft, cling to me and beg me for guidance. Well, it’s not your only hope, but it’s not a bad place to start, right?\nIn order to simplify the process, I have elected to get acronymic on your asses. How do you spell charm? Let me break it down for you.\nC is for chapeaux\nUltra-charming fashion photographer Tim Walker snapped this year’s Oscar contenders for the recent issue of W magazine. As I gazed at Tim’s multiple spreads, I found myself overwhelmed by the charm of the images. ’Ere long I realized why: Whether she’s wearing a massive tomato sombrero (Reese Witherspoon) or a sleazy ’70s jersey turban (Amy Adams), almost every single thesbot is sporting glamorous headgear of some description. Those predicable torrents of tortured coiffure—red-carpet porno-tresses, extensions, wigs, and weaves—had been replaced by a charming cavalcade of coquettish chapeaux. The fact that hats have fallen out of favor in recent years (for the first half of the 20th century people rarely left their houses without plonking something or other on their heads) only adds to their charm. Conclusion: The quickest and easiest ways to charm up your appearance? A jaunty cloche, a Joan Collins-y Dynasty entrance-maker, a Tyrolean trilby, or a floppy fedora.\n\nH is for handbags\nFreud claimed that handbags, if they appeared in one’s dreams, were vaginal symbols. This sounds like a crazily provocative, uncharming thing to say, until you mull it over and realize that it makes perfect sense. Handbags are mysterious, closed, and closely guarded. You do the math! However, just because an accessory has genital resonance does not mean that it can’t be incredibly charming. Au contraire! There is no shortage of charming handbags in the universe this season: Moschino’s Chanel-meets-McDonald’s quilted pastiche and Anya Hindmarch’s Tony the Tiger cereal box totes are my personal faves. If you can’t afford designer prices then snag a ridiculously charming vintage Enid Collins embellished purse on eBay.\nA is for Americana\nLots of American women still cling to the notion that charming style is a French thing. This kind of masochistic Francophilia has no rationale. The reality is that American women are far more stylish, and certainly less grumpy, than their French sisters. Truth be told, French women are secretly jealous of America style, and with good reason. Did France create Western style, hippie style, sporty Adidas style, or hip-hop style? American style genres are the envy of the world and infinitely more charming than all that much-vaunted bon-chic bon-genre. If proof is needed, please enjoy this clip of Lee Remick extolling the smartness of her nifty rodeo look in Anatomy of a Murder.\nR is for rainbow\nAs a veteran fashion person who has been through many dark punky periods, I can tell you honestly, without fear of contradiction, that the color black—the chosen hue of the fashionrati—is fundamentally uncharming. An old-fashion sage once told me that she switched from black to white, “because my guru told me that my black clothes were shriveling my internal organs.” Charmed, I’m sure.\nBlack is chic. Black is satanic. Black is severe. Black is ecclesiastical. Black is intellectual and majestic. But charming? Not so much. Primrose yellow, on the other had, is madly charming, as is Pepto-Bismol pink, fluorescent chartreuse, and even teal. If you want to increase your charm quotient, simply turn up the Technicolor. #Pucci.\nM is for maquillage\nRecent decades have seen a very uncharming development in makeup: I call it the spackle effect. It’s a function of our growing terror of aging. In the old days, makeup was used to add an exotic allure: Think Maria Callas eyeliner, exotically exaggerated Siouxsie Sioux eyebrows, or emerald-green and peacock-blue Fellini-esque lids. Now makeup is used to conceal flaws and “reduce the appearance of fine lines and wrinkles.” This is all very uncharming. Theatrical makeup is always a delight. Blokes too. A swarthy dude with a smokey eye? #freddiemercury #rockercharm\nSo there you have it: C.H.A.R.M. You have now completed the personal style component of my charm-school syllabus. Congratulations! Your appearance has now been reimagined, or at least violently jiggled. All that’s left is to pop the cherry on the sundae—we need to talk about the art of the signature flourish.\nMiley Cyrus has her tongue. Man Repeller has her dungarees. Nick Wooster has his twirly moustache. Kim has her bum. Iris Apfel has her giant specs. In order to make the most of your style/charm potential you need to adopt a charmingly memorable signature flourish. You can buy all the Tony the Tiger purses and Tyrolean fedoras you want, but if you do not have a little proprietorial quelque chose d’autre, then quelque chose is lacking. How about a monocle? Mismatched gloves? Red fishnets? A beauty mark? Those readers who already have a charming signature flourish—mine, by the way, is my collection of floral Liberty print shirts—should kindly reveal it on the comments page for the inspiration of those charm-seekers who have yet to find theirs.\nOver the last 50 years, office culture has evolved beyond all recognition. Profanity, bottom-pinching, and unrestrained boozing have all been vanquished from the workplace by the trusty HR departments of corporate America, and just as well. I could handle the swearing, but my liver and my bottom had had enough already.\nAmong the many changes that have taken place, the biggest and least charming concerns interpersonal communication—by which I mean the total absence thereof. Workers across the globe now spend their days in charmless monastic seclusion lost in a cloud of emails, to mention nothing of wasting eons of company time updating their Facebook pages with frolicsome, sun-blistered Cancún vacation snaps. Reintroducing charm into this drab, Orwellian environment will take commitment and verve; so stiffen the sinews and summon the Spanx, and let’s get on with it.\nWe’ll start by confronting the elephant in the typing pool, the total lack of face-to-face communication. There’s only one way to address this issue: a short, brutal course in exposure therapy. Take my hand, and let’s walk together into the lion’s den, aka another person’s office.\nStart by wordlessly alighting in the doorway of the targeted office. Extend your right arm into the air in a circular motion and grab the door frame, as high up as possible. This will attenuate your physique and make you appear lithe and attractive. Place your left hand on your hip and smile, and wait. As soon as your colleague clocks your presence, drop your arm, glide forward, and park one previously pinched buttock insouciantly on the colleague’s desk corner.\nA few retro conventions will soon have your entire organization vibrating with charm.\nImagine you are encountering a feral toddler. Remember that your visitee has probably not had any direct contact with another colleague in months, if not years. Start with a compliment or two. Next, why not share a few lighthearted observations about current affairs? But nothing too controversial. Follow this with a little badinage and dollop of persiflage. Do not expect much in the way of a response, and don’t exhaust your visitee by overstaying your welcome. Little and often. Now slither off the desk and reverse charmingly and mysteriously through the aperture whence you came.\nOnce you have broken the ice and are on speaking terms with your colleagues, the real charm offensive can begin. My approach is unapologetically retro: In order to put the charm back into America’s offices, I believe we must revive certain dusty office conventions of the 1950s. There are kernels of reverse-chic wisdom in that Mad Men office etiquette—those pre-computer conventions and mores—that will soon have your entire organization vibrating with charm.\nLet’s start by bringing back formality. In the late ’60s, my first U.K. retail job was in the John Lewis department store chain (where the motto was Never Knowingly Undersold and none of us knew what it meant), and we employees addressed each other as Mr. and Miss and Mrs. like on the Brit comedy series Are You Being Served? Reviving this convention, especially if the location were in a youth-centric hipster startup Brooklyn or Silicon Valley milieu, would be unexpected and undeniably charming: “Oh. Mr. Roberts, we are running out of cash to fund the office cold-press juice bar. Grab Mr. Welch and Miss. Dingle and Mrs. Davenport and let’s go out for another round of financing.”\nNext, bring back tantrums and hissy fits. In the past, it was not unusual for one’s boss to wig out on a regular basis. It was written into the job description. Today this is unheard-of. Confrontational or aggressive behavior is virtually extinct. This is a good thing in certain ways, but there is a downside: An entire generation is in danger of reaching retirement age without ever having had the pleasure of watching a pompous boss implode with indignation. Sound paradoxical? Watching the office high-ups crack under the pressure of “life at the top”—thereby exhibiting infantile vulnerability—is charming and undeniably comical. So let’s bring back boss-rage, cautiously and carefully, and in a controlled environment where the emotions are directed at inanimate objects rather than fellow employees. With that in mind, why not instigate a monthly piñata day? The blindfolded bosses can indulge in a rocks-off whack attack, whilst surrounded by mocking minions.\nIn addition to therapeutic aggression, a more playful approach to language will, especially now that we are all going to be talking to each other once more, add charm to any workplace. For example, you’ve all heard of Polly Paranoia. Well how about Priscilla Promotion, Belinda Budget Meeting, Molly Marketing Department, Sally Stapler, Sheree Shredder, and Trixie Travel Policy? This seemingly idiotic trope—I call it radically feminized alliteration—will add charm to the rainiest day. “Have you seen Wendy Weather Forecast? Denise Deluge!”\nAnd then there’s Dolly Distraction. In addition to a screamer, every office used to boast a chronic time-waster. This underoccupied pest would walk the hallways looking to subvert busier colleagues, and, as a result, was universally loathed. Interrupting people was considered very bad form and deeply uncharming. Fast-forward to today, when the idea of an office pest has a certain allure.  A person whose sole function is to snap fellow workers out of their screen-centered fugue states will be performing God’s work.\nLastly and most importantly, let’s bring back the WHILE YOUR WERE OUT pad. Yes, it would no longer serve a real function, but don’t you miss those little pink charmers? For the benefit of younger readers, permit me to explain. Back in the day, if one stepped away from one’s desk and one’s phone rang, one’s colleague might well leap over and answer it. This was done not to be helpful but rather to terminate the diabolical jangling. (For some reason phones used to be deafeningly loud. Think fire alarm.) Having answered your phone, your colleague would scrawl the message and number onto a pink slip emblazoned with the words WHILE YOU WERE OUT and slap it on your desk. The downside: After a two-week vacation, you would return to encounter a pink Matterhorn of WHILE YOU WERE OUT slips. The upside: These missives were invariably scrawled with such haste and uncharming resentment that they were all illegible, thereby relieving the recipient of the need to respond.\nA cheap and cheerful guide to domestic charm.\nTo the outside world, we all strive to present a cheery, optimistic, well-groomed persona. Good Day! You look mahhvelous! Dinner? I’d love to! We work extremely hard to ensure that others know nothing of the real us, the Hieronymus Bosch us, the doltish, dark us which slouches about behind closed doors. Home may well be where the heart is, but it is not where the charm is.\nSimon Doonan Simon Doonan\nHome is where we guzzle cooking sherry, and where aging brassieres are rinsed and draped over rusty radiators. (You know who you are.) Home is where we sulk and binge-watch The Wire for the 20th time whilst sporting preposterously frowzy, hagged-out velour loungewear. Is it possible to introduce charm into this black hole of mood swings, stale pizza, and unopened mail? Yes, emphatically, yes. The bar is so low that the only way is up. When you are living in a veritable Kienholz installation, adding one teensy Glade air-freshener plug-in can add a massive helping of international savoire-faire. More good news: Introducing some charm to this quagmire is not only doable, it can also be creatively rewarding.\nMost homes will, first and foremost, benefit enormously from the introduction of a moderating presence. The average person makes more of an effort to be charming—duplicating all the hearty bonhomie of those public personas—when there is a third party present. Keep in mind that most of us are at our most charming with strangers rather than familiars. As a result, you may get the best results (and a cash benefit) if, rather than introducing a relative or friend into the mix, you take in an unknown lodger. Once your ornamental moderating stranger is firmly ensconced, you may embark on a more detailed step-by-step domestic charm offensive.\nStep one: A bowl of fruit. Think Caravaggio! Think Cézanne! I am talking about placing a large carefully arranged bowl of fruit in a prominent location. My mother Betty was a big believer in the notion of fruit as mood-improver and general life-enhancer. Nothing says, “Welcome! Look how charming, soignée, and free from existential angst this house is!” quite like a mound of fruit in the center of your dining table. Arranging a bowl of fruit can be just as creatively rewarding as flower-arranging AND you get to eat the result, which is more than can be said of flowers, which taste appalling, especially peonies.\nHome may well be where the heart is, but it is not where the charm is.\nNext let’s address the soundtrack to your home. Keep in mind that sound has enormous charm-power. The grimmest walk-up and the dankest trailer can be rendered more livable by the introduction of tinkling water, wild pachanga music, or soothing birdsong. Your ornamental stranger may be enlisted to help. Offer your lodger a kazoo and a glass of cooking sherry and see what happens.\nDo not overlook the fact that Charmin can be charming. Yes, it’s time to head to your bathroom. Upgrading to a more haute couture brand of toilet paper can significantly improve the charm-factor in your crusty WC. Another bathroom idea: When guests come over, place some glamorous personalized hand-towels next to the sink. Instead of printing them with your initials—that’s a bit naff, right?—why not emblazon them with a favorite poem, or a bastardization thereof:\nI must go down to the sea again,\nto the lonely sea and the sky;\nI left my shoes and socks there—\nI wonder if they're dry?\nIf custom paper hand-towels are beyond your budget, then steal a stack from the bathroom of your favorite posh restaurant or glam hotel. In addition to hand-towels, they also make lovely dinner napkins. OK, that’s a slight exaggeration; they make adequate dinner napkins.\nOlfactory charm: As noted above, a Glade plug-in can do so much to up-charm your bathroom and any other rooms in your abode. Spraying a favorite perfume—my fave is Sables by Annick Goutal, because it smells like cooking sherry, an emerging leitmotif in this charm guide—onto your light bulbs can also do the trick. Just be sure not to deluge an illuminated hot bulb, as this will cause it to explode with truly uncharming consequences. Cash-strapped fragrance-seekers should try the following: Place a Ziplock bag in your purse every morning, and fill it with scent strips torn from any magazines which cross your path throughout the day. Upon returning home—don’t forget to toss a charming greeting in the direction of your moderating influence—empty the contents of your bag onto the radiator (after removing those crispy brassieres, of course). ’Ere long, your entire pad will be redolent with a heady blend of freshly marketed fragrances.\nFinally, let’s talk interior design, or party décor as I prefer to call it. Mylar curtains will add a shimmer to any doorway. A Jeff Koons–ian cluster of colored helium balloons will enliven a dismal empty corner. Paper pineapples never fail to perk up a prewar pantry, and nothing, nothing, is more charming and easier to install than colored lanterns. They are right up there with bowls of fruit and brassiere-free radiators. Festoon the ceiling of your boudoir, recklessly, randomly, and chaotically, with strings of these romantic little charmers. No straight lines. Remember: Anal retention is not so charming. A little dégagé is always delightful.\nMy charming conclusion? Charm can be cheap. When it comes to adding charm to the home, you absolutely do not need wheelbarrows full of cash. Heavy, expensive wall-to-wall megadécor can, in fact, be quite uncharming. Holly Golightly had it right. Her bare bones apartment—a sawn-off Victorian bathtub, a packing-crate coffee table, and a molting zebra rug—were the very essence of charm. Of course, the zillion-dollar Hubert de Givenchy couture wardrobe didn’t hurt either.\nEngaging emojis and other points of digital charm.\nDo you have digital charm? Is there such a thing? No, I am not talking about doing attractive things with your fingers, even though doing attractive things with your fingers can be very charming. Why, only the other day I was captivated by a YouTube video of a bloke named P’nut doing this new (to me) thing called Tutting (as in King Tut), which is kind of like voguing, but just for the fingers. Very charming, yes, but that’s not the type of digital charm of which I write today.\nSimon Doonan Simon Doonan\nI am talking about the screeching, glaring absence of charm on the electronic superhighway, the interweb, rabbithole.com. Whatever you choose to call it, you have to admit, the online world is a charm-free zone. Cat videos and Candy Crush Saga are about as close as it gets to charm. It’s mostly naff, and when it’s not being naff, it’s being homicidally vituperative, and that’s just me emailing my husbear about how we should cook the Brussels sprouts for dinner. Clearly it’s time for an online charm-olution. Let’s make charm the new hate. Why? Because flowers are objectively more appealing than dog poop, and life is short, and excuse me, but what else have you got going on? Nothing much if you are reading this article.\nI propose we start by bringing back that old standby, the calming euphemism. The Internet, in case you haven’t noticed, has a penchant for outsized reactions. Alarm, scorn, rage, terror; these are the lingua franca of the WWW. Whenever controversy or catastrophe strikes—my SoulCycle class is totes sold out!—screen-centered millennials clutch their pearls and let forth a stream of OMG overly honest Facebook posts; texts; and bold-faced, exclamation-laced emails, thereby making eventualities both big and small seem a billion times worse. In the past this was never the case.\nIn the pre-Internet world, reactions were muted, tentative, and wrapped in calming euphemisms. Shit-storms were neutralized with Maggie Smith–ian understatement. Why? Because all communication was taking place in person, and if you and your catastrophic tidings caused somebody to have a seizure, you would be the one administering mouth to mouth. As a result, the ability to deny impending doom and to repackage an unqualified disaster as “a bump in the road” was once considered vital for social and professional success. So let’s ditch the OMGs and bring back that dignified, euphemistic denial.\nNext topic: folderol. Today’s young moderns may be unable to moderate their reactions to life’s unforeseen challenges, but when it comes to making simple requests, they, paradoxically, become incomprehensibly formal and reticent. Sample email:\nHow are you? Haven’t seen you in such a long time. Hoping you’re managing to stay warm during all this sleet and snow and getting some quiet time with all your nearest and dearest—so important at this time of year—wherever they may be. We have all become so global and think nothing of hopping on a plane, but all the same it’s hard when family support is flung to the far corners of the Earth, many of which are also experiencing their fair share of bad weather. Anyhow, the reason I am emailing you … \nThe impulse to preface a simple ask with reams of folderol is a commendable attempt to deploy charm, but it fails miserably and is counterproductive to the goals of the folderoller. Trust me, the recipients are screaming the words You crazy bastard/bitch, just spit it out!!! while reading your faux-genteel preamble. They would be much more likely to comply with your request if you just stripped away the doilies.\nAnd now, about compliments. Everyone loves them, or rather used to, back before they were outlawed. One is now terrified to give them, especially online where they live forever and can be accessed at a later date and used as evidence against one. The same person who will dole out the are-you-managing-to-stay-warm folderol will, because of fear of harassment lawsuits, be very reluctant to hurl a full-throated compliment in your direction on Facebook or via email. This is a tragic situation that needs to be rectified. However, in order to dole out a digital compliment—lacking the nuances that come with spoken delivery, online compliments are always more prone to sinister interpretation—it’s important to avoid anything that might read as creepy.\nExample of a creepy compliment: You have a heavenly aura. I would like to see you riding a unicorn bareback through a field of sprouted onions.\nExample of a charming compliment: For an older broad/dude, you sure have kept it together. Just sayin’.\nEmojis have megacharm, but only if used clunkily and ineptly.\nWhich brings us to Tinder and sexting and all that shagadelic stuff. While I am an expert Instagrammer—follow me at simon_doonan—and find it to be a benign and frivolous medium, I confess I have no familiarity with the ever-widening erotic social media landscape. Is it possible to introduce charm into these new and naughty methods of courtship? I am unqualified to opine. Calling all sexy sexters! Any tips for up-charming hookup.com? Please enlighten me, and other readers, with your sassiest do’s and don’ts in the comment box.\n\tWhether sexy or sedate, by far the easiest way to add a little charm to your daily communications is by tap dancing on your emoji buttons, and when I say tap dancing, I really mean clog dancing. Emojis have megacharm, but only if used clunkily and ineptly. Slick, efficient emoji use is not charming. I discovered this accidentally. Having no real understanding of what the various emojis signified, I would just send the colorful ones that caught my eye. I was especially fond of that pretty pink one—a cleavage? a ’90s Alexander McQueen bumster butt-crack trouser?—and pasted it willy-nilly. The recipients were delighted because they assumed they were being panted at (turns out it’s a panting tongue), or that I was an idiot, or both.\nAnother tip: Don’t be literal. Sending the hospital emoji to somebody who is undergoing a procedure is gruesomely uncharming. A sick person would far rather receive one of my signature enigmatic-but-jolly random emoji combos. Who doesn’t love a warthog coupled with an exploding party hat? What could be more charming?\nSo there you have it. The End. My charm offensive has now charmed up all aspects of your life. Let’s briefly recap the key points:\nCharm is a paper lantern, a smoky eye, a jaunty chapeau, or a pair of blood-red fishnets … and that’s just for the men. (Charm is making the old and that’s-just-the-men joke over and over again until your audience is begging for mercy.) Charm is underdecorating like Holly Golightly. Charm is democratic because charm is cheap.\nCharm is also talking not squawking (women) and declaiming not mumbling (men). Charm is popping up out of your seat and conversing directly with the person in the next cubicle. Charm helps you win friends and neutralize enemies.\nAbove all else, remember that charm is sustainable. It is not finite. Think of it as a bargain-priced, bottomless tub of marshmallow fluff. So take flight and flit from person to person, depositing little glistening, sugary dollops of charm wherever you go.",
 "image": "https://assets.genius.com/images/default_cover_image.png?1618862777"
}