{
 "title": "ABC-123",
 "album": "For Real Tho’",
 "year": "1993-03-16",
 "lyrics": "See, there comes a time in every man's life when he's got to fall in love\nAnd he's got to find the right woman and I think I found it in you\nOh, oh\nWoke up this morning to breakfast in bed\nThe coffee was hot and the eggs I got was right, so right\nGirl, I gotta tell you that you're just too good for me\nOh, the things that you do makes it easy loving you\nEven a blind man could see.  Oh, oh\nEvery night, I get down on my knees\nAnd give thanks for you for the things that you do\n'Cause only a fool would let go of you.  (Sing my song, baby.)\nLoving you (Loving you) is so easy for me (Said) to do\nSaid it's like ABC.  (ABC)\nSimple as 123\nSaid that I'm loving you, girl, (just keep loving me.)\nOooh, keep loving me\n(Loving you is so easy for me to do.)\nIt's a shame that I, I love you, baby\nSaid it's like ABC (ABC) and it's like 123.  (123)\nSaid that I'm loving you, girl\nOh.  (just keep loving me.) Oh, baby, baby\nDriving in my car\nI see something that'll look good on you.  Oh\nSaid I can't ignore it, but hell, I can't afford it\n(Hell, I can't afford it.)\nWhat's a simple man like me to do\nIf you should ever leave me, I'll go out of my mind\n(Out of my mind)\n'Cause I want you (Want you) and I need you.  (Need you)\nAnd I don't wanna be wasting my time.  (No, oh.) No, no\nEvery night, I get down on my knees (Down on my knees)\nAnd give thanks for you, (Oh) the things that you do\n'Cause only a fool would let go of you.  (Sing my song.)\n(Loving you is so easy for me to do.) Ohhhhhhh, baby\nSaid it's like, it's like ABC, (It's like)\n123.  (Simple as 123.) (123)\nI'm loving you.  (I'm loving you, girl, just keep loving me.)\nKeep loving me.  (Loving you is so easy for me to do.)\n(From the bottom of my heart, yeah.) If you need me\nYou can call me on the pho-o-o-o-one\nIt's like ABC, simple as 123\nHeh, heh.  (I'm loving you, girl, just keep loving me.)\nOh.  Oh, oh, oh, oh.  Oh\nSaid I feel some love coming on.  (Feel it coming on.)\nSaid I can feel it way down deep in my bones\nAnd I wanna shout it on out (Shout it out.) from the mountaintops\nSaid I gotta, gotta, gotta let you know that I'm never gonna let you go\nI'm gonna keep loving you, (No.) 'cause that's all I want\n(Oooh, oooh, oooh, oooh, oooh, oooh, oooh.)\n(La, la, la deedle dee.  La, la, la, la, la.)\nLa, la, la, la, deedle, deedle, deedle dee\n(That's all I want, baby.) Together\n(That's all I want, 'cause we're so in love.) Together\n(Loving.) Oh, baby\nSaid I love you, baby.  (Loving you.)\n(Loving you is so easy for me to do.)\nSaid I wanna keep on saying I don't wanna beg\nSaid I wanna keep on saying I love you, I love you\nSaid I don't ever wanna lose you\n(ABC, 123.) Wanna give you my love, wanna give you my time\nThen I wanna keep coming, I'm gonna make you mine\n(Oh, my baby.) Hey, baby\n(Yeah.) Yeah.  (Oooh, oooh, oooh.) Baby, yeah.  (Yeah.)\nBaby, baby, yeah.  (Yeah.) Baby, yeah.  (Yeah, baby.)\nDon't ever wanna stop loving you, that's all I wanna do\nI love you.  (Loving you is so easy for me to do.)\nI give you all, I give you all my loving, baby\nIt's so easy for me to do.  (ABC, 123.)\n(I'm loving you, girl, just keep loving me.)\nI'm loving you, girl, so just keep loving me.  Hey, baby\n(Loving you is so easy for me to do.)\nI feel it way down deep in my toes, down in my soul\nSaid I never wanna let you go.  No, no, no\n(ABC, 123.) ABC (ABC)\nBaby, yeah.  (123) Baby, yeah\n(I'm loving you, girl, just keep loving me.) Baby, yeah, said I love you\n(Loving you is so easy for me to do.) I love you.  (I love...)\n(I love you, baby.) Oh, oh, oh, oh\nCan't never stop me loving you, baby.  (ABC, 123.)",
 "image": "https://images.genius.com/42840d8bb26398a8e1a17bafd669ebcd.500x500x1.jpg"
}