{
 "title": "Alright",
 "album": "Da Bomb",
 "year": "1993-07-13",
 "lyrics": "Just kick a little somethin' for them cars that be bumpin'\nSomethin' real smooth, hahaha\nYou can just ride to\nTell me how you feel\nHere we go...\n\nHold tight, hold tight, say we haffi hold tight...\nHold tight, hold tight, say we haffi hold tight...\nTell them Mista Cat, and him haffi hold tight\nTell them Kriss Kross, everyting is alright\nCome in the place and you feeling right\nThey come in the place and you hold your girl tight\nTell them Mista Cat, him a DJ tonight\nSay hold tight, tight and everyting is alright\n\nThe day seems nice and bright and everything feels alright\nWent to school without a fool tryin' to pick a fight\nI was loced out Kris Kross shirts and khakis\n(Lookin' and feelin' like nothin' but a Mac, see...)\nThe bell rang and I got my dash\nFellin' good cause it was the last day of school, and I passed\nNo moms trippin', so me and my mom went dippin'\nTo celebrate the fact that I wasn't slippin'\nThe downtown scene was packed\nPeople screamin' from they ride to my ride and to the Mac\nI says \"I am what I am, that's who I be\"\nAnd yall should have seen how they was tryin' to get to me\nCool, cause dissin' and no pay\nThey're the reason why we are who we are to this very day\nAnd all that love keeps me and Chris tight\nLong as we give some love back everything's alright\n\nHold tight, hold tight, tell 'em haffi hold tight...\nHold tight, hold tight, tell 'em haffi hold tight...\nTell them Mista Cat, and him haffi hold tight\nTell them Kriss Kross, everyting is alright\nCome in the place and you feeling right\nThey come in the place and you hold your girl tight\nTell them Mista Cat, him a DJ tonight\nSay hold tight, tight and everyting is alright\n\nNow everything feels alright when I'm rollin' through my hood\nAnd I see the one that used to do the dirt then turned good\nLittle kids try to be like me...\n(With the braids, the shades, some pants and some Nikes, G)\nAnd nothin' mo' better then a letter sayin'\n\"I'm your number one fan could you write me back man?\" Yesssss!\nI try to pass 'em my autograph\nI try to do as many as I can\nNow it feels good when I'm rollin' through my hood\nAin't nobody dissin' and a nigga thinks he's too good\nCause I'm down like four flat tires\n(Just a little nappy headed kid from the proj)\nShowin' I can do right and not do wrong\nRepresentin BG's and comin' up strong, and...\n(We ain't got no love for the side)\nWe only love those who love us back, right?\n\nHold tight, hold tight, tell 'em haffi hold tight...\nHold tight, hold tight, tell 'em haffi hold tight...\nTell them Mista Cat, and him haffi hold tight\nTell them Kriss Kross, everyting is alright\nCome in the place and you feeling right\nThey come in the place and you hold your girl tight\nTell them Mista Cat, him a DJ tonight\nSay hold tight, tight and everyting is alright\n\nNow people seem to think what I do is a blast\nCause I'm always on the road and I'm makin' some cash\nBut they don't know, really d'know\nThe pressure it is for some kids tryin to make it in this here biz\nEarly mornin' interviews then we step to school\nStep from school, back to interviews then it's on to other dues\nSo, warm it up Chris?\nI said \"Ya warm it up Chris?\"\nThat's what I was born to do!\n\nNow throw your hands in the air and wave from side-to-side\nIf the feelin' thatcha feelin', is the feelin' of pride\nSee, I ain't come out wack I came out right\nUnlike those moles who tried to \"Pass Da Mic\"\nIt's the Daddy Mac (Big baby!)\nEverything is real but you wanna diss cause a nigga sold a couple mill\n(Look here...) Ya can't say nothin' if ya last in a line\nSo when you diss it just lets me know I'm on your mind, and it's alright\n\nHold tight, hold tight, every posse hold tight\nHold tight, hold tight, every posse hold tight\nIt no matter if you’re black, it no matter if you’re white\nJust come in de house make we all unite\nTell dem Kriss Kross and dem a drop on de mic and make we dance until the morning light\nTell dem Kriss Kross a de people’s choice we haffi dance until de day light\nYour girl inna de place and your hold her tight and dance to the people’s choice\nTell dem Kriss Kross dem a tear down de mic, dance hard cause the vibes is right\nTell Mista Cat pon de mic Ah ha ha ha\n\nIt don't stop, it don't stop...\nCheck it out!\nIt don't stop, it don't stop...\nCheck it out!\nIt don't stop, it don't stop...\nCheck it out!",
 "image": "https://images.genius.com/0e4cd02f894c901f7ab4bfcdb142c239.527x522x1.jpg"
}