{
 "title": "Chief Rocka",
 "album": "Here Come the Lords",
 "year": "1993-06-03",
 "lyrics": "Chief Rocka, Chief Rocka\nChief Rocka, Chief Rocka\n\nBoom shaka laka\n, yo, here comes the \nChief Rocka\nRock it down, so jump up off the tip you're not my \nnucca\nFor sharper type to battle \nmake the people say \"Ooh ahh\"\nThink I won't curse, I'll break down and say puta\n?Hey, madrigon, sesa me bichafi mi chocha?\nSay what I want because, I'm that type of guy\nNow fam-a-lam,\n I'll be damned, slam jams the weak\nCould it be the skunk weed that makes us oh so funky?\nNow hold it let me choose, couldn't be the booze\nNo it's the shoes (the shoes?) It's gotta be the shoes!\n'Cause girlies, they clock, they stand around and jock\nSo I say boom shaka lak, grab the microphone then rock\nTo tell you the truth, when on the mic\nI'll say anything that sounds good\nLike \"Drum pan, a drum pan sound over some uuuuh\"\nThe Cat in the Hat and the mouse ran up the stairs\n\"That doesn't make no sense!\"\nC'mon who cares?\nSee even without the gift there's yours so don't be tryin' to knock me\nI say what I want to say, as long it sounds funky\nSome MC's wanted to buy me, so they try to take stands\nBut they don't understand\nI'm the motherfuckin man\nI amaze and astound, rhythm up and down\nSmack a group of them around\nLet them know who wears the crown\nWho's-the-tip-of-the-top, the-cream-of-the-crop, the-best-under-the-sun\nI'm the Lord Chief Rocka, number one, Mr. Funkee\n\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka​\n\nWell umm, boom, shak-a-lak, I got the fragrance, the funk\nWhew, and it's smellin' up the hip-hop\nA little bit of this, a little bit of that\nMixed a, little of this, and now I gotta rap\nI'm the, Chief Rocka so I guess I am in charge\nI freak it with a twist so you'll boom it in your cars\nI'm the, one with the flow and \nthe grip like G.I. Joe\nI snatch, I grab, and then I grab the dough\nSee, if I was an Indian I'd still be the chief\nThe only other difference—I'd smoke weed in a leaf\nTo the hip, the hop, to the hibby, to the hibbidy\nHip-hop, oh no, I don't wanna go pop\nI got, too much soul, rhythm and blues\nR&B, ya see, all that's cool\nBut, hip-hop and rap, yeah, that's where my heart's at\nEven back when, I used to break on a box\nBackspins for backspin\n, even while I'm rappin'\nBefore I had a record, I always kept 'em clappin'\nFreestylin' on the block, now I Chief Rock\nI always entertain, by diggin' in my crux\nMy brain, so if it's gonna rain let it rain\nI spook you with the hit\nMake you Jump like House of Pain\nBoogaloo boogaloo\n, shake and jump\nAnd remember, remember, Chief Rock I won't front\n\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\nThe Lord Chief Rocka, number one, Chief Rocka\n\n Ay Mr. Funkee\n Whassup?\n Can I get assistance?\n For what?\n For what? Yo Jazz, flex a cut\nWell back is the backer, I'm chillin' with my nucca\nAnd if ya got beef, then you can live with Jimmy Hoffa like\n what goes up, must come down\n But not me clown\nI cut 'em, crack a speaker when I'm pumpin'\nSo jump in, and watch your ears start hummin'\nThrough the block, and don't forget to boom shak, shak-a-lak\n\nWell damn DoItAll can I rock?\nI hear a beat I grab the mic, and then I start this workin'\nThe kids around the way used to think that I was buggin'\nBut they don't understand how I feel about the funk\nI walk with the funk, I talk with the funk\nI eat with the funk, I sleep with the funk\nI live for the funk, I'll die for the funk\nSo now what do they say, when I'm walkin' up the block?\nBoom-shaka-laka there goes the Chief Rocka",
 "image": "https://images.genius.com/7e0a9121546b3fe648077fe15cc47b54.620x611x1.jpg"
}