{
 "title": "Deeper",
 "album": "Born Gangstaz",
 "year": null,
 "lyrics": "Cha cha cha\nHey watch out rude bwoy\nYou see how tight Bo$$ come man?\nShe just come down DANGEROUS!\n\"Is that what time it is Boss?\"\n\"Yo what the fuck is wrong with you?\"\n\"This is deep, but I'm going deeper..\"\n\nI don't really wanna feel\nLike I'm in a daze so I smoke big kill\nJust to deal with the ills like this fucked up trip (damn)\nMy skills ain't paying bills\nAnd it's fucking with me and my grip (I hear you)\nI drink that St. Ide's shit\nAnd smoke a ticket at the same time\nDrop a wicked bomb on my naughty nature\nI'm livin' foul like a Knickerbocker (you livin' foul?)\nBitch I'm not the woman to sleep but I'm lost (yo that's deep)\nCause I be on some ole' \"I'm tired of niggas\"\nTrying to come up off bitches type thing (\"What can I do?\")\nAnd if I don't react the way he want he might swing\nHis little trick bitch ass in another direction\nThen don't even use protection\nI hate stupid shit assholes can avoid\nYo! And if worse came to worse I'll run a fraud on unemployed\nCause who the fuck cares that I got gray hairs and can't sleep\nKnow what I mean? (Yeah hell yeah, that's deep)\nDeeper and deeper .... \"What can I do?\"\nDeeper and deeper .... \"What can I do?\"\n\"This is deep, but I'm going deeper..\"\n\nEvery now and then I start flipping and get to thinkin'\nBout deep shit beyond all that bullshit\nI shoot at people (yeah I know what you mean)\nBut fuck it I'm evil\nAnd I'm hip to every bitch trying to get a grip\nAnd every nigga trying to get a grip but fuck that shit\nAnd I say fuck that shit with my mighty middle finger\nI'm heavy off into this rap shit, bucking singers\nYo I think I'm getting tense (word?)\nCause my dollars ain't making no fucking sense; but then again\nIt's probably all that chronic that I smoked\nI use to be like that when I was out there slanging dope\nAnd lately I been flipping on some old paranoid shit\nLike looking fuckers up and down trying to start shit (\"What can I do?\")\nCause I'm a hard bitch (So why don't you just soften up?)\nI try to be cool but I get caught up when I go to clubs, straight up\nI don't even trust myself (yo, you can trust me)\nFuck I know? (I'm just like you)\nRight, that's deep\nDeeper and deeper ....\nDeeper and deeper ....\n(Yo Bo$$ that shit you talking bout that's some deep shit\nI'm tellin you motherfuckers can't really get with that\nRelate to that shit)\n\nEh hey hey, I guess it's best we tell them mon\nEvery time she come, she's detrimental mon\nYes mon, know dis\nHehehe, don't make me tell dem again mon, woyyy\nShe too hotta, tell-a-man she too hotta\nTell man she too hotta an' every posse know dat-ta\nYes, she too hotta, tell man she too hotta\nFor inside she come, she say de posse get flat come\n\nAye yo, I got them buck-wild thrills, living foul kills\nI'm trying to get to Watts but I'm stuck in Baldwin Hills (damn)\nTrying to find myself for real though, check it\nIf I just rewind myself I'll see it ain't that hectic\nY'all don't hear me talking but its time to get a stack\nCause I'm about a second away, from going back\nTo the corner slangin dope (now you know you don't wanna do that shit)\nGankin cluckers, jackin high, cappin marks\nI may be losin' my mind but better that than my heart (I hear you)\nI talk a lot of shit but I can back it all the fuck up\nI'm real cool people until some bullshit get brung up\nLook here, believe me I ain't comin out my crib\nTryin to snap on life and run out and do some dumb shit\nSo I'll be takin another sip to relax me\nAnd get them problems out my mind that distract me\nLife is workin on my last nerve (yeah I hear you G)\nI'll see yo' ass next week, peace (yo that shit is deep)\nDeeper and deeper .... \"What can I do?\"\nDeeper and deeper .... \"What can I do?\"\n\nDeeper and deeper .... \"What can I do?\"\nDeeper and deeper .... \"What can I do?\"",
 "image": "https://images.genius.com/330357f38f16827513546dadc10fc3f3.599x599x1.jpg"
}