{
 "title": "Funky Child",
 "album": "Here Come the Lords",
 "year": "1993-03-30",
 "lyrics": "The year is 1971\nNow comes the first of the children of LOTUG\nLords of the Underground, witness the birth of the funky child\nDoitall, hit 'em!\n\nBorn with the fuckers from the womb of Brenda\nShe now likes the Lords but she used to dig the Spinners\nFirst with the style from the birth canal\nAnd now I got the flav to make the crowd go wild\nSo dig it, wahh! Ooh, watch me dig it\nI'm taking no shorts unless it's coming from a midget\nI tax the peace more than chicken packs grease\nI'm nearly \nknockin' boots\n, but if not, I'll knock teeth\nWahh! Ga ga, ooh, cries the baby\nSmacked on the ass, now the Doitall's crazy\nNo rattles, or playpens, or crowds when I'm rappin'\nAnd yes, I do \nreruns, as if this was What's Happening\nNow January 14 has birthed the funk one\nThe B-Day for Dupree, and yes, I'm funky\nI got you bobbin' to the funky style\nK-Def, let 'em know here comes the funky child\n\nYeah... (laughs) born in the underground of Newark\nNow witness the birth of Mr. Funkee\n\nThe fifth of the terror, it's the return of Funky Kreuger\nA.K. Anger, we told 'em Mr. Funkee Wallbanger\nConceived in the fire by a war through disasters\nThe funky child was taught to the ways of the masters\nMr. Funkee, yes, girl, the black mack is back\nHere to kick my funky style, funky this and funky that\nYou can work day and night, you could practice all your life\nBut I still take the show and then I go home with the wife\nOh my God, funky with the style, Lord have mercy\nI hurdle over rappers just like Jackie Joyner-Kersee\nWatch me flip the script, let me show you what the funk do\nMake you call me uncle (What?) Uncle (What?!) Uncle (Who?!)\nWhen I was young I used to sing with my sister\n(Heyy)\nNow I kick the ill styles, you have to call me mister\nCooling in the House of Hits, time to buckwild\nRaised in the ways of the funky child\n\nBack up baby, here comes the stroller\nWe're hit \nwhen we dry crawl\n and hit rock 'n' rolla\nI'm caught in the swinging \nhypnotized by the Pendulum\nDistributed by Elektra,\n so this is how I'm killing them\nK is on the \nM.P.,\n \nJazz is on the Technic\nMarley's on the mix,\n and now the Lords have a hit like POW!\nNow it's time to get buckwild\nAnd watch my funky brothers freak the underground\nIn a second, or minute, in no times flat...\n...\nBring it back!\nAnd go grab the album to bring the Lords money\nTake it home to mom to say, \"Ain't they funky?\"\n\nWe gone psycho and everbody thought we was DAS\nIt didn’t affect me,\n I said, \"So what?\" I kept on writing rhymes\nI keep my funky style perfected so no one can stop my flow\nI fear no man, cause if it's on fool, then it's on\n(And it's on!)\nDon't worry not for other crews selling out\nAs long as Lords of the Underground stay underground\nThe brothers of LOTUG will keep the lyrical fitness\nDon't worry about me selling out, mind your business\nYou might say, \"Damn, Mr. Funkee's going out!\"\nBut if you listen to the words then you'll know what I'm about\nAny props you receive are the props that you earn\nI'm off 'til the funky child returns",
 "image": "https://images.genius.com/26237ba5f309d07a6dbee3fe9b45963b.970x970x1.jpg"
}