{
 "title": "Hip Hop Hooray",
 "album": "19 Naughty III",
 "year": "1992-12-10",
 "lyrics": "Give it up for Naughty By Nature!\nHip Hop Hooray\nHo, hey, ho, hey, ho, hey, ho\n\nYou drew a picture of my mornin'\nBut you couldn't make my day (Hey!)\nI'm rockin' and you're yawnin'\nBut you never look my way (Hey!)\nI'm lickin' down your darlin'\nIn every single way (Hey!)\nYour funny flow is foreign\nAnd a green card's on the way\n\nThis ain't got shit to do with shampoo\nBut watch your head and shoulder\nBrother older, bold enough to fold ya, yo I told ya\nA raid afraid of what I made and played it, plus a funky fit\nSo save yo' flips and tricks for that music and the monkey bit\n\nTriggers from the Grilltown Illtown\nSome ask how it feels now\nThe deal is that we're real, so we're still 'round\nDon't lamp with a freestyle phantom\nAin't tryin' to be handsome\nShrinkin' what you're thinkin', 'cause I'm vampin'\n\nI live and die for Hip Hop, this is Hip Hop for today\nI give props to hip-hop, so Hip Hop hooray\n\nHo, hey, ho\nHey, ho, hey, ho\nHip Hop Hooray\nHo, hey, ho\nHey, ho, hey, ho\n\nYou heard a lot about a brother gainin' mo' ground\nBein' low down, I do the showdown with any little ho round\nNo! I wanna know who you believe in\nThrough your funny reasons\nEven when I'm sleepin' you think I'm cheatin'\nYou said: \"I know you, Mr. O.P.P. man\nYo, PP man, won't only see me man\"\nYou should've known when I ain't hit it and step\nThat I was wit' it a bit, not to consider the rep, heck!\nI did your partner 'cause she's hot as a baker\n'Cause I'm Naughty by Nature, not 'cause I hate ya\nYou put your heart in a part of a part that spreads apart\nAnd forgot that I forgave when you had a spark\nYou try to act like somethin' really big is missin'\nEven though my name's graffiti-written on your kitten\nI love black women always and disrespect ain't the way\nLet's start a family today; Hip Hop Hooray\n\nHo, hey, ho\nHey, ho, hey, ho\nHip Hop Hooray\nHo, hey, ho\nHey, ho, hey, ho\n\nHip Hop, Hip Hip Hop, Hip Hip Hop, Hooray!\nThere's many hungry hip-hoppers\nOne reason Hip Hop's tip-top today\nSwerve what you heard 'cause I ain't bailin' no hay\nAin't choppin' no crops, but still growin' every day\n\nHere's a thunder sound from the wonders found\nFrom the underground town down the hill\nFeel how Illtown drown smiles to frowns\nSnatchin' crowns from clowns, beatdowns are found\nDon't know me? Don't come around!\n\nTippy tippy (pause) tippy tippy (pause)\nSometimes creepin' up I eat em up\nYour styles are older than Lou Rawls\nPeace to this one and that one and them\nThat way I shout-out and I didn't miss one friend\nFools get foolish, neither them or \nParker Lewis knew us\nYou could have crews with shoes and can't step to us\nSome kitties purr, now call me sir too\nLookin' for her crew; any trick that diss gets a curfew\nI put on projects for boots\nStep through troops and leave proof\nMy problem solver's name is \nMook\nI hittin' woodies in a hoodie\nPeace to Josette, Jobete, Jo-Jo, Genae, and every hood G\nThat's right, my fight is ill\nPeace goes to L.O.N.S.\n \nand Quest\nNice & Smooth and Cypress Hill\nI live and die for Hip Hop, this is Hip Hop of today\nI give props to Hip Hop, so Hip Hop Hooray\n\nHo, hey, ho\nHey, ho, hey, ho\nHip Hop Hooray\nHo, hey, ho\nHey, ho, hey, ho\n\nSmooth it out now!",
 "image": "https://images.genius.com/4c29b87c3abb8b17642ebce2d5650b2d.1000x1000x1.png"
}