{
 "title": "One Woman",
 "album": "Jade To The Max",
 "year": "1992-11-17",
 "lyrics": "Shoo doo doo wop.  Shoo doo doo wop\nShoo doo doo wop.  Shoo doo doo wop\nShoo doo doo wop.  Shoo doo doo wop\nShoo doo doo wop\nYou never have to worry about my love\nAs long as you're taking care of business with my heart\nSee, I'm the kind of girl to dedicate my world\nYou got to give me all you got\nI need it all, baby, every drop\nYou got to show me and mean the words you say\nIt's not a game for me, baby\nIt's just not that way, yeah\nI'm only one woman, baby\nTreat me like a lady.  (Treat me like a lady.)\nYou got to take the time to show me (Show me.)\nThat I'm your one and only.  (I'm your one and only.)\nI'm only one woman, baby\nAnd I need a one-woman man.  (Yeah, yeah.  Oh, oh.)\nShoo doo doo wop.  (Shoo doo doo.)\nShoo doo doo wop.  (Shoo doo doo doo.)\nShoo doo doo wop.  (Oh, oooh, oooh, oh, oh.)\nShoo doo doo wop.  (Uh, uh, uh, uh, oh, oh, oh, oh, oh.)\nShoo doo doo wop.  Shoo doo doo wop\nShoo doo doo wop\nYou never have to wonder if I care\nIf you're sharing the way I feel for love\nYou know I'm for real\nI'm the kind of girl to dedicate my world\nYou got to give me all you got\nI need it all, baby, every drop\nYou got to show me (Show me.) and mean the words you say\n(Mean the words you say.)\nIt's not a game for me, baby.  (No, no.)\nIt's just not that way\nYou got to show me (You got to show me, yeah.) and mean the words you say\nIt's not a game for me, baby\nIt's just not that way\nI'm only one woman, baby\n(Uh, uh, uh, oh, oh.) Treat me like a lady\nYou got to take the time to show me that I'm your one and only\n(I'm your one and only.) I'm only one woman, baby\nAnd I need a one-woman man.  (I need a one-woman man.)\nI'm only one woman, baby.  (Uh................................oh.)\nTreat me like a lady\nYou got to take the time to show me that I'm your one and only\n(Show me that you love me.) I'm only one woman, baby\nAnd I need a one-woman man.  (I need, I need a one-woman man.  Yeah, yeah.)\nI'm only one woman, baby.  (I'm just a woman.)\n{Let me have your love, baby.} Treat me like a lady\n(I'm not your ordinary girl.)\nYou got to take the time to show me that I'm your one and only\n{Show me that you love me.} (You got to be down for me, the woman in your world.)\nI'm only one woman, baby, (I'm just one woman.)\n{Oh, oooh, oooh, oooh.}\nAnd I need a one-woman man.  (I need a one-woman man.)\nI'm only one woman, baby.  (Oooh, hoo.  Oooh, hoo.)\n{I'm just a woman.}\nTreat me like a lady.  (Oooh, hoo, hoo.  Oooh, oooh.)\n{I'm not your ordinary girl.}\nYou got to take the time to show me that I'm your one and only\n{You got to be down for me, the woman in your world.}\n(I'm your one and only.) I'm only one woman, baby\n{I'm just one woman.}\nAnd I need a one-woman man.  (I need, I need, I need a one-woman man.)",
 "image": "https://images.genius.com/650da547567c6321da29656ca0c480dd.1000x602x1.jpg"
}