{
 "title": "Ruffneck",
 "album": "Ain’t No Other",
 "year": "1993-06-22",
 "lyrics": "Gotta who? Gotta have a what?\nGotta what? Yo, gotta get a ruffneck\n\nI need a ruffneck\nI need a dude with a attitude\nOnly needs his fingers with his food\nKarl Kani saggin', timbos draggin'\nFrontin' in his ride with his home boys braggin'\nLying 'bout the Lyte how he knocked boots last night\nBut he's a ruffneck, so that's alright\nTriple o baldie under the hood\nMakin' noise with the boys, up to no good\nC-low on the down low\nCops come around so ruffneck front like he gotta go\nEvil grin with a mouth full of gold teeth\nStartin' beef is how he spells relief\nActin' like he don't care\nBut all I gotta do is beep him 911 and he'll be there\nRight by my side with his ruffneck tactics\nRuffneck attitude, the ruffneck bastard\n\nGotta what? Yo, gotta get a ruffneck\nGotta what? Yo, gotta get a ruffneck\nGotta what? Yo, gotta get a ruffneck\nI need it and I want it so I gotta get a ruffneck!\n\nI need a ruffneck\nI need a man that's quick and swift\nTo put out the spliff and get stiff\nBoxer shorts, everything is fitting large\nBut he don’t gotta be large to be in charge\nPumpin' in and out and out and in and here we go\nHe knows exactly how I want my flow and that's slow\nNever questioning can he get buck wild\nHe's gotta smack it, lick it, swallow it up style\nDrink a beer, sittin' his chair\nHands in his pants, fiddlin' with his dick hairs\nHe's a rudeboy, a raggamuf'\nReady to bag another brother that he ranks not ruff enough\nCause if it ain't ruff it ain't right\nAnd if he ain't ruff, well then he's all wrong for the Lyte\nI love my ruffneck and ain't nothing going down\nOr going up if my ruffneck ain't in town\n\n\nI need a ruffneck\nI need a man that don't snitch like a bitch\nShed tears or switch\nDoin' whatever it takes to make ends meet\nBut never meetin' the end cause he knows the street\nHe eat, sleep, shit, fuck, eat, sleep, shit\nThen it's back to the streets to make a buck quick\nQuick to beg even though gimme gottem here\nHit'em wit a bit a skins then he's out of there\nOn the avenue girls are passin' thru\nToo much of ruffneck so they ain't havin' you\nHard boppin' always grabbin' his jock and braggin' about his tec\nIs the wannabe ruffneck\nThat's the kind you gotta watch out for\nJust to get a rep he'll pull the plug on the tour\nPissin' in corners, doing 80 by funeral mourners\nShowing little respect, now that's a ruffneck!",
 "image": "https://images.genius.com/2749f045c96530b0f440ba0fd2e36e16.1000x1000x1.jpg"
}