{
 "title": "Something’s Goin’ On",
 "album": "Something’s Goin’ On",
 "year": "1993-01-01",
 "lyrics": "Lately I've been thinking, that you don't feel the same\nI don't know what it is, all I know is that you changed\nCause we used to be so tight, never apart\nAnd know it seems that you only want to break my heart, oh yeah\nAnd I don't know what I've done to make you feel this way\nOne minute you call, the next you don't have a thing to say\nI'm telling you baby\n(Chorus)\nSomethings going on, the love we used to share is strong\nI'm falling out of love with you, and I don't know what to do\nSomething's going on, the love we used to share is strong\nI'm falling out of love with you, and I don't know what to do\nWhere did I go wrong? What mistake did I make?\nIs there someone else? Tell me baby, you found to take my place\nCause now you stay out all night and you don't even call\nWe barely kiss, we barely hug, we barely touch at all, yea baby\nAnd I can't take no more, this is no way to live\nSomething must happen, something has got to give\nI can feel it, I know, I know there's...\n(Chorus)\nSomething's going on, the love we used to share is strong\nI'm falling out of love with you, and I don't know what to do\nSomething's going on, the love we used to share is strong\nI'm falling out of love with you, and I don't know what to do\n(Spoken)\nHey yo, Shawn?\nWhat's up Jay?\nYou know I was thinking, man I haven't seen\nYou with your girl in so long, I mean what's going on?\nWhy don't you tell me?\n(I'm so confused, yea and I don't know what to do baby)\nYou know Shawn, I know just how you feel\nBecause  my girl\n(She left me crying baby, she left me down on my knees)\n(Down on my knees)\n(Man, that's deep, yo J.C?) What's up Ski?\nTell them how you feel, (I feel so lonely)\n(Chorus with ad-libs)\nSomething's going on, the love we used to share is string\nI'm falling out of love with you, and I don't know what to do\nSomething's going on, the love we used to share is strong\nI'm falling out of love with you, and I don't know what to do",
 "image": "https://images.genius.com/6f0ba8b50e68af0f5613706d7dd0dedc.498x498x1.jpg"
}