{
 "title": "Tellin’ Me Stories",
 "album": "Comin’ At Cha",
 "year": "1992-01-01",
 "lyrics": "Sometimes when you have a loved one, they have a problem\n(Oooh, yeah, yeah, yeah.)\nThey just seem to tell you the same old story.  (Oh, they had to.)\nThey tell you that they're not on drugs or still drinkin' or stealin'\nOften\n(Oh, oh, oh, oh, oh, oh, oh, oh, oh.) It still hurts\n(Ehhhhh, hey, hey.) Tellin' me stories\n(Oooh, oooh, oooh.) Tellin' me stories, oh, oh, oh, all the time\nTellin' me stories.  (Oooh, hoo, hoo, hoo, hoo, oooh.)\nTellin' me stories (Yeah, yeah, yeah.) all the time\nI don't know what the problem is\nBut you seem to be tellin' me a story.  Oh yeah\nWhy do you lie?  That cause fuss and fights\nI tried to talk to you so we can compromise\nBut you keep on tellin' me, oh, oh, oh, oh\nTellin' me stories every time I ask you, baby\nTellin' me stories, oh, oh, oh, all the time.  Yeah, yeah\nTellin' me stories\nOooh, oooh, oooh, oooh, oooh, oooh, baby\nTellin' me stories all the time\nWe have to talk more freely now, uh, uh, uh\nTo realize that you're doin' wrong\nBut lately you've been actin' kind of shady\nBy lyin', stealin', givin' things that we don't\nBut you keep on tellin' me, yeah\n(Yeah, yeah, baby.  Yeah, yeah, baby.) Tellin' me stories\nWhy do you have to lie, baby, (Tellin' me stories)\nWhen I ask you, baby, all the time\nYou, baby.  You, baby.  (Tellin' me stories.)\nI don't know what the problem is, baby.  (Tellin' me stories)\nAh, ah, ah, eh, eh, oooh, oooh, oooh, oooh, oooh, oooh, oh, oh\nHoney, don't you give up\nI am here by your side\nThrough thick and thin you'll always be mine\nSo keep on pushin' and reach for the sky.  (Reach real high.)\nThere's a lot of love between you and me\nSo give it a try.  Oooh, yeah\n(Ah, ah, ah, ah, na, na, na, na, na, na, na, na, na.)\nBut you keep on tellin' me, yeah\nTellin' me stories, but you don't need help\n(Tellin' me stories) Stop playin' games, playin' games\n(all the time.) Come on and let me know\n(Tellin' me stories.) I-I-I-I-I-I-I-I-I-I-I-I-I-I need to know, baby\n(Tellin' me stories.) Come on with it\n(all the time.) I'm with you all the way, baby\nCome on, come on, come on.  (Tellin' me stories.)\nCome on, come on, come on\nI need to seek some help.  (Tellin' me stories)\nNeed to seek some help\nStop te-e-e-e-e-e-e-e-e-e-e-e-e-ellin' me stories.  (all the time.)\n(Tellin' me stories.)  Oooh, take me by the hand\nOooh, baby, take me by the hand\nIt won't hurt to try a little bit, baby.  (Tellin' me stories)\nI need you here with me.  I'm losin' you.  (all the time.)\nOooh, oooh, oooh, oooh, oooh, oooh, oooh, oooh, oh, eh, eh, yeah\n(Tellin' me stories.) Uh huh.  I'm tired of fightin'\nYou know I'm tired of fightin', baby.  (Tellin' me stories)\nWe can compromise.  We can compromise.  (all the time.)\nI need to know, baby.  (Tellin' me stories.)",
 "image": "https://images.genius.com/a690d8d950e644ce5b5df5b72a9b61d9.400x400x1.jpg"
}