{
 "title": "C.R.E.A.M.",
 "album": "Enter the Wu-Tang (36 Chambers)",
 "year": "1994-01-31",
 "lyrics": "What that nigga want, God?\nWord up, look out for the cops though (Wu-Tang five finger shit, fam)\nCash rules-\nWord up, two for fives over here, baby\nWord up, two for fives, niggas got garbage down the way\nWord up, know what I'm sayin'?\nCash rules everything around me, C.R.E.A.M. get-\nYeah, check this old fly shit out, word up\n(Cash rules everything around me) Take you on a natural joint\n(C.R.E.A.M. get the money)\n(Dollar dollar bill, y'all) Here we, here we go, check this shit, yo\n\nI grew up on the crime side, the New York Times side\nStayin' alive was no jive\nHad secondhands, Mom's bounced on old man\nSo then we moved to Shaolin land\nA young youth, yo, rockin' the gold tooth, 'Lo goose\nOnly way I begin the G off was drug loot\nAnd let's start it like this, son\nRollin' with this one and that one, pullin' out gats for fun\nBut it was just a dream for the teen\nWho was a fiend, started smokin' woolies at 16\nAnd runnin' up in gates and doin' hits for high stakes\nMakin' my way on fire escapes\nNo question, I would speed for cracks and weed\nThe combination made my eyes bleed\nNo question, I would flow off and try to get the dough all\nStickin' up white boys in ball courts\nMy life got no better, same damn 'Lo sweater\nTimes is rough and tough like leather\nFigured out I went the wrong route\nSo I got with a sick-ass clique and went all out\nCatchin' keys from 'cross seas\nRollin' in MPV's, every week we made forty G's\nYo, nigga, respect mine, or here go the TEC-9\nCh-chick-pow! Move from the gate now\n\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\n\nIt's been twenty-two long, hard years, I'm still strugglin'\nSurvival got me buggin', but I'm alive on arrival\nI peep at the shape of the streets\nAnd stay awake to the ways of the world 'cause shit is deep\nA man with a dream with plans to make cream\nWhich failed; I went to jail at the age of fifteen\nA young buck sellin' drugs and such, who never had much\nTryin' to get a clutch at what I could not—\nThe court played me short, now I face incarceration\nPacin', goin' upstate's my destination\nHandcuffed in the back of a bus, forty of us\nLife as a shorty shouldn't be so rough\nBut as the world turned, I learned life is hell\nLivin' in the world no different from a cell\nEvery day I escape from Jakes givin' chase\nSellin' base, smokin' bones in the staircase\nThough I don't know why I chose to smoke sess\nI guess that's the time when I'm not depressed\nBut I'm still depressed, and I ask: what's it worth?\nReady to give up so I seek the old Earth\nWho explained workin' hard may help you maintain\nTo learn to overcome the heartaches and pain\nWe got stick-up kids, corrupt cops, and crack rocks\nAnd stray shots, all on the block that stays hot\nLeave it up to me while I be livin' proof\nTo kick the truth to the young black youth\nBut shorty's runnin' wild, smokin' sess, drinkin' beer\nAnd ain't tryna hear what I'm kickin' in his ear\nNeglected for now, but yo, it gots to be accepted\nThat what? That life is hectic\n\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\nCash rules everything around me (My niggas gots to do what they gotta do)\nC.R.E.A.M., get the money\nDollar dollar bill, y'all (To get through, know what I'm sayin'?)\nCash rules everything around me (Because you can't just get by no more)\nC.R.E.A.M., get the money\nDollar dollar bill, y'all (Word up, you gotta get over, straight up and down)\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\n\nYeah, yeah\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all\nCash rules everything around me\nC.R.E.A.M., get the money\nDollar dollar bill, y'all-all-all, yeah",
 "image": "https://images.genius.com/d6fca15fbb1e4624835e01e64a6b59c4.1000x1000x1.jpg"
}