{
 "title": "Where Is My Love",
 "album": "Heart, Mind & Soul",
 "year": "1994-05-16",
 "lyrics": "I want a woman I can do things for\nGive her the world if she wants it\nAll things and even more\nAnd anything her little heart desires\nThere's nothing I wouldn't do\nAnd if she doesn't get quite enough\nI'll break down to her knees\nUntil she screams please give me more\nPlease tell me where\nWhere is my love\nTell me where\nWhere is the girl of my dreams for me\nOh, where is my love for me.  Me, me\nMe, eee, eee, eee, eee\nOh\nI'm the kind of man that wants a special girl\nTo be the only tender in my world\nShe's the kind of girl that wants a special guy\nTo love her to the day she dies\nOh, honey\nThe shame about it is you don't even know I'm out there\nSeems like I feel you near\nAre you in this room?\nWill I meet you soon?\nOh, please come to me\nPlease tell me where\nOh, where is my love\nTell me where.  Where, where, darling\nWhere is the girl of my dreams for me\nOh, where is my love\nOh, where\nWhere is my love\nTell me where.  Where, where.  (Where?  Whoo!)\nWhere is, oh, the girl of my dreams (Of my dreams) for me.  (for me.)\nOh, where is my love\nOooh, baby\nYou know, they say love is a many splendored thing, baby\nSo good but so complicated\nBut you know, we can't seem to find each other, can we, baby?\nI mean, I'm looking for you and you're looking for me too\nI tell you what, I'm gonna keep on searching till I find you, 'cause I know you're out there somewhere\nI won't give up on you, baby\nJust please come to me now, darling\nPlease tell me where, (Where, where.)\nWhere is my love\nTell me where, oh\nWhere is the girl of my dreams (My dreams) for me.  (for me.)\nOh, where (Aw, yeah.) is my love\nOh, where, (Whoo!  Whoo!)\nWhere is my love\nTell me where, where, darling\nWhere is the girl of my dreams (Girl of my dreams) for me.  (for me.)\n(Oh, where is my love.) Oh.  Oh, oh\nOh, oh, where, where, where, where, where\n(Oooh, oooh, oooh.  Oooh, oooh, oooh.)\n(Where, where is my love.) Oh, baby\n(Tell me where,) Oh, I've been searching for a long time, darling\nOh, I've been searching too, baby\nOh.  Yeah, baby\n(Where is the girl of my dreams for me.)\nOh, baby, (Whoo!) come to me.  (Whoo!)\n(Oh, where is my love.) Oh.  Oh, oh\nOh, oh, oh, oh, oh, ohhhhhhh\nEh, eh, eh, eh.  Oh, baby\nOooh, oooh, oooh, oooh",
 "image": "https://images.genius.com/376126c7c4b8e954b96e35a2cdbc5cc1.500x500x1.jpg"
}