{
 "title": "Deceiving Eve",
 "album": "Playboy",
 "year": "2021-03-05",
 "lyrics": "Yeah, yeah\n\nYou believe that I'd just up and forget that shit?\nI mean at the start, I thought about letting this go\nAdam and Eve, I know they wish they never did that shit\nIt was still in the garden, but some things we just have to let go\nJoke's on me, I gave up all this pussy cat that's in my lap\nNo looking back, and watched you leave from me\nBut is the joke on me or you? 'Cause that new nigga that you got, he's not flea\nHe's not flea (He's not flea)\nAnd not only that, he's not me\nHe's not me\nYou believe at times I mistaked what your worth is\nI believe, all I did was try to show you purpose\nWe believe, ooh, we believe\nIf we would've met different times in life, then this shit would've been perfect\nBut it's imperfect, baby\nAnd is it worth it, baby?\nCalling me perfect, baby\nAnd then just turning around and bringing me down like I'm worthless, baby\nThen you got the nerve to snap at me when I bring it up to the surface, baby\nI mean, the double standard, it get crazy\nThe double standard, it get wild\nI wanted you to have my fuckin' baby\nNow I'm standing with this crooked smile\nDoes that other nigga make you smile?\nDo that other nigga make you crazy?\n'Cause these other niggas, they be hating (Yeah, uh)\nI heard another nigga got your body\nI heard another nigga got your soul\nI know another nigga got it sewed up (Uh)\nIt's only your body, shawty, it be scrollin'\nBeat the pussy 'til it's swollen\nGive a fuck who I o-ffend (Oh)\nSippin' Don P, got us open\nIf you're horny, bust it open\nBaby, trust me, I'm chosen (Uh)\nBut I don't stress the odds\n'Cause with all the odds against me, I still thought that I was better than we thought\nAnd I don't question God\nBut God, why did you have to give her someone better than me?\nKnife inside my heart and it keep stabbing\nEmbarrassed of the times that I was bragging\nThrough all the embarrassment, I want you back in, back in, back in\nOh, no (Uh, look)\nI know I'm toxic\nYou know I'm toxic\nYour momma know we toxic\nShe insist we stop this\nBut I insist that we hop on a jet, go to the tropics\nAnd just switch the topic\n'Cause you know all I want is you to see, see\n'Cause all I want is you to see a half of me\nAnd I know you'll see",
 "image": "https://images.genius.com/49278979817c9ea4b28d39251a032c03.1000x1000x1.jpg"
}