{
 "title": "​roll another one!",
 "album": "Boy Lonely",
 "year": "2020-01-15",
 "lyrics": "Roll another one for me\n\nWhats up mother fucker?\nHow you doing? bitch I’m ready, aye\nDawgs and my demons respect me, aye\nAin’t no one tryna press me, aye\nSince I made some loot my life done got a little messy, aye\nI call up her and her bestie, aye\nRoll one up for me, I’m stressin’, aye\nRollin’, rollin’, til the night I’m coasting\nDon’t do no pills, I heard too many rappers die overdosin’\nDon’t do no white cause I’m already turned off life and I’m zoning\nIf you hate me, it’s okay, I got some nuts you can hold em’\nOkay now hold it\nToo many bands I done made, I done blew it\nToo many bad hoes had my life ruined\nBut I don’t really want to try to get into it\nBut I guess I gotta do it, gotta be aware\nThem boy sent shots, we gon' make the score fair\nWe can't really beef if your money ain't there\nHoney I ain't cuffin' If your lovin' ain't there\n\nI got 1, 2, 3, 4, 5 of em tryna come for\nYou ain't gotta be in love with me\nI lean on you, she said \"baby when you're done with me\nI need you to roll another one for me\"\n\nShe said, \"You can bring your friends\nCome and roll another one for me\"\nShe said, \"come down to my ends\nAnd please just roll another one for me\"\n\nShe gon' bring her friends\nAnd I'm gon' bring my friends\nAnd we all gon' be friends when we high\nOkay now, they gon' fuck my friends\nAnd we gon' fuck her friends\nSo \"come down to my ends\nAnd please just roll another one for me\"\n\nI got a crazy thick chick, she love to ride the kid\nMoney I'm tryna get lined up in\nSee through the green like a bottle of Heineken\nWalk on the sky like I'm Onakin\nOops, I mean Anakin, I never left but I'm back again\nAttitude, absinthe, big homie tappin' it\nI do this shit, I said, \"I ain't like your rapper friends\"\nI'm legend in the making, got my name on her anklet\nAll their boyfriends can't say shit\nBecause my goofy ass on they playlist\nAnd her friends wanna fuck, and they friends wanna fuck\nWhy you sit on the internet hating?\nI gotta make it, faded, bussin' it down, getting wavy\n\nBaby I got 1, 2, 3, 4, 5 of em tryna come for\nYou ain't gotta be in love with me\nI lean on you, she said \"baby when you're done with me\nI need you to roll another one for me\"\n\nShe said, \"You can bring your friends\nCome and roll another one for me\"\nShe said, \"come down to my ends\nAnd please just roll another one for me\"\n\nShe gon' bring her friends\nAnd I'm gon' bring my friends\nAnd we all gon' be friends when we high\nOkay now, they gon' fuck my friends\nAnd we gon' fuck her friends\nSo \"come down to my ends\nAnd please just roll another one for me\"\n\nThey love it when I do this shit\nIn my own crib, I get to smoke and rap whenever I want\nAlright, let's go\n\nShit ain't easy, I got stress and shit to worry about\nThese haters show no mercy\nBut they still ain't half as worthy now\nNobody competition, Boy I'm only battling with myself\nBut if he tryna test me, Then I'll gladly put his shit through hell\nGet your weight up if you holdin' all that hate up\nAll these boys is so cosmetic, all the shit they talk is makeup\nI done heard you finna run up, I done heard you finna gang up\nBut nothing ever happens, so I'm right back to these pay stubs\nI'm alone up in my crib, I'm kickin' it high\nFloatin' getting shit by, 25 livin' my life\nI ain't where I want to be at but shits pretty decent\nI ain't all about the money, I already seen shit\nWho your OG?\nWho the fuck your mentor?\nWhat about them shots you sent?\nWho the fuck they sent for?\nWhy you hate me so much?\nAm I on your last nerve?\n\"I do what I want bitch\", those my famous last words\nUsed to have some trouble really tryna stay the most me\nTil I said, \"Fuck everybody\" ended up lonely\nTook some time and noted, now I swear y'all can't hold me\nNo team can mold me, don't give a fuck what a teacher told me\nBut I think I'm crazy baby, Are you the one for me?\nCause you ain't picking up, your acting like you done with me\nStay down, I never fake it, too much, you're buggin' me\nI need you to buss it down or roll another one for me",
 "image": "https://images.genius.com/fa295ba2e2aa8f69cca40c61502736c1.1000x1000x1.jpg"
}