{
 "title": "Baby I’m Ready",
 "album": "Rope a Dope Style",
 "year": null,
 "lyrics": "Oooh\nMy my my, baby!\nOh girl, oh girl\nBaby it's time, for me\nTo give you all the love you need\nBaby I know, that you deserve the best\nAnd I can't keep treatin' you, like I did the rest.Sang!\nBaby I'm ready, to give you all of my love, (All of my love)\nGirl I'm tired of playin' games\nSo many girls I can't even name\nBaby I'm ready(Baby I'm ready), to give you all of my love\nBaby not just a little bit\nI wanna give you all of it\nBaby I know, that you need mornin', noon, and evenin' love\nAnd I just ain't been givin' you my time\nBut girl I wanna give you, every little bit\nEvery little piece, every little part of me\nShow you my love, just can't be beat.Naw, baby\nBaby I'm ready(I'm ready), to give you all of my love,(This is yours baby)\nGirl I'm tired of playin' games\nSo many loves I can't even name\nBaby I'm ready(I'm ready), to give you all of my love,(All of my love)\nBaby not just a little bit\nI wanna give you all of it\nAll my kisses belong to you\nTake my heart in your hand\nAnd do what ever you wanna do with it baby, hey hey\nMy love, my love, my love, my love, my love (goes deeper than the eye can see)\nI've made mistakes before, so won't you please forgive me\nOh baby, oh my sweet little baby!\nI'll give you anything, *Girl I'm tired of playin' games*\nJust ask me and I'll give it to you baby\nSo won't you give me one more chance\nGive me one more chance,(baby not just a little bit)\nWe can have an everlasting romance\nBaby, baby, baby I'm ready\nTo give you all of my love,all of my kisses\nGirl I'm tired of playin' games, I don't wanna play no more\nI don't wanna play no more\nBaby I'm ready, to give you every little piece, every little part of me, baby\nBaby not just a little bit, (not just a little bit)\nI wanna give you all of it\nBaby I'm ready, (Oh) baby I'm ready, baby I'm (yes)\nBaby I'm ready (Come on), baby I'm ready, baby I'm (Oo)\nGirl I'm tired of playin' games (Don't play with me baby)\nI got too many women and I don't wanna\nBaby I'm ready(yeah),(yes)Baby I'm ready (Come on)\nBaby I'm (Ooh) Baby I'm ready,Baby I'm ready, (Ooh baby) Baby I'm ready\nBaby not just a little bit\n(To love you all ova', to love you all ova'\nTo love you all ova' yo' body baby)\nBaby I'm ready, baby I'm ready, to give you all of my love",
 "image": "https://images.genius.com/3a8c7466fe2b79dd22e54c484253f856.994x1000x1.jpg"
}