{
 "title": "Do Me Right",
 "album": "The Future",
 "year": "1991-04-24",
 "lyrics": "[Intro: Heavy D, \nTeddy Riley\n, \nAaron Hall\n & \nDamion Hall\n]\nAyo, Teddy, you ready?\nYep, yep\nAyo, Nasty Man, you ready?\nOoh, yeah\nWhat about you, Crazy Legs?\nYou know I'm steppin'\nYo, let's put this together\nAnd let all the girls out there know how we wanna be done\n\nNow would you mind if I laid you down and licked your lovely?\nMade your body sticky with some bumblebee honey\nAnd tickled your fancy with my finger or a feather\nWorry not, my lover, the Heavster is clever\nNow I'd like to hold you and squeeze you tight\nBut don't turn into an acrobat and flip overnight\n'Cause we can go on if the lovin' is strong\nBut I'd really hate to have to write a do me wrong song\n\n(Do me right) Oh, oh-oh\n(Do me right)\n(Do me right) Oh, oh-oh\n(Do me right)\n\nI dream of you all the time\nWhen I wake up, there's a smile on my face\nAnd when we get together\nGirl, I just don't know what to say, yeah, yeah\nWhy is it hello, kiss, goodbye?\nThat ain't making me feel low\nCan you tell me what is on your mind?\nI just got to know (Do me right)\nWhat is goin' on?\nCan you tell me where do we go from here? Yeah (Do me right)\nWanna bring you close, bring you in my heart\nI wanna know that you're my girl\nBut, girl, you gotta treat me right (Do me right)\n\n(Do me right, I just wanna be your man) Do me right\n(I want you to be my girl) I wanna be your man\n(Why don't you just do me right?) Bring you close to me\nWhy don't you do me right?\n(Do me right, I just wanna be your man) Do me right\n(I want you to be my girl) Girl, you know, girl, you know\n(Why don't you just do me right?) Wanna be your man\n(You gotta do me right)\n\nSuch a sticky situation\nBut I think that we should take that chance\nSo many plans we've got ahead\nLet's forget about the past\nWe can get to making love and romance (Do me right)\nGirl, you're something else\nI wanna get with you, believe me, girl\nI wanna hold you close, keep you in my heart\nI gotta know that you're my girl\nGirl, you gotta treat me right (Do me right)\n\n(Do me right, I just wanna be your man) Ooh, yeah\n(I want you to be my girl) Be my girl\n(Why don't you just do me right?) Ooh\nWhy don't you do me—?\n(Do me right, I just wanna be your man) Do me right\n(I want you to be my girl) Girl, you know, girl, you know\n(Why don't you just do me right?)\n(\nWho's on the phone?\n)\n\nWell, it's caller number one\nWhat's the matter? Don't you recognize my voice, honey bun?\nOh, I understand, you were half-sleep\nNow wait a minute, who's beeper just beeped?\nI know it ain't mine, mine's is on my hip\nNow tell me you didn't flip on the honey dipped, ya pocket trip\nIt's time to get your heart broke, honey, I smell smoke\nYou thought he was dope, so you took a toke\nSo here's the news, I'm ghost, I'm outta here, long gone\nThe lover went left, so, honey, you stay strong\nAnd when you wake up in the middle of the night\nI'll be with her 'cause she, she'll do me right\n\n(Do me right) Do me right\n(Be my girl)\n\nDo me right\n(Do me right, I just wanna be your man) Oh\n(I want you to be my girl) Yeah, baby\n(Why don't you just do me right?) Promise I would do different things for you\n(Do me right, I just wanna be your man) Please, baby\n(I want you to be my girl) Be my girl\n(Why don't you just do me right?) I don't want nobody else\n(Do me right, I just wanna be your man) I've got to have your love right now\n(I want you to be my girl)\n(Why don't you just do me right?) Oh, do me right\n(Do me right, I just wanna be your man) Do me right now, baby\n(I want you to be my girl) I can't wait no longer\n(Why don't you just do me right?) Woah",
 "image": "https://images.genius.com/a094a95c7ac6181f821b32b9981106e8.600x597x1.jpg"
}