{
 "title": "Iesha",
 "album": "Coolin’ at the Playground Ya Know!",
 "year": "1990-10-02",
 "lyrics": "RoRo:\nIesha, Iesha so glad to meetcha\nSee you in the schoolyard, strollin' wit your teacha\nThe lil skirt you played was really fly\nShe turned around and she winked her eye so I\nStepped to her like I knew her\nThe Biv is cool but Romell is cooler\nThe bell rang cuz I started to talk yet the class is not there no more\n(Yo Red, where'd you meet her?)\nRed:\nAt the playground, ya know\nThat's where I saw this cutie\nThis girl was swingin' and she looked so fly\nOn the monkey bars, we climbed up to the top and\nShe touched my hand that's when I fell in love\nChris:\nIesha..\nYou are the girl that I neva had\nAnd I want to get to know you bettah\nIesha..\nYou know I want you so bad\nAnd there's nothing anyone can do\nTo keep me away from you\nMike Bivins:\nYo Dallas man these five young boys out of Atlanta GA are a real mental\nThey kinda like remind me of me and my boys New Edition, know what I'm saying\nSo all you people out there ridin' in your cars listening to the radio station\nOr cold maxin' in ya living room watching this here video, check the 2nd verse\nWe played Nintendo\nThis was her very first date\nI didn't wanna make it seem to fly\nWe ate cereal\nShe couldn't stay out at late\nHer mother told her to be home at nine\nChris:\nIesha..\nYou are the girl that I neva had\nAnd I want to get to know you bettah\nIesha..\nYou know I want you so bad\nAnd there's nothing anyone can do\nTo keep me away from you\nBreak\n(Ronnie Bobby Ricky and Mike)\nChris, Mark, Red, Da, Ro x2\nYo Ro u might sound to sure so wutcha gonna do?\nI dunno Da, I only got one more rap and I'm gonna see what happens\nThrew down my books went up to the door\nPressed the bell what was in store?\nIesha came out with a smile (oh no)\nShe ain't worth the while\nSo I passed her a lollipop and a letter\nTold her so let's keep this a secret\nNo remember Iesha, only u can peep this, peace\nRed:Yo Dallas man\nDallas Austin:What up?\nRed: What you do me a favor, right?\nDallas Austin: Uh-huh?\nRed: Hit the tracks, all about the do soloist, man?\nDallas Austin: Word, check this out!!!!!\nKids: Here we go!!!\nGo Chris (4x)\nGo Mark (4x)\nGo Red (4x)\nGo Dave (4x)\nGo Ro-Ro (4x)\nYEEEEAAAAAHHHH!!!! BOOOOY!\nGA: Yo!, what's up? Coming at ya!\nY'knowwhatimsayin? ABC\nDallas, what you know about take these tracks man?",
 "image": "https://images.genius.com/11e71682788fbedc58711150b1fbc3be.600x600x1.jpg"
}