{
 "title": "I’ll Give All My Love To You",
 "album": "I’ll Give All My Love to You",
 "year": "1990-06-12",
 "lyrics": "Oh baby baby baby oh\nMy, my, my baby yeah\nOh I love ya baby\nOh yes I yes I do girl\n\nI love you in the night\nI wanna take it real real slow, my baby\nI understand what you told me\nAnd if I, I didn't know\nI always wanted someone just like you\nI really need to hold on, hold you\nI'd give the world to you, oh my darlin'\nYou know I will\nYeah yeah you know i will\nI surely will\n\nI will never do anything to hurt you\nI'll give all my love to you\n(I'm gonna give you every bit of my love, my love)\nAnd if you need me, baby, I'll come runnin' (yes I will)\nOnly to you (yes my baby yes I will)\n\nWhy don't we just lay down\nAnd hold each other real close, real close\n'Cause I, I don't wanna rush you, baby, no, no, no\nIf time, If time is what you need the most\nI always wanted to love, love you\nYou give me all my dreams come true\nI want to love you, love you tonight oh, my darlin'\nYes I do\nYeah, yeah, yeah\n\nI will never do anything to hurt you\n(I would never do one little thing to you baby)\nI'll give all my love to you\n(And I'm gonna give you every bit of my love tonight girl)\nAnd if you need me, baby, I'll come runnin'\nOnly to you, only to you baby, oh, oh, oh\n\nGirl I've been longing for you baby for a long long time\nLet's make love tonight\nI can make me feel real good baby\nI can make feel real good baby\nSometimes, sometimes I get a little lonely, baby (so lonely baby)\nAnd I need a little love that I can call all mine (I need some lovin')\nGirl, you are the one for me, babe\nI know that you are the world for me, babe\nYeah, yeah, yeah, yeah, yeah oh\n\nI will never do anything to hurt you\n(I would never, never do one little thing to hurt you)\nI'll give all my love to you\n(I give you every single bit of my love girl)\nAnd if you need me, baby, I'll come runnin'\nAll you got to do baby\nWhen you need somebody pick up the phone\nI'll be there, I'll be right there\nI will never do anything to hurt you\nOh baby baby baby\nI'll give all my love to you\nUnderstand, understand what I'm saying to you baby\nAnd if you need me, baby, I'll come runnin'\nOnly to you baby, only to you baby, only to you baby\n(I'll never hurt you)\nI will never do anything to hurt you\nI'll give all my love to you\nAnd if you need me, baby, I'll come runnin' only to you\nYeah\nHow do you like it, baby?\nWhat makes you feel the lady?\nHow do you like it, baby?\nHow do you like it, girl?\nHow do you like it, baby?",
 "image": "https://images.genius.com/7808e4e16c11b64193f974097ce666d4.256x388x1.jpg"
}