{
 "title": "O.P.P.",
 "album": "Naughty By Nature",
 "year": "1991-08-24",
 "lyrics": "Arm me with harmony\nDave, drop a load on 'em!\n\nO.P.P., how can I explain it?\n \nI'll take it, frame by frame it\nTo have y'all all jumping, shouting, saying it\nO is for \"other,\" P is for \"people's,\" scratch your temple\nThe last P, well, that's not that simple\nIt's sort of like, well another way to call a cat a kitten\nIt's five little letters that are missing here\nYou get on occasion if the other party isn't gaming\n(Uh)\nIt seems I gotta start the explaining, bust it\nYou ever had a girl and met her on a nice hello\nYou get her name and number and then left feeling real mellow\nYou get home, wait a day\n she's what you wanna know about\nThen you call up and it’s her girlfriend’s or her cousin’s house?!\nIt’s not a front, a F to the R to the O to the N to the T\n;\nIt's just her boyfriend's at her house\n (Oh, that’s why she’s scary)\nIt's O.P.P., time other people's what you get it\nThere's no room for relationship, there's just room to hit it\nHow many brothers out there know just what I'm getting a\nWho think it's wrong 'cause I was splitting and co-hitting that\nWell, if you do, that's O.P.P. and you're not down with it\nBut if you don't, here's your membership\n\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (Every last homie!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (All the homies!)\n\nWell, for the ladies O.P.P. means something gifted\nThe first two letters' the same but the last is something different\nIt's the longest, loveliest, lean, I call it the leanest\nIt's another five-letter word rhyming with \"cleanness\" or \"meanness\"\nI won't get into that, I'll do it ah sort of properly\nI'll say the last P, hmmm, stands for \"property\"\nNow lady, here comes a kiss\nBlow a kiss back to me, now tell me exactly\nHave you ever known a brother who had another like a girl or wife\nAnd you just had to stop a toast 'cause he looked just that nice?\nYou looked at him, he looked at you and you knew right away\nHe had someone but he was gonna be yours anyway!\nYou couldn't be seen with him at all and still you didn't care\n'Cause in a room behind a door no one but y'all are there\nWhen y'all are finished, y'all can leave and only y'all would know\nAnd then y'all could throw that skeleton bone right in the closet do'\nNow don't be shy\n'Cause if you're down I want your hands up high\nSay O.P.P. (O.P.P.!)\n \nI like to say with pride\nNow when you do it, do it well and make sure that it counts\nYou're now down with a discount\n\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (Every last lady!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (All the ladies!)\n\nA scab tried to O.P.P. me, I had a girl and she knew that\nMatter of fact, her and my girl was partners that\nHad a fall-out, disagreement, yeah an argument\nShe tried to do me, so we did it in my apartment, bust it!\nThat wasn't the thing it must've been the way she hit the ceiling\n'cause after that she kept on coming back and catching feelings\nI said, \"Let's go, my girl is coming. so you gotta leave.\"\nShe said: \"Oh no, I love you, Treach!\" I said: \"Now child, please!\nYou got to leave, come grab your coat, right now you gotta go!\"\nI said, \"Now look you choose the stairs or choose the stair window\nThis was a fling, a little thing you shouldn't have brought your heart\n'Cause you know I was OPP, hell, from the very start!\"\nCome on, come on, now let me tell you what it's all about\nWhen you get down, you can't go 'round \nrunnin' off at the mouth\nThat's rule number one in this O.P.P. establishment\nYou keep your mouth shut and it won't get back to her or him!\nExciting, isn't it? A special kinda business\nMany of you will catch the same sorta O.P.P. messing with\nHim or her, for sure ain't going to admit it\nWhen O.P.P. comes, damn skippy, I'm with it\n\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (This whole party!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nYou down with O.P.P.? (Yeah, you know me!)\nWho’s down with O.P.P.? (This whole party!)\n\nBreak It Down!",
 "image": "https://images.genius.com/9529e5ad3084933e53de6b47b635a2c7.1000x1000x1.jpg"
}