{
 "title": "You Can’t Play With My Yo-Yo",
 "album": "Make Way for the Motherlode",
 "year": "1991-03-13",
 "lyrics": "Yo Jinx, man, we gotta find somebody that's down for hers, man\nAll these girls sympin', man!\nWho you think fit the category?\n\nIt's me, the brand new intelligent black woman Y-O-Y-O\nWhich is Yo-Yo, but I'm not to be played like I was made by Mattel.\nBut this Yo-Yo is made by woman and male\nI rhyme about uprising, uplifting the woman\n superior to handle any male\nAny time, any rhyme, any flow, and any show\nAnd if you ask my producers, they'll reply “No…”\n\nYou can't play with my Yo-Yo!\nDon't try to play me out, don't try to play me out\nDon't try to play me out, don't try to play me out\n\nMy name is Yo-Yo, I'm not a **, no\nI like to flow so swift, it's got to be a gift\nSo yo, let the beat lift as I rip and rhyme\nAnd rap and slap all the girls who can't adapt\nTo the fact I hit the 8-ball often\nThe earrings I wear are called Dolphins\nCheck the booty, yo, it's kind of soft and\nIf you touch it, you living in a coffin (Word to mother)\nI'm in the 90s, you're still in the 80s, right?\nI rock the mic, they say I'm not lady-like\nBut I'm a lady, who will pull a stunt though\nI K-O suckas, and even hit the blunt\nSo what you wanna do? You must play hit and run\n'Cause to me, you simply can't get none\nYou wetter than a hot ** in snow\nTell 'em, Ice Cube!\n\nNo you can't play with my Yo-Yo!\nDon't try to play me out, don't try to play me out\nDon't try to play me out, don't try to play me out\nSuckas\nDon't try to play me out, don't try to play me out\nDon't try to play me out, don't try to play me out\nYou can't play with my Yo-Yo!\nDon't try to play me out, don't try to play me out\nDon't try to play me out, don't try to play me out\nDon't try to play me out, don't try to play me out\nDon't try to play me out, don't try to play me out\nWhat's your name baby?\n\nThat's right, my name is Yo-Yo, but no, I'm not a Duncan\nAs I rap, Chilly Chill bring in the funk and\nI'll steal yo man, that's if he is a hunk and\nHe'll call me Baby Yo, or even Pumpkin\nI may be Buttercup, or even Miss Yo\nWe had dinner, and now we drinking Cisco\nHit the slow jams, it's getting cozy\nYou're home alone, so now you getting nosy\nYou're kind of young\nSo of course you had to call my place\nHang up in my face\nIt's a sad case of who your man's giving the dollars\nWhat? Yep, I put lipstick on his collar\nAt home, he's gotta listen to ya holler\nBut he'll slap you, and sock ya, so why bother?!\nBut if you come knocking at my door (Ayy yo)\nI'll smoke you, tell 'em, Ice!\n (Ice Cube)\nYou can't play wit my Yo-Yo, sucka\nYou can't play wit my Yo-Yo, yo, yo\nFool, 1990, stayin' sucka free, haha!\nYou can't play wit my Yo-Yo!\nYeah, tell em whats up\n\nYo, I hope you realize one day\nThat you're \"weak\" as Monday through Sunday\nSo listen to my Y-O, here's my bio\nAnd next to me?\nHa! You're not fly, yo?!\nYou lack skills to be a woman that's black\nFake hair in the back, plus green contacts?!\nYo-Yo, is just trying to stop ya\nBecause the world ain't a big soap opera\nIt only takes one punch to drop ya\nAnd then the I.B.W.C. will come mob ya\nBut no, I'm not living like that verse\nAlthough I pack a real small Gat in my purse (right, right)\nBut no, it's not to cause corruptions\nJust to fight back on destruction\nJust thought you wanna know about the Y-O-Y-O\nYo, should I tell 'em, Ice?\n (Ice Cube)\nThey know what time it is\nFools, yeah!\nYou can't play with my Yo-Yo, yo yo\nI'm out. I thought you knew!\nYo-Yo, the brand new intelligent black lady\nStompin' to the 90s!\nFor all y'all suckas\nAye Jinx, I knew they couldn't fade it\nYou can't play wit my Yo-Yo\n\nI'm similar to a metaphor, makes them want to yell on\nBut keep it at a limit to where they're yelling, \"More, more!\"\nI am very versatile, changing my ways to different styles\nKnowledge is the key, experience is from my background\nLabel me as a woman, and sometimes I feel inferior\nFalling back on the hands of time makes no man superior\nShould we dare to take the stand\nAnd diss back all the men\nWho know no more but  and thinks wit his ding-a-ling?\nI think it's time that we defeat by standing on our on two feet\nIf we wanna live with justice and harmony\nHow many more rounds must I go in order to let my people know\nTimes were hard, things have changed (Don't try to play me out)",
 "image": "https://images.genius.com/f0f30bc9af999483722e1892d9e2b40a.600x600x1.jpg"
}