{
 "title": "Changed It",
 "album": "#3PackFromParis",
 "year": "2017-03-10",
 "lyrics": "I did it for everybody out here on their own\nI did it for the ones who walk a mile in them cages\nAnd never tell me no\nCome get me when I fall, and tell me when I'm wrong\nBut you should know I bought 'em\nI changed it, I changed it\nThey say that shit the same, it ain't the same, though\nI changed it, I changed it\n\nOh my god, I changed it\nOh my god, they on the same shit\nOh my god, I changed it\nOh my god, they still on the same shit\nYou can't say nothin', you can't say nothin'\nYou end up everywhere you say you wasn't\nIs that your boyfriend? Why you say that's your cousin?\nI don't do handshakes, that shit disgusts me\n\nThe big 3 on the court, bitch at them bleachers\nI don't wanna have to break bad like it screeches\nA bitch out in Atlanta eating them peaches\nA bitch got more bars than where Big Meech is\nNo, you can't bone it, nigga, ain't no Lisa here\nShe gon' dread dissin' Nicki like Lisa hair\nI buy, lil nigga, ain't no leaser here\nThe bitch gambled her career, now it's gon' be severe\nI just be watchin' bitches pitfalls\nStopped doin' pills, but bitch dem withdrawals\nI am in my mansion rockin' pink drawers\nI leveled up, bitch, I switched flows\nMJ to the teens, I am Billie Jean and the bitch is my son\nI'm doin' it for fun, I am the first number, tell them bitches I won\nThis hoe gettin' slick, so I put on gym shoes and extended my run\nMJ, game 6, (you my) Jackson, Tyson\n\nQuiet dawg, my phone changed up\nI'm icin' out my Barbie chains up\nAnd when I come, get your change cup\nThese bum bitches never change up\n\nOh my god, I changed\nOh my god, they still on the same\nOh my god, I changed\nOh my god, they still on the same\nYou can't say nothin', you can't say nothin'\nYou end up everywhere you say you wasn't\nIs that your boyfriend? Why you say that's your cousin?\nI don't do handshakes, that shit disgusts me\n\nNo more CMB shit, I changed it\nYoung Money shit, Mula Gang shit\nDifferent hoes doing the same shit\nPoppin' pills, we don't know where the pain went\nLit like high beams, sippin' on my lean\nRippin' off my wings, knife out my spleen\nYeah, Carter time, I put bling on for the time\nShe changed her ringtone to one of mine, I changed 23s to 45s\nLil Tune like autotune, I get in her throat and she harmonize\nShe get the D and ooh la la la, and when she leave, I kumbaya\nI whip it up with the left hand, I don't fuck with the yes man\nI get younger by the second, I don't rust like Def Jam\nIt's a must I expand, and flex on my ex-team\nHave sex on my jet ski, text my chef, told 'em \"Let's beef\"\nChanging girls, change is fine\nShe don't like girls, change her mind\nChange the world, change my line\nNever ever change my slimes\nChanging looks, changing lies, changing skies, changing lanes\nMe, Minaj, and Champagne changed the game\nAnd y'all chump change\nI'm just sayin'\n\nQuiet dawg, my phone changed up\nI'm icin' out my Barbie chains up\nAnd when I come, get your change cup\nThese bum bitches never change up\n\nOh my god, I changed\nOh my god, they on the same\nOh my god, I changed\nOh my god, they still on the same\nYou can't say nothin', you can't say nothin'\nYou end up everywhere you say you wasn't\nIs that your boyfriend? Why you say that's your cousin?\nI don't do handshakes, that shit disgusts me\nOh my god, I changed\nOh my god, they on the same\nOh my god, I changed\nOh my god, they still on the same\nYou can't say nothin', you can't say nothin'\nYou end up everywhere you say you wasn't\nIs that your boyfriend? Why you say that's your cousin?\nI don't do handshakes, that shit disgusts me\n\nMula, Mula Gang\nMula, Mula Gang\nMula Gang, Gang, Gang\nThat your boyfriend? That shit disgusts me",
 "image": "https://images.genius.com/0a913aafdb91dade7a0f7752de9db244.1000x1000x1.jpg"
}