{
 "title": "Comin Out Strong",
 "album": "HNDRXX",
 "year": "2017-02-24",
 "lyrics": "High Klassified\nI got the jewels flooded from Ben, baby!\n\nLike a nigga don't dance, but he make moves\nThey fuck around, now a nigga gotta shame you\nI'm shameless, I be rockin' all my chains too\nThey told me, \"Boy I think the money's startin' to change you\"\nLord save you, Lord save you\n'Member runnin' through the city in the same shoes\nNow I'm gunnin' in the Benz and the Range too\nI'm on point, know a nigga never take two\nThey said I couldn't reach Mars, so I turned to a star\nNow I might have fucked around, might have raised up the bar\nNow I'm talkin' cash, talk cash all in my palm\nMy nigga Cash said, \"Watch what they do for the ones\"\nI know she wanna be poppin' all over the 'Gram\nWhen the cameras come out, wanna hold my hand\nMust be out of your mind, do you know who I am?\nMan you're killin' my vibe, do you know who I am?\nOh, yeah\n\nThey take my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\nTake my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\n\nI might end up with your ho if I take one (Still comin')\nNowdays if they don't have a story, they gon' make one (Still comin')\nLast night I gave my heart to a fake one (Still comin')\nI done end up on the blogs with the wrong one (Still comin')\nIt's hard to tell the real stories from the fake ones (Yeah, comin')\n'Cause nowdays if they don't got it they'll make one (Still comin')\nThe only time I feel alive when I take (Still comin')\nI wanna vent but I know it ain't safe (Still comin')\nMust be out of your mind, do you know who I am? (Do you know who I am?)\nUsed to hit it from behind, do you know who I am? (Never say my name)\nI can't give you all my time, do you know who I am? (Give you my t-)\nMake you fall in love tonight, must don't know who I am, I am\nI showed you a million, no videos (No videos)\nI opened up Bentley doors, I invented doors (I invented)\nBodies droppin' and we duckin' the law\nIf you the one to take the blame, you can't say what you saw, no\n\nThey take my kindness for weakness\nStill comin' out strong (Yeah, comin')\nStill comin' out strong (Yeah, comin')\nStill comin' out strong\nTake my kindness for weakness\nStill comin' out strong (Yeah, comin')\nStill comin' out strong (Still comin')\nStill comin' out strong\n\nPluto don't dance, but I make moves (Keep comin')\nWe fucked around, now a nigga gotta shame you (Keep comin')\nShameless, I've been rockin' all my chains too (Keep comin')\nTold me, \"Boy I think the money startin' to change you\"\nLord save you, Lord save you\nThey might pick you up, just throw you down with the fall\nYou must not know who I am\nYou must not know who I am\nI pour champagne on the ground\nI pour champagne on the ground\nMy brother Casino said you wasn't Freebandz (Freebandz)\nAnd at the time I couldn't see what he was sayin' (he was sayin')\nYou turned your back, I should have never gave you chances (gave you chances)\nI call for loyalty, she didn't never answer\nI'm a boss, I'ma make my own family (la familia)\nYou're with my ex, while I'm with different color candies\n(so familiar)\nI got Jenny, I got Tammy, I got Sandy\nYou try to sneak and leave 'em then I leave you stranded\nBe honest to me\n\nThey take my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong (Be honest to me)\nTake my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\n\nKindness, she lie\nStill comin', lie\nBoss, fuck around, boss\nKindness\nDown, like a nigga, she lie\nKindness, she lie\nKindness, oh",
 "image": "https://images.genius.com/a091db6e8ca008752328ea3a3e275d7c.640x640x1.jpg"
}