{
 "title": "Love Galore",
 "album": "Ctrl",
 "year": "2017-04-27",
 "lyrics": "I need, I need\nI need, I need\nI need, I need\nI need, I need\nI need, I need\n\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\n[Verse 1: SZA & \nTravis Scott\n]\nDone with these niggas, I don't love these niggas\nI dust off these niggas, do it for fun\nDon't take it personal\nPersonally, I'm surprised you called me after the things I said\nSkrrt, skrrt on niggas (\nYeah\n), skrrt up on niggas (\nTrue\n)\nSkrrt down, you actin' like me (\nYeah\n)\nActin' like we wasn't more than a summer fling\nI said farewell, you took it well (\nTrue\n)\nPromise I won't cry over spilled milk (Ooh, no, I won't)\nGive me a paper towel, gimme another Valium\nGive me another hour or two, hour with you\nWhy you bother me when you know you don't want me? (\nYeah\n)\nWhy you bother me when you know you got a woman? (\nYeah\n)\nWhy you hit me when you know you know better? (\nTrue\n)\nKnow you know better (\nTrue\n)\nKnow your crew better than you do\nCall me, lookin' for ya (\nYeah\n)\n, I be lookin' for ya (\nYeah\n)\nGot me lookin' forward to weekends\nWith you, baby, with you, baby\nWith you, baby (\nTrue\n), with you\nWe do whatever we want, go wherever we want\nLove however we want, it don't matter (\nTrue\n)\nYou do whatever I want, get whatever I want\nGet whatever I need, it's about\n\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\n[Verse 2: SZA & \nTravis Scott\n]\nShould have never gave you my number, I did it with you (Ooh)\nShould have never let you hit it, I split it with you\nI regret it, you gots a fetish\nYou gots a problem, now it's a problem, oh, no\nSkrrt, skrrt on bitches (\nYeah\n)\nI don't know these bitches (\nYeah\n)\nDig dirt on bitches, do it for fun\nDon't take it personal, baby\nLove on my ladies, luh-love to my ladies, uh (\nTrue\n)\nDated a few (\nStraight up\n)\n[Verse 3: Travis Scott & \nSZA\n]\nWhy you bother me? Why you bother me? Why you bother me? (Why you bother me? Yeah)\nLast time I checked, you were the one that left (\nThe one\n)\nMe in a wreck (Yeah), me in a mess (Yeah, yeah)\nYou all I rep (Yeah), like my side I rep (Yeah)\nYeah, that's that Mo City that side, that you can't come 'round at night, yeah (It's lit)\nYou like to get me high, you don't want no one beside ya\nYou like when I make fire\n, you say, \"La Flame, keep makin' fire\" (Ooh)\nLet me cum inside ya, let me plant that seed inside ya (Ooh)\nAss and titties, titties, only thing that stuck with, with me (With me)\nOnly thing that was real, only thing I could feel, ya feel me? (Yeah, feel me?)\nSo why you bother me, why you bother me? \n(With you, baby\n)\nTryna catch a P.O.V., yeah (\nWith you\n)\n\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got (Love)\n\n\nI came to your city, lookin' for lovin' and licky\n'Cause you promised to put it down\nAll up in your city, lookin' for you, uh\nSearchin' for you like love\nOnly thing keepin' me from droppin' you right now\nRight now (Love)\nOnly thing keepin' me by your side\nOnly thing keepin' me by your side now\n\nBut see, Solána, if you don't say somethin', speak up for yourself\nThey think you stupid, you know what I'm sayin'?",
 "image": "https://images.genius.com/2f9c7376080d8a38de104d6665c1ee29.800x800x1.png"
}