{
 "title": "Backin’ It Up",
 "album": "Under8ed",
 "year": "2018-09-20",
 "lyrics": "[Intro: Pardison Fontaine & \nCardi B\n]\nAhhh\nCardi!\nTurn around, fuck it all the way up\nBust it down, turn around, fuck it all the way up\nBust it down, turn around, fuck it— (Look)\n\nLet's get it straight, girl, you don't need a nigga for nothin'\nLookin' better every day, you got that Benjamin Button\nClaimin' he don't got a girl, you know niggas be frontin'\nYou don't need no bitch comin' up to you as a woman (Ayy)\nAnd you a boss, so you hate when niggas waste time (Ayy)\nYou too pretty to be paused on the FaceTime (Ayy)\nDamn, I'm just statin' the facts\nYou hate that like you hate when niggas tell you, \"Relax\"\nWhat the fuck you mean, \"Relax\"?\nYou want somethin' more than just physical (Word)\nIt's been a while since you met someone original (Word)\nYou spend your time drinkin' wine in your livin' room\nAll that good pussy, can't find the one to give it to (What?)\nIt's a, it's a shame (It's a shame)\nYou see me, see the squad, it's a gang (It's a gang)\nYou see him, it's a bum, it's a lame (It's a lame)\nBut it's a difference 'tween me and what's-his-name (Ayy)\nI swear to God, word to Mase (Ayy)\nI'ma drink this Henny to the face (Ayy)\nFuck a condom, I'ma bring Saran Wrap (Bring Saran Wrap)\nI can't let no good pussy go to waste (Ayy)\n[Chorus: Pardison Fontaine & \nCardi B\n]\nBack, back-backin' it up\nI'm the king of talkin' shit, then backin' it up (Ayy)\nBack, back-backin' it up\nThrow that shit over here, girl, that's what it's for (What you say?)\nYou know how to go and get a bag, don't you? (Ayy)\nYou know how to make a bitch mad, don't you ?(Ayy)\nMake your ex wanna get it back, that's a fact\nSay it louder for the bitches in the back (Ayy)\nI know how to go and get a bag, don't I? (Don't I)\nI know how to get a bitch mad, don't I? (\nYeah)\nMake my ex wanna get it back, that's a fact\nSay it louder for the bitches in the back (Ayy)\nBack, back-backin' it up\nI'm the queen of talkin' shit, then I'm backin' it up (Yeah)\nBack, back-backin' it up\nThrow that money over here, nigga, that's what it's for (What you s\nay?)\n\nLook, said I was gettin' some head, get-gettin' some head\nRan down on a bitch, she almost pissed on her leg\nBitches think they fuckin' with me, must be sick in the head\nWhy don't you chill with the beef and get some chicken instead?\nGot the crown, shut it down\n, have them hype up in the 6\nIf she dead, let her lay, won't bring no life into this bitch\nLookin' this good should be a sin, you should call me cinnamon\nCardi B, bad bitch, those is fuckin' synonyms\nWe see who winnin' (See who winnin'), we see who got it (See who got it)\nYou see I'm still in the bank makin' deposits (Cash)\nYou see who switched up sides and who was solid (Who was solid)\nYou see who stuck to the code and who forgot it\nTalk about it, bitch\n[Chorus: Pardison Fontaine & \nCardi B\n]\nYou know how to go and get a bag, don't you? (Ayy)\nYou know how to make a bitch mad, don't you? (Ayy)\nMake your ex wanna get it back, that's a fact\nSay it louder for the bitches in the back (Ayy)\nI know how to go and get a bag, don't I? (Don't I)\nI know how to get a bitch mad, don't I? (Yeah)\nMake my ex wanna get it back, that's a fact\nSay it louder for the bitches in the back (Ayy)\nBack, back-backin' it up\nI'm the king of talkin' shit, then backin' it up (Ayy)\nBack, back-backin' it up\nThrow that shit over here, girl, that's what it's for (What you say?)",
 "image": "https://images.genius.com/6dc2bab39f368029358f1c5c82e6dea7.640x640x1.jpg"
}