{
 "title": "Big Ole Freak",
 "album": "Tina Snow",
 "year": "2018-06-11",
 "lyrics": "Tell me...\n \n(\nLil Ju made this beat\n)\nTell me, is it love? Is it love again? Ooh-ooh\n\nAyy, big ol' freak, huh\nBig booty, big ole treat (Ah)\nI'ma make him wait for the pussy\nHit it 'til he big ole skeet, ayy (Baow, baow, baow)\nFeet on the bed (Ayy)\nI'll fuck him up in the head\nSuck it, then look in his eyes\nThen the next day, I might leave him on read, ayy (Mwah)\nPop it, pop it (Pop it)\nDaydreaming 'bout how I rock it, huh\nHe hit my phone with a horse\nSo I know that mean come over and ride it (Ride, ride, ride)\nShit, I'm on the way, huh (Ayy)\nRide on that dick, I'm like \"Yay,\" hey (Woo)\nUsually, I like to fuck (I like to fuck)\nBut tonight, we gon' make love cause you bae, huh\nNobody know (Nah)\nI fuck with him on the low (Of course)\nWe never show up together\nBut I text him when I'm ready to go, ayy\nI had a couple of shots at the bar (Yeah)\nI'm finna play with that dick in the car (Skrrt, skrrt)\nI got him swervin' and breakin' the law\nThese windows tinted so nobody saw\n\nAin't nobody freak like me, huh (Hell nah)\nGive ya what you need like me, huh\nAin't nobody got up on they tip-tip toes\nThen rode to the tip like me, huh (Ayy, ayy, baow, baow)\nI got him addicted, he fiendin' (Yeah)\nMy body a drug and he need it (Need it)\nHe beggin' me for the treatment (He beggin' me)\nHe throw a fit when I leave him\n\nHe like \"Baby, let me rub, let me rub on ya\nCan I get a lil' love, lil' love from ya?\"\nMy body addictive, it's drivin' him crazy\nI think I gotta run from him (Ayy, run, run, run)\nDon't know what to do without it\nHe fuckin' wit' you? I doubt it (I do)\nThey don't understand that I'm all in his head\nAnd it's nothin' to do with my body\n\nYou been fiendin' for me lately\nGoin' brazy, brazy (Ooh, ooh, ooh-ooh)\nI got what you need, I'm gon' give it to you, baby\nGoin' brazy, brazy (Ooh, ooh)\nFiendin' for me lately\nI got what you need, I'ma give you what you craving\n\nSee, I'm a big ole freak, I love to talk my shit (Talk my shit, uh)\nAnd you must be a pussy boy if you get offended\nBitch, it's Tina Snow (Uh)\nThey love me 'cause I'm cold ('Cause I'm cold)\nAnd you can't take no nigga from me\nI got mind control (Hell no), ayy, uh\nI wanna fuck in the mirror\nI like to look at your face when you in it (Uh)\nCome in the room and I'm givin' commands\nI am the captain and he the lieutenant (He the lieutenant)\nI need that neck like a muhfuckin' pendant\nNeed you to spit, make that muhfucker glisten (Ah)\nTell him \"Shut up,\" make that muhfucker listen\nI bet he gon' like it, he won't do no trippin' (Ah)\n\nAin't nobody freak like me (Hell nah), huh\nGive ya what you need like me (Hell nah), huh\nAin't nobody got up on they tip-tip toes\nThen rode to the tip like me, huh\nI got him addicted, he fiendin' (Yeah)\nMy body a drug and he need it (Need it)\nHe beggin' me for the treatment (He beggin' me)\nHe throw a fit when I leave him (Ah)\n\n\"Baby, let me rub, let me rub on ya\nCan I get a lil' love, lil' love from ya?\"\nMy body addictive, it's drivin' him crazy\nI think I gotta run from him (Ayy, run, run, run)\nDon't know what to do without it\nHe fuckin' wit' you? I doubt it (I do)\nThey don't understand that I'm all in his head\nAnd it's nothin' to do with my body\n\nYou been fiendin' for me lately\nGoin' brazy, brazy (Mm, mm, mm-mm)\nI got what you need, I'm gon' give it to you, baby\nGoin' brazy, brazy (Ooh, ooh)\nFiendin' for me lately (Ooh, ooh, ooh-ooh)\nI got what you need, I'ma give you what you craving\n\nTell me, is it love, is it love again? Ooh-ooh",
 "image": "https://images.genius.com/9c874a6f9c93bee42d29156df57d3b58.1000x1000x1.jpg"
}