{
 "title": "F.N",
 "album": "True 2 Myself",
 "year": "2019-08-09",
 "lyrics": "(Fuck niggas, I don't trust niggas\nIf  you bust triggers and you tell, you a fuck nigga)\nIf  you tell, you a fuck nigga\n(How you tell on the gang? If you mention my name\nBoy, I promise I'ma kill you, better duck, nigga\nWhat’s  up with you? I grew up with you\nUsed  to fuck with you, now I'm wishing that a bus hit you\nI used to fuck with you, now I'm wishing that a bus hit you)\n(Fuck  niggas, I don't trust niggas\nIf you bust triggers and you tell, you a fuck nigga)\nFuck nigga\nNah, Lil Tjay (Fuck nigga), yeah, yeah\n(Now  I'm wishing that a bus hit you)\nYeah, yeah, yeah (Skrrt, skrrt, yeah)\n\nGrrr, pow, I'ma skip town, see my wrist drown\nEverybody wanna fuck with me for benefits now\nMan, I wish my nigga Smelly could've seen me lit now\nSit down, maybe roll up, blow a spliff down\nTime go by, niggas change so much\nWhy the fuck these niggas looking at my chain so much?\nThey just mad 'cause I departed from the game so much\nOne false move and the gang gon' bust\n\nCartier glasses, 20/20, got a clear view\nYou a man, I don't fear you\nAct up, we gon' mask up, boy, I dare you\nBrody catch a body, I'ma leave you in the rearview\nCould have did it to me, lil' nigga, you were scared to\nYou a bluff and you not who you appear to\nYou'd be starstruck if you see a nigga near you\nAnd your bitch wanna fuck, I don't care to\nCareful, if I say links, plan's canceled\nI can have your shorty in my bed doing dance moves\nFuck that, let's get right back to the real shit\nIn the field shit, niggas really used to drill shit\nMama stressed out, whole lot she gotta deal with\nSwear every real nigga gon' feel this\nSmokin' on drugs 'cause there's too much to deal with\nSB strapped up in the field with it\n\nFuck niggas, I don't trust niggas\nIf you bust triggers and you tell, you a fuck nigga\nHow you tell on the gang? If you mention my name\nBoy, I promise I'ma kill you, better duck, nigga\nWhat's up with you? I grew up with you\nUsed to fuck with you, now I'm wishing that a bus hit you\nI used to fuck with you, now I'm wishing that a bus hit you\nFuck niggas, I don't trust niggas\nIf you bust triggers and you tell, you a fuck nigga\nHow you tell on the gang? If you mention my name\nBoy, I promise I'ma kill you, better duck, nigga\nWhat's up with you? I grew up with you\nUsed to fuck with you, now I'm wishing that a bus hit you\nI used to fuck with you, now I'm wishing that a bus hit you\n\nMy mama know about the pain, thought I'd never change\nBut looking back, for the fame, I felt the same\nI was stuck up in the streets, but I had a brain\nI ain't have no money, we was looking for a nigga chain\nAnd shit, all I ever wanted was to have a name\nHad a lot of shit to lose, not enough to gain\nAnd that fuck nigga changed, went against the grain\nFound out my homie went fed, almost went insane\nStrictly business, you ain't with it, you get parked, nigga\nI don't know you, you wasn't with me from the start, nigga\nI remember catching stains in the park, nigga\nMe and Bubba tryna catch an opp after dark, nigga\nMy mama told me, \"Wisen up, be a smart nigga\"\nSo all my niggas on go like a kart, nigga\nSmelly drive mean a bullet to your heart, nigga\nI don't really wanna speak facts, see the chart, nigga\n\nGrrr, pow, I'ma skip town, see my wrist drown\nEverybody wanna fuck with me for benefits now\nMan, I wish my nigga Smelly could've seen me lit now\nSit down, maybe roll up, blow a spliff down\nTime go by, niggas change so much\nWhy the fuck these niggas looking at my chain so much?\nThey just mad 'cause I departed from the game so much\nOne false move and the gang gon' bust\n\nFuck niggas, I don't trust niggas\nIf you bust triggers and you tell, you a fuck nigga\nHow you tell on the gang? If you mention my name\nBoy, I promise I'ma kill you, better duck, nigga\nWhat's up with you? I grew up with you\nUsed to fuck with you, now I'm wishing that a bus hit you\nI used to fuck with you, now I'm wishing that a bus hit you\nFuck niggas, I don't trust niggas\nIf you bust triggers and you tell, you a fuck nigga\nHow you tell on the gang? If you mention my name\nBoy, I promise I'ma kill you, better duck, nigga\nWhat's up with you? I grew up with you\nUsed to fuck with you, now I'm wishing that a bus hit you\nI used to fuck with you, and now I'm wishing that a bus hit you\n\nLil Tjay\nYeah, yeah, yeah\nOh",
 "image": "https://images.genius.com/645587e20411c12f2423ab02c7a2ed56.1000x1000x1.jpg"
}