{
 "title": "Higher",
 "album": "Father of Asahd",
 "year": "2019-05-17",
 "lyrics": "We The Best music\nDJ Khaled\n\nOh, you keep taking me higher and higher (Yeah)\nBut don't you know that the devil is a liar? (Yeah, I know)\nThey'd rather see me down, put my soul in the fire\nBut we keep goin' higher, higher\n\nLook, look\nMy granny 88, she had my uncle and then\nA miscarriage back-to-back every year for like ten\nPregnant with my moms, doctor told her it was slim\nWas bed rode for nine months, but gave birth in the end\nPops turned 60, he proud what we done\nIn one generation, he came from Africa young\nHe said he met my moms at the Century Club\nLos Angeles love kinda of like Hussle and Boog\nMani turned ten, Kross turned two\nStartin' to see this life shit from a bird's view\nWe the ones that made millions off the curb, fool\nIn this rap shit ten, never made nerd moves\n\nOh, you keep taking me higher and higher (Yeah)\n(\nHussle, Khaled\n)\nBut don't you know that the devil is a liar? (Yeah, I know)\n(\nRight back\n)\nThey'd rather see me down, put my soul in the fire\nBut we keep goin' higher, higher (\nWoah, woah\n)\n(\nNip, talk to 'em\n)\n[Verse 2: Nipsey Hussle & \nJohn Legend\n]\nEmptied out the clip, it was broad day\nFuck niggas always gotta learn the hard way\nWe gon' tape it off if we ball play\nPut a half a moon crescent on your bald fade\nPolice hit the lights, that's a car chase\nLookin' back at my life make my heart race\nDance with the devil and test our faith\nI was thinkin' chess moves but it was God's grace\nCrooked ass whoever 'til we all straight\nWith no shame, I peeped game and it's all fake\nSouth Central state of mind, high crime rate (\nYeah\n)\nHomicide, hate, gang banging'll get you all day (\nYeah, yeah\n)\nAnd look at my fate\n[Chorus: John Legend & \nNipsey Hussle\n]\nOh, you keep taking me higher and higher (Yeah)\n(\nTold Khaled bounce the four 'til the bar break\n)\nBut don't you know that the devil is a liar? (I know)\nThey'd rather see me down, put my soul in the fire\nBut we keep goin' higher, higher\n\nHigher\nOh, Lord\nCan you feel it?\nMy shoes are scrapin' the sky\nI'm so high\nWe keep goin' higher",
 "image": "https://images.genius.com/048221d872cfbe9e253eb6763655dfdd.1000x1000x1.png"
}