{
 "title": "Nights Like This",
 "album": "While We Wait",
 "year": "2019-01-10",
 "lyrics": "You act like you need remindin'\nTryna do it over, bring it back and rewind it\nBut all that glitters isn't gold, I was blinded\nShould have never gave you my heart on consignment\n\nAnd I can't believe the lies that I went for\nThought you was mine, but you decided to be with him though\nYou took my feelings and just threw 'em out the window\nFeel like it's too hard to fall in love again, no\n\nOn some nights like this, shawty, I can't help but think of us\nI've been reminiscin', sippin', missin' ya\nCan you tell me what's with all this distant love?\nIf I called, would you pick it up?\nOn some nights like this, I just wanna text you, but for what?\nYou gon' say you want me, then go switch it up\nJust gon' play with my emotions just because, no (Oh)\n\nAll them times I played the fool for you\nThinkin' we could put it back together, thought we had forever\nYou never see my point of view\nOur connection is so severed, you don't show no effort\n\nAnd I can't believe the lies that I went for\nThought you was mine, but you decided to be with him though\nTook my feelings and just threw 'em out the window\nFeel like it's too hard to fall in love again, no\n\nOn some nights like this, shawty, I can't help but think of us\nI've been reminiscin', sippin', missin' ya\nCan you tell me what's with all this distant love?\nIf I called, would you pick it up?\nOn some nights like this, I just wanna text you, but for what?\nYou gon' say you want me, then go switch it up\nJust gon' play with my emotions just because, no (Oh)\n\nYou gon' get my hopes high, girl\nYou gon' get my hopes high, girl\nJust gon' tell me more lies, girl\nJust gon' get my hopes high, girl\n\nI've been way too good to you, you take me for granted\nYou was my day one since back at Big B's house on Adams\nFirst day that we met, I flagged you down, I told you, \"Hit my line\"\nUsed to promise me you'd never switch on me like Gemini\nYou think I'm a fool, ain't nobody stupid\nI see all the signs, I see all the clues\nYeah, sometimes I reminisce 'bout that shit when I'm bingin'\nCan't believe it's been a whole year, yeah, but...\n\nOn some nights like this, shawty, I can't help but think of us\nI've been reminiscin', sippin', missin' ya (Missin' ya)\nCan you tell me what's with all this distant love? (Love)\nIf I called, would you pick it up?\nOn some nights like this, I just wanna text you, but for what?\nYou gon' say you want me, then go switch it up (Switch it up)\nJust gon' play with my emotions just because, no (Oh)\n\nYou gon' get my hopes high, girl\nYou gon' get my hopes high, girl\nJust gon' tell me more lies, girl\nJust gon' get my hopes high, girl",
 "image": "https://images.genius.com/0489da895dd494380b1ea3eba4ea7be3.939x939x1.jpg"
}