{
 "title": "You Stay",
 "album": "Father of Asahd",
 "year": "2019-05-17",
 "lyrics": "[Intro: India, \nJeremih\n, & \nDJ Khaled\n]\nSabes bien que fue un engaño\nLo que me hiciste fue un pecado\nAsí mismo me engañaste\nY lloras hoy porque fallaste\nCómo tratas de buscarme\nDespués que tú me traicionaste\nAhora tengo que alejarme\nBusqué la forma de olvidarte\n(Ayy, come here, man, haha)\nOoh\n(Señorita, she is beautiful, no?)\nWe The Best Music\n (Oh-nah-nah)\nSabes bien que fue un engaño (Oh-nah-nah)\nLo que me hiciste fue un pecado (\nAnother one\n)\nAsí mismo me engañaste (\nDJ Khaled\n)\n\nWhy, oh, why? You stay, you stay\nAnd cry every night, you stay, you stay\nI don't know why, oh, why, you stay, you stay, oh\nI think you too loyal, you stay, you stay\n\nUh, I don’t know how you do it, but you did it, I'll admit it\nAnd who am I to be a critic and tell you different?\nYou know I never speak on that nigga, it's not my business\nBut I could tell you that his level’s no competition\nAnd I'm optimistic that I'm 'bout to hit it\nAnd um, I can tell you've been crying in Honda Civics\nBecause I caught you slipping, left you no choice\nYou ever cry again, it's gon' be in a Rolls Royce\nI wipe your face with them new hundreds to make your tears dry\nHitting it on a jet, this ain't no red eye\nGot you chasing dreams, and it ain’t even bedtime\nAnd don’t you dare bring up your ex 'cause he a dead guy\nI wonder\n\nWhy, oh, why? (Oh, why?)\nDo you ride, do you stick by his side\nIf he makes you cry every night?\nGirl, I see the pain in your eyes\nI don’t know why, oh, why, you stay, you stay, oh\nYou stay, you stay\nYou stay, tell me why you\n[Verse 2: Jeremih & \nDJ Khaled\n]\nI think you're too loyal\nI think you do too much for someone who don't do shit for you, girl\nAnd that's real\nThat ain’t the way love supposed to feel\nBut you say he's the one for you\nThen complain how he don't show you\nBut you ain't gotta take that\nBaby, you can't take that\nHit the gym and get your shape back, oh\nFuck that nigga\nDon't understand why you still trust that nigga (Work)\nWith your mind and your heart and your soul (\nLet's go\n)\nFor your goals, in control, you let it go (Work)\nI just want to see you happy\nI just want to see you laughing\nI just want to see you smiling\nI can tell you need somebody who really about you\nWho gon' see about you\n'Cause it's been a while, so baby\n\nWhy, oh, why? (Oh, why?)\nDo you ride, do you stick by his side\nIf he makes you cry every night?\nGirl, I see the pain in your eyes\nI don't know why, oh, why, you stay, you stay, oh\nYou stay, you stay\nI think you too loyal\n[Verse 3: Lil Baby & \nJ Balvin\n]\nYou give him chance after chance\n'Cause you say maybe one day, he'll grow up and be a man\nAnd lately, you been pouring out your heart on the 'Gram\nBut you been playing your part from the start, I understand\nI put carats on your hand\nBut see, I'm one of them bad guys\nAnd I can't guarantee the world\nBut I promise you'll be better than last time\nAs long as you're loyal\nYou got a plan, I'll do more than spoil\nI'll be there to support you\nDrop top in the wintertime, whatever just to see you smile\nPrivate jet from time to time, by the ocean, I'll drive you wild\nWhatever your decision, I'm with it, no asking why\nI catch you slippin' at all, you gon' be mine (\nJ Balvin, men\n; ¡wuh!)\n[Outro: J Balvin, \nJeremih\n, & \nDJ Khaled\n]\nMa', la verdad es un orgullo tenerte a mi lado\nCuando tus ojos brillan en la luz son los que me fascinan\nNo hay quién te gane\nYou stay, you stay, oh\nYou stay, you stay, oh, you stay\nTell me why you\n (\nAnother one\n)\nMa', la verdad es un orgullo tenerte a mi lado\nCuando tus ojos brillian me dan luz solo que me fascinan\nNo hay quién te gane\nYou stay, you stay, oh\nYou stay, you stay, oh\nThink you're too loyal",
 "image": "https://images.genius.com/cffeb29d202e241178a1554b14ab6f38.1000x1000x1.jpg"
}