{
 "title": "Why I Love You",
 "album": "Watch the Throne",
 "year": "2011-08-08",
 "lyrics": "Ooooh, I love you so\nBut why I love you, I'll never know\n(Ooooh, I love you so\nBut why I love you, I'll never know)\nOoooh, I love you so\nBut why I love you, I'll never know\n(Ooooh, I love you so\nBut why I love you, I'll never know)\n\nPicture, if you will, that the throne's burning\nRome's burning, and I’m sitting in the corner all alone, burning\nWhy does it always end up like this?\nSomething that we don’t determine\nSame people that I fought for, that I fight for, that I ride for\nThat I live for, that I die for\nBe the reason that these niggas is alive for\nAnd they want me dead, but I’m sorry, but I just can’t die for you\nBut I can make 'em put their hands in the sky for you\nWe waiting for the fireworks like July 4th\nGet fly more, get high more, cry boy, why for?\nWhen the grief is over, beef is over\nI’ll be fly when Easter’s over\nI tried to teach niggas how to be kings\nAnd all they ever wanted to be was soldiers\nSo when love is gone 'til blood is drawn\n'Cause we no longer wear the same uniform\nFuck you, squares, the circle got smaller\nThe castle got bigger, the walls got taller\nAnd truth be told, after all that said\nNiggas still got love for you\n\nOoooh, I love you so\nBut why I love you, I'll never know\n(Ooooh, I love you so\nBut why I love you, I'll never know)\nOoooh, I love you so\nBut why I love you, I'll never know\n(Ooooh, I love you so\nBut why I love you, I'll never know)\n\nShowed love to you niggas\nYou ripped out my heart and you stepped on it\nI picked up the pieces 'fore you swept on it\nGoddamn, this shit leaves a mess, don’t it?\nShit feelin’ like death, don’t it?\nCharge it to the game, whatever’s left on it\nI spent about a minute, maybe less on it\nFly, pelican, fly, turn the jets on it\nBut first I shall digress on it\nWasn’t I a good king?\nMaybe too much of a good thing, huh?\nDidn’t I spoil you? Me or the money, what you loyal to?\nHuh, I gave you my loyalty\nMade you royalty and royalties\nTook care of these niggas' lawyer fees\nAnd this is how niggas rewarded me, damn\n\nOoooh, I love you so\nBut why I love you, I'll never know\n(Ooooh, I love you so\nBut why I love you, I'll never know)\n\nBussin’ at me, b-b-b-bussin’ at me\nBut I’m bulletproof, bitch, you can’t get nothin’ past me\nGot body armor\nA nigga gotta watch the throne\nAnd I’m bussin’ back\nSo niggas in a glass house should not throw stones\nWhat do you do when the love turns to hate?\nGotta separate from these fuckin' fakes\nCaesar didn’t see it so he ceased to exist\nSo the nigga that killed him had keys to his shit\nAm I my brother’s keeper?\nOnly if that nigga don’t creep up\nGot a pistol under my pillow\nI’ve never been a deep sleeper\nP-p-p-paranoia, 'cause the nigga that said he’ll\nBlast for ya is now blastin' for ya\nThat’s an assassin for ya\nThese niggas got a shot, they’ll shoot\nPlease Lord, forgive him\nFor these niggas not know what they do, ooh",
 "image": "https://images.genius.com/5ec2ba5fd5d1b7715c25fab644c86c53.1000x1000x1.png"
}