{
 "title": "711 A.D.",
 "album": "Ether Warz",
 "year": "2011-12-20",
 "lyrics": "When the darkness falls and your light gets dim, give the starseed a call for some bright vision\nWe were born in the black, before life stepped in. Told us that the whites were more righteous men\nThat was it for the gods. Put the chokehold on 'em, movement on pause and thus began the fall\nOr was it Autumn? Cause that's when the green turned brown, and the trees started dropping leaves towards the ground\nSecrеt scrolls, fingertips pierced by thе thorn of a rose, fresh blood for they souls\nBehold - the pale horse from the road, with Death on the reins with a pocket full of gold\nThe same men that sat down and broke bread, stabbed their elders in the backs 'til the rivers ran red\nAnd thus began the saga of immortals turned men. Who would outlast the other, strike the balance and win?\n\nGods to mortals, mortals to gods\nCame through a portal to the earth from the stars\nBattle was fought, soldiers riddled with scars\nTill the queen came and healed them with these powerful bars\nGods to mortals, mortals to gods\nCame through a portal to the earth from the stars\nBattle was fought, soldiers riddled with scars\nTill the queen came and healed them with these powerful bars\n\nGrey skies prevailed over sunlight then. Purple hearts marked the chest bones of valiant men\nFor those who fought brilliantly, a legend was formed. Word got around a rebel was allegedly born\nTrouble was brewing, bubbling hot in steel cauldrons. Bounty hunters gunning for triple six carbons\nFreedom fighters on the lam, them trap boys and daughters of the dust in the streets going ham\nFoolish desperation was a popular brand. Streets flooded from the overworked ocular glands\nBlood rituals manipulated, mystical man, putting slaves on their knees to a mythical man\nThe world was ruled by a more reptilian hand. Full power in exchange for the techno advance\nNow it seemed that the children had hardly a chance. But alas here she was in the tiger head stance\n\nGods to mortals, mortals to gods\nCame through a portal to the earth from the stars\nBattle was fought, soldiers riddled with scars\nTill the queen came and healed them with these powerful bars\nGods to mortals, mortals to gods\nCame through a portal to the earth from the stars\nBattle was fought, soldiers riddled with scars\nTill the queen came and healed them with these powerful bars\n\nThey started talking, wait a minute who dat?\nHer voice made the earth start shaking, how she do that?\nWe never heard one cleverly balance treble and bass, voice smooth, spit hard kinda like leather and lace\nStraight up. This is the end of times, can’t you see the street hot?\nThey murking soldiers all the way from Tennessee to t dot\nOn the run, wearing out the soles of our Reeboks\nAll because the devil wanna murder off what he not\nDoomsday scriptures, half cocked predictions, dynamiting fault lines, quakes off the Richter\nDark matter rap, Battlestar Galactica, Asiatic black incantations from Afrika\nWe need those plus the lost DNA codes, to unlock them meridians and third eye chakras\nSo she stepped forth, began to chant oms, watched the wretched of the earth rise up in the rapture",
 "image": "https://images.genius.com/005b01ec0ae188c542cc20fb6a788a21.500x500x1.jpg"
}