{
 "title": "Boyz-n-the Hood",
 "album": "N.W.A. and the Posse",
 "year": "1987-03-03",
 "lyrics": "Cruisin' down the street in my 6-4\nJockin' the freaks, clockin' the dough\nWent to the park to get the scoop\nKnuckle-heads out there cold-shootin' some hoops\nA car pulls up, who can it be?\nA fresh El Camino rollin' Kilo G\nHe rolled down his window and he started to say\nIt's all about makin' that GTA\n\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nYo, man!\nGet the fuck out!\nPump that bass!\nMothafucker, say what?\n\nDonald B's in the place to give me the pace\nHe said my man JD is on freebase\nThe boy JD was a friend of mine\n'Til I caught him in my car tryin' to steal an Alpine\nChased him up the streets to call a truce\nThe silly cluckhead pulls out a deuce deuce\nLittle did he know I had a loaded 12-gauge\nOne sucka dead, LA Times front page\n\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nYo, Leroy!\nBeer drinkin', breath stinkin', sniffin' glue\n\nBored as hell and I wanna get ill\nSo I went to a place where my homeboys chill\nThe fellas out there makin' that dollar\nI pulled up in my 6-4 Impala\nThey greet me with a 40 and I started drinkin'\nAnd from the 8-ball my breath started stinkin'\nLeft to get my girl to rock that body\nBefore I left I hit the Bacardi\nWent to her house to get her out of the pad\nDumb ho said somethin' that made me mad\nShe said somethin' that I couldn't believe\nSo I grabbed the stupid bitch by her nappy-ass weave\nShe started talkin' shit, wouldn't you know?\nReached back like a pimp, slapped the ho\nHer father jumped up and he started to shout\nSo I threw a right cross, cold-knocked him out\n\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nWho do you think you are, Mr. big stuff?\nRock this mothafucker like Three the Hard Way\n\nI'm rollin' hard, now I'm under control\nThen wrapped my 6-4 around a telephone pole\nI looked at my car and I said \"Oh, brother.\"\nI throw it in the gutter, and go buy another\nWalkin' home, I see the G ride\nNow Cat is drivin', Kilo on the side\nAs they busted a U, they got pulled over\nAn undercover cop in a dark green Nova\nCat got beat for resistin' arrest\nHe socked the pig in the head for rippin' his Guess\nNow G is caught for doin' the crime\nFourth offense on the boy he'll do some time\n\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nL.A. playa\nBig Drum Beater\n\nI went to get them out, but there was no bail\nThe fellas causin' a riot in the county jail\nTwo days later in the municipal court\nKilo G on trial cold cut a fart\n\"Disruption of the court,\" said the judge\nOn a six-year sentence, my man didn't budge\nBaliff came over to turn him in\nKilo G looked up and gave a grin\nHe yelled out \"Fire!\", then came Suzy\nThe bitch came in with a sub-machine Uzi\nPolice shot the girl but didn't hurt her\nBoth upstate for attempted murder\n\n'Cause the boys in the hood are always hard\nYou come talkin' the trash, we'll pull your card\nKnowin' nothin' in life, but to be legit\nDon't quote me, boy, 'cause I ain't said shit\n\nGet busy, y'all!\nAw\nYou mothafucker!",
 "image": "https://images.genius.com/ab2fa6ba7eb6b25a0254a5bfd78c79e2.600x600x1.jpg"
}