{
 "title": "All I Want Is You",
 "album": "All I Want Is You",
 "year": "2010-05-25",
 "lyrics": "Damn\nDamn\nHeheheh\nUgh\n\nDamn, \nCole World\nI never thought I see that day that you my old girl\nNow I’m stuck here hollerin' at ol' girl\nGot one, got two, three, four girls\nShotgun in the drop\n made a right\nHut-one, hut-two, told them hoes take a hike\nThen it’s on to the next—on—on to the next one\nHard to move on when you always regret one\n\nI wonder sometimes\nI wonder if I was wrong\nTryna do right by you got me here\nNow all I am is alone\n\nCause her eyes, and those hips\nAnd that ass, don’t compare, at all, no\nAnd at best, all they do is distract me but now\nDeep down, when I face it\n\nAll I want is you\nAll I want is you, now\nAll I want is you now\nNow that you’re gone, gone, gone\n\n'Cause being your friend is killin' me softly\nHear voices, wonder where I went wrong\nIt was my fault and the wrong time\nI wonder so often, regret gets exhaustin'\n\nCause her eyes, and those hips\nAnd that ass, don’t compare, at all, no\nAnd at best, all they do is distract me but now\nDeep down, when I face it\n\nAll I want is you, mmh\nAll I want is you, now\nAll I want is you now, sugar\nNow that you’re gone, gone, gone\nAll I want is you, ooh-ooh, ooh\nAll I want is you, now\nAll I want is you now, baby\nNow that you’re gone, gone, gone, gone, gone\n[Bridge: Miguel & \nJ. Cole\n]\nCause they don’t smile, huh, or smell like you\nAnd they don’t make me laugh, or even cook like you\nAnd they don’t photograph, nah, they don't sex like you\nLet's face it \n(yeah)\n I can’t replace it \n(yeah)\nThat's why all I want is you now\n\nI hit the club when you left me thinking that could heal shit\nTryna celebrate my Independence Day, Will Smith\nBaby girl, who I’m kidding? Still sick, real shit\nAll my new hoes seem to get old real quick\nAnd could it be, you everything that these plain bitches couldn’t be?\nIs it a sign from the Lord that I shouldn’t be?\nLost in the player way, sorta get old to me\nGot me on layaway, girl you got a hold on me\nI say, \"I’m wrong\", you say, \"Come again?\"\nDamn, said I was wrong, look don’t rub it in\nI got a lot on my mind, got a flock full of dimes\nLike a line full of hoes, how they coming in\nJust sayin', don’t wanna have me then somebody will\nI’m playin', \nweight on my chest like I body build\nI’m prayin', you ain’t content with tryna do your thang\nAnd come back baby, boomerang, 'rang, huh\n\nThat's why all I want is you now\nAll I want is you, now\nAll I want is you now, sugar\nNow that you’re gone, gone, gone, gone, gone\n\nOoh, ooh\nOoh, ooh, oh\nYeah, now that you're gone, gone, gone\nI want you back",
 "image": "https://images.genius.com/85eb46df117fc2fb0cecaed3d7f039e3.1000x1000x1.jpg"
}