{
 "title": "BedRock",
 "album": "We Are Young Money",
 "year": "2009-11-13",
 "lyrics": "I-I-I-I can make your bed rock\n \n(Young Money)\nI-I-I-I can make your bed rock, girl\n \n(\nKane is in the building, nigga\n)\nI-I-I-I can make your bed rock\nI-I-I-I can make your bed rock\n\nUh, she got that good-good, she Michael Jackson bad\nI'm attracted to her, or her attractive ass\nAnd now we murderers, because we kill time\nI knock her lights out and she still shine\nI hate to see her go but I love to watch her leave\nBut I keep her running back and forth; soccer team\nCold as a winter's day, hot as a summer's eve\nYoung Money thieves steal your love and leave\n\nI like the way you walking if you walking my way\nI'm that Red Bull, now let's fly away\nLet's buy a place, with all kind of space\nI'll let you be the judge, and-and-and I'm the case\nI'm Gudda Gudda, I put her under\nI see me with her, no Stevie Wonder\nShe don't ever wonder, 'cause she know she bad\nAnd I got her, nigga: grocery bag\n\nOoh baby, I be stuck to you like glue, baby\nWanna spend it all on you, baby\nMy room is the G-spot\nCall me Mr. Flintstone, I can make your bed rock\n\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock, girl\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock (Ayy!)\n\nOkay, I get it, let me think, I guess it's my turn\nMaybe it's time to put this pussy on your sideburns\nHe say I'm bad, he prob'ly right\nHe pressing me like button-downs on a Friday night\nI'm so pretty like, be on my pedal bike\nBe on my low starch, be on my egg whites\nHe say, \"Nicki don't stop, you the bestest\"\nAnd I'd just be coming off the top, asbestos\n\nI love your sushi roll, hotter than wasabi\nI race for your love, \"Shake'n Bake\" Ricky Bobby\nI'm at the W, but I can't meet you in the lobby\nGirl, I gotta watch my back, 'cause I'm not just anybody\nI seen em stand in line just to get beside her\nI let her see the Aston and let the rest surprise her\nThat's when we disappear, you need GPS to find her\nOh, that was your girl? I thought I recognized her\n\nOoh baby, I be stuck to you like glue, baby\nWanna spend it all on you, baby\nMy room is the G-spot\nCall me Mr. Flintstone, I can make your bed rock\n\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock, girl\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock (Ayy!)\n\nShe like tanning, I like staying in\nShe like romance and I like rolling with friends\nShe said I'm caged in, I think her conscience is\nShe's watching that Oxygen, I'm watching ESPN\nBut when that show ends, she all over my skin, lotion\nSlow-mo motions, rollercoastin'\nLike back, forth, hold it\nShe poses like it's for posters and I poke like I'm suppose to\nTake this photo if you for me, she said: \"Don't you ever show this!\"\nI'm too loyal and too focused\nTo be losing and be hopeless\nWhen I spoke this, she rejoiced it, said \"Your words get me open\"\nSo I closed it, where your clothes is?\nI'm only loving for the moment\n\nShe ain't got a man, but she's not alone\nMiss Independent, yeah, she got her own\nHey gorgeous, um, I mean flawless, well\nThat's what you are, how I see it is how I call it, yeah\nLook-look at how she walk, m-hmm, she know she bad\nDo-do your thang baby, I ain't even mad\nAnd I ain’t leavin' fast, I'ma stay awhile\nHold your head, Chris, I-I'ma take it down!\n\nOoh baby, I be stuck to you like glue, baby\nWanna spend it all on you, baby\nMy room is the G-spot\nCall me Mr. Flintstone, I can make your bed rock (Young Money, Yea , Yea)\n\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock, girl\n(Gudda Gudda, T-Streets, Mack Maine, J Millz)\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock (Ayy!)\n(Tyga Tyga)\n\nOoh baby, I be stuck to you like glue, baby\n(Drizzy Drake, Nicki Minaj)\nWanna spend it all on you, baby\n(Hey Chanel, Lil Twist, Lil Chuckie, and Young Lloyd, AYEE!)\nMy room is the G-spot\nCall me Mr. Flintstone, I can make your bed rock\n\n(Ooh) I-I-I-I can make your bed rock\n(We Young Money)\n(Ooh) I-I-I-I can make your bed rock, girl\n(Ooh) I-I-I-I can make your bed rock\n(Ooh) I-I-I-I can make your bed rock (Ayy!)",
 "image": "https://images.genius.com/de54b898a037399cf3d139e0667e3cf4.1000x1000x1.jpg"
}