{
 "title": "Break My Bank",
 "album": "Too Cool to Care",
 "year": "2011-05-17",
 "lyrics": " + (Iyaz)\nNew Boyz! (Geah gal!)\n(Well tell dem wussy boy)\n(I-Y-A-Z be longside them one New Boyz)\n\nShe make me wanna break my bank (my bank)\nGive everything I got (got) just to get a shot (shot)\nMake it rain (it rain)\nWhere my money at? Where my money at?\nBreak my bank (my bank)\nForget about the tag (tag) throw it in the bag (bag)\nMake it rain (it rain)\nShawty wanna break my, shawty wanna break my bank\n\nDamn - girl! You look better than the videos\nThink I wanna break my bank, hammer to the piggy though\nAll-all the groupie girls gettin jealous of what I spend\nThey tryin to chop it up, but I ain't The Karate Kid\nJaden! Everyday I'm spendin' more on her\nI don't buy shit, like I barely hold the door open\nEvery time I say this shit I always get her one more\nWhen it's time for taxes, a nigga gon' be done for\n\n\nMake me wanna break my\nMake me wanna break my bank\n\nOkay, the start of my day, I took her on a date\nHad to scrape for some change, so I went to the bank\nBut when I seen her she was so damn fine like that\nSo I headed right back to pull a lot more stacks\nOverdrawn, low funds, it's-it's like I'm dumb\nBut I'll put it right back cause your boy is sprung\nMan she is so damn fine got me spendin all this cash\nMan it's goin too fast, I need to watch my ass\n\nMake me wanna break my\nMake me wanna break my bank\n\nIf you a bad girl, and you need a little change\nTell your man go break his bank (go break yo' bank!)\nIf you a bad girl, and you tryin to get paid\nTell your man go break his bank (go-go break yo' bank!)\nIf you a bad girl, and you need a little change\nTell your man go break his bank (go break yo' bank!)\nIf you a bad girl, and you tryin to get paid\nTell your man go break his bank (go-go break yo' bank!)\n\n\nMake me wanna break my\nMake me wanna break my bank",
 "image": "https://images.genius.com/118f547becce2402bf06624039947ce3.500x500x1.jpg"
}