{
 "title": "Can It Stay",
 "album": null,
 "year": null,
 "lyrics": "It's been a long time since I been up in your room\nSuch fun memories of makin' love to you\nI see you got a new bed, you wanna break it in soon\nJust two hours ago, you sang a different tune, said\nYou ain't gonna give in to me like that\nNo matter how much I'm wanting you and I respected you, baby\nAnd now your tryin' to pull me while you're laying on your back\nWhat am I gonna do? Can it stay?\nCan it stay the way it was?\nSay goodnight and only hug?\n'Cause if we make love, we don't know what's to come\nYou're my only friend and I wanna keep you one\nCan it stay the way it was?\nSay goodnight and only hug?\n'Cause if we make love, we don't know what's to come\nYou're my only friend and I wanna keep you one\nOnly hugs\nOnly, only hugs\nI'm startin' to sweat and I'm losin' control\nI think I should leave, don't need a robe\nNow you wanna be a naughty girl, got me caught up in your naughty world\nBaby\nStop, don't, stop, don't\nStop, baby, stop\nI thought we moved on and we could be friends\nBut just lookin' at you makes me want you again\nCan it stay the way it was?\n(Baby, baby, baby, baby)\nSay goodnight and only hug?\n'Cause if we make love, we don't know what's to come\nYou're my only friend and I wanna keep you one\n(I don't want to fuss and fight with you, baby)\nCan it stay the way it was?\n(The way it was yesterday)\nSay goodnight and only hug?\n(You know, when I didn't have to pay)\n'Cause if we make love, we don't know what's to come\n(For makin' good love to you)\nYou're my only friend and I wanna keep you one\nLet's wait a while, don't move so fast\n(Oh baby, please don't move so fast)\nGirl, I miss you too, one more minute, girl, and I won't ask\n(I miss you)\nBeen there before, you know me, I know you\n(We been there, you know me, I know you)\nWill there be regrets if we make love, what we gonna do?\nCan it stay the way it was?\nSay goodnight and only hug?\n'Cause if we make love, we don't know what's to come\n(Can we say goodnight, say goodnight to you, bye, bye, bye)\nYou're my only friend and I wanna keep you one\n(Bye, bye, bye)\nCan it stay the way it was?\n(I don't wanna, I don't wanna, I don't wanna break us up)\nSay goodnight and only hug?\n(I wanna stay in love, baby)\n'Cause if we make love, we don't know what's to come\n('Cause I know you and you know me)\nYou're my only friend and I wanna keep you one\n(If we make love, to me what's it gonna be?)\n(Only hugs)\nOnly hugs, that's all we need, that's all we need\nBut baby, you 'bout to make me, you 'bout to make me\n(Only hugs)\nGo down, go down on you\nGo down on you, baby, only hugs, only hugs\nStop, hey, you said it wouldn't be like this\nYou said it wouldn't be like this, oh, oh",
 "image": "https://images.genius.com/b9db0d70668938496ef9eb327ebfd0da.450x450x1.jpg"
}