{
 "title": "Check It Out",
 "album": "MuchDance 2011",
 "year": "2010-09-03",
 "lyrics": "Oh, oh\nOh, oh\nOh, oh\nOh, oh\n\nSt-st-step up in the party like my name was \"That Bitch\"\nAll these haters mad because I'm so established\nThey know I'm a beast, yeah, I'm a fuckin' savage\nHaters, you could kill yourself (Ah)\nIn my space shuttle and I'm not comin' down\nI'm a stereo and she's just so monotone\nSometimes, it's just me and all my bottles all alone\nI ain't comin' back this time\n\nI can't believe it, it's so amazin'\nThis club is heated, this party's blazin'\nI can't believe it, this beat is bangin'\nI can't believe it, I can't believe it\n\nHey, check it out, check it out, check it out, check it out\nCheck it out, check it out, check it out, ch-check it out\nCheck it out, check it out, yeah, yeah, I'm feelin' it now\nCheck it out, check it out, check it out\n\nSt-st-step up in the party like my name is Mr. T\nAll these hating naggers ain't got nat'in' on me\nHonestly, I gotta stay as fly as I can be\nIf you Wiki Willy, you get super OG\nHoneys always rush me 'cause I'm fly, fly, fly\nDummies, they can't touch me 'cause I'm floatin' sky high\nI stay niggarific, you don't need to ask why\nYou just gotta see with your eyes\n\nI can't believe it, it's so amazin'\nThis club is heated, this party's blazin'\nI can't believe it, this beat is bangin'\nI can't believe it, I can't believe it\n\nHey, check it out, check it out, check it out, check it out\nCheck it out, check it out, check it out, ch-check it out\nCheck it out, check it out, yeah, yeah, I'm feelin' it now\nCheck it out, check it out, check it out\n\nCheck this motherfucker out\nIt got me in the club, in the club just rocking like this\nOh, oh\n\nDa-dun-dun\nThe sun done, yep, the sun done\nCame up, but we still up in dungeon\nDa-dun-dun, yep, in London\nCompetition? Why, yes, I would love some\nHow the fuck they get mad 'cause their run done?\nMad 'cause I'm gettin' money in abundance?\nMan, I can't even count all of these hundreds\nDuffel bag every time I go to SunTrust\nI leave the rest just to collect interest\nI mean interest, fuck my nemesis\nExclamation, just for emphasis\nAnd I don't sympathize 'cause you a simple bitch\nI just pop up on these hoes on some pimple shit\nAnd put the iron to your face, you old wrinkled bitch\n\nThis is mega nigga, u-u-ultra enigmatic\n-Matic, -matic, -matic, -ma-ma-matic\n\nOh, we just had to kill it\nWe on the radio, hotter than a skillet\nWe in the club, makin' party people holla\nMoney in the bank, we be gettin' top dollar\nI'm a big baller, you a lil' smaller\nStep up to my level, need to grow a lil' taller\nI'm a shot caller, get up off my collar\nYou a Chihuahua, I'm a Rottweiler\n\nI can't believe it, it's so amazin' (Yeah)\nI can't believe it, this beat is bangin' (Yeah)\nI can't believe it, it's so amazin' (Yeah)\nI can't believe it, I can't believe it\n\nHey, check it out, check it out, check it out, check it out\nCheck it out, check it out, check it out, ch-check it out\nCheck it out, check it out, yeah, yeah, I'm feelin' it now\nCheck it out, check it out, check it out",
 "image": "https://images.genius.com/ec9c696830851b21fe278b4509a67fd7.1000x1000x1.jpg"
}