{
 "title": "Get Back Up",
 "album": "No Mercy (Deluxe Version)",
 "year": "2010-10-29",
 "lyrics": "I'm only, I'm only human dog (Hello, out there)\nI'm only human dog (Can you, hear me?)\nI'm only human dog (It's an S.O.S)\nAy, ay listen to me (To let me, be me)\n\nAy when they push you down you got to Get Back Up (I'm only human dog)\nAy when they push you down you got to Get Back Up (I'm just a human y'all)\nPush the dirt, off your jersey then go for the cup (Ay, ay)\nOr the trophy, or the ring, champion no matter what\nCause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (Yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgement (Oh no no)\nFly as I'm is shawty I'mma rise above this (Oh no no no no)\n\nHey what it is world? Yeah it's me again\nBack before you, at your mercy, on bended knee again\nNo running from the truth, as much as we pretend\nThat it ain't what it is, then it hits CNN\nApologies to my fans and my closest friends (I'm sorry)\nFor letting you down, I won't take you down this road again (Uh-uh)\nMost of you now saying, \"Whatever, here we go again\" (What?)\nBlogs, radio and television all going in\nI laugh to keep from crying through all of the embarrassment (I gotta say)\nI gotta say you fucking haters is hilarious (Ha ha)\nHow dare you sit right there and act as if you holier than thou?\nPoint your finger now with me looking down (Down)\nSame clown that was Twitpicing at my wedding\nOn the same Twitter page disrespecting, wait a second\nNever mind my imperfections, this a fact, remember that\nNo mistake's too great to recover and bounce back\n\nAy when they push you down you got to Get Back Up (I'm only human dog)\nAy when they push you down you got to Get Back Up (I'm just a human y'all)\nPush the dirt, off your jersey then go for the cup (Ay, ay)\nOr the trophy, or the ring, champion no matter what\nCause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (Yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgement (Oh no no)\nFly as I'm is shawty I'mma rise above this (Oh no no no no)\n\nI admit, yeah I done some dumb shit, disappointed erry'body I know\nTry not to hold that against me though\nMy road to redemption has no GPS\nSo guess that time must be invested for this to be manifested\nYes it's, hard living life in the spotlight\nTrying to dodge the haters same time as the cop light\nThe Bible say \"Let he without sin cast the stone first\" (Stone first)\nThe sinner or the one who judged him, who was wrong first?\nYeah he go to work, never done no drugs up until the Fed\nHe just drink his liquor, touch his kids, beat his wife instead (Damn)\nDifference is my shortcomings hit the media\nThanks to TMZ, the AJC and Wikipedia\nSee the stairway to heaven while stepping down Jacob's ladder\nMy good outweigh the bad, God ain't that what really matter? (Nope)\nAnd matter fact, I'm wrong but after that\nThe good I done in yo' hood, should it over-shadow that?\nGot the world laughing at me for the moment\nBut it gonna be your turn 'fore it's over with, even if you're so legit\nThat you get a house with a dog and a picket fence (Ay, ay, ay)\nThe people with you then but when they turn on you remember this (Ay, ay)\n\nAy when they push you down you got to Get Back Up (I'm only human dog)\nAy when they push you down you got to Get Back Up (I'm just a human y'all)\nPush the dirt, off your jersey then go for the cup (Ay, ay)\nOr the trophy, or the ring, champion no matter what\nCause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (Yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgement (Oh no no)\nFly as I'm is shawty I'mma rise above this (Oh no no no no)\n\nHello, out there (I'm only human dawg)\nCan you, hear me? Can you, hear me? (I'm only human dawg)\nIt's an S.O.S\nTo let me, be me\nHello, out there (Ay you can love me, or either leave me)\nCan you, hear me? (Before you judge me, just let me be me)\nIt's an S.O.S (Ay you can love me, or either leave me)\nTo let me, be me (Before you judge me, see life ain't easy)\nHello, out there, yeah (Now, you gon' miss me when I'm gone)\nCan you, hear me? (I know when I'm gone, I bet you gon' miss me when I'm gone)\nIt's an S.O.S (You gon' miss me when I'm gone)\nTo let me, be me (I know when I'm gone, I bet you gon' miss me when I'm gone\nYou gon' miss me when I'm gone)\n\nI accept full responsibility for all the wrong I've done\nIf y'all thought I was perfect\nI apologise for being human man\nBut never again partner, you could put my life on that\n\nAy when they push you down you got to Get Back Up (I'm only human dog)\nAy when they push you down you got to Get Back Up (I'm just a human y'all)\nPush the dirt, off your jersey then go for the cup (Ay, ay)\nOr the trophy, or the ring, champion no matter what\nCause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (Yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgement (Oh no no)\nFly as I'm is shawty I'mma rise above this (Oh no no no no)\n\nHello, out there (Ay you can love me, or either leave me)\nCan you, hear me? (Before you judge me, just let me be me)\nIt's an S.O.S (Ay you can love me, or either leave me)\nTo let me, be me (Before you judge me, see life ain't easy)",
 "image": "https://images.rapgenius.com/13c3a9e0d054c7b3e43a946fd48f4b32.1000x1000x1.jpg"
}