{
 "title": "Get Big",
 "album": "Get Big",
 "year": null,
 "lyrics": " (Dorrough)\nHaha! {This is Nitti beat!}\nDorrough, I got somethin on my mind, homie\n{*\"Get big\" is repeated for four bars}\nHey! Hey! Dorrough, what's happenin? (Wassup?!)\nY'all thought I wasn't comin to see y'all? (Huh?)\n{NOW, it's Dorrough Music!}\n(You ain't (you ain't) got a (got a) 'nuff ('nuff) money (money))\n(You ain't (you ain't) got a (got a) 'nuff ('nuff) money (money) Ha!)\nDorrough, let's go and do this thing man (Yeah)\nYou ready?\n\nWh-wh-what you got a dollar in yo' pocket? A twenty in yo' wallet?\nSee me I'm stackin money, man I'll think I let you watch it\nGet - BIG, get - BIG\nGet - BIG, get - BIG\nYou ain't (you ain't) got a (got a) 'nuff ('nuff) money (money)\nYou ain't (you ain't) got a (got a) 'nuff ('nuff) money (money)\nGet - BIG, get - BIG\nGet - BIG, get - BIG\n\nDorrough, let's go and take it there\n\nSay, hu-hu-hundreds (hundreds) fifties (fifties)\nBitch, I don't exaggerate\nThis a game for ballers only, ballers can participate\nAll these niggas frontin, throwin money like they paper long\nEar big diamonds, throwin money now they paper gone\nIdiot! Wh-wh-what are you? \nCoach, we need a W\nAnd this nigga game suck, I think it's time to substitute\nThem ain't really diamonds in your ear, somebody hustled you\nTakin all your revenue, boy you don't know what to do!\nHa! Say you betta double hustle yo' fees\nOl' broke ass ras' ain't got enuff cheese\nAnd you out here lookin phony, tryna stunt like me\nNigga please~! Ol' broke ass nigga\n\n\nLet's go, verse two Dorrough\n\nSee money I can talk about\nBitch, I'm 'bout to run the South\nWalk around yo' city in my Dallas Texas fitted cap\nI be gettin money from you bitches, whatchu talkin' 'bout?\nSpendin all yo' money on these bitches, what is that about?\nNuthin! Beat ya whoopin ass, I be makin stupid cash\nGet special attention like them niggas in a stupid class\nWatch me, youngsters, motherfuckin monster\nPla-playin with this paper like I'm playin in a dumpster\nYo' baby mama payin all yo' bills, youse a busta\nEven though she workin 9 to 5, she still a hustla\nYeah, that means she's runnin' thangs, while you out here lookin lame\nDamn~! What a shame, ol' broke ass nigga!\n\n\nLil' mama know I'm in her city and I'm out here lookin pretty\nGettin' money 'til it's silly, I'm just out here on my Diddy\nWhat she say? Uh-huh, she like, (Yeah, he did dat!)\n(Ooh girl, yeah I like the way he did dat)\nGirl you know I'm greedy, touchy touchy feely feely\nFirst I stimulate the kitty when I hit her with this willie\nWhat she say? Yeah buddy, yea she like (Yeah, he did dat!)\n(Ooh girl, yeah I like the way he did dat)\nGet big! (Get big!) Get big! (Get big!)\nGet big! (Get big!) Get big! (Get big!)\nGet big!...Get big!\n{NOW, it's Dorrough Music!}\n\nAw man..\nDorrough, y'know we had to do this shit, homie!\nPlaymaker (Playmaker)\nIt's 2010, motherfuckers (Yeaaaaah)\nAnd I got somethin on my mind (Wassup?!)\nYeah, yeah, getcha money up fuck niggas\n(Getcha money up, boy)\nTexas, whas' happenin? (I got it, hahaha!)\nATL, Dorrough got a new one..",
 "image": "https://images.genius.com/b025c2e648cc9a6473010dfaaa757e0a.640x640x1.jpg"
}