{
 "title": "Lose My Mind",
 "album": "Trap Or Die 2: By Any Means Necessary",
 "year": "2010-03-30",
 "lyrics": "Let's get it, shawty!\nOh, this that shit right here, nigga\nWhat's up? Yeah! What's up?\n103, a-yo! (Yo)\nNigga, 103 (A-yo!)\nWhen this shit drop in the club, nigga\nA-yo! Yo\nIt go, it go...\n\nWhy y'all trip? (Tripping) I'm just fine (Fine)\n12:45 (Five), bout that time (Yeah)\nCouldn't get it all week, time to unwind ('Wind)\nDrink like a tank (Tank), lose my mind (Yeah)\nThis shit crazy (Crazy), way too bad (Bad)\nRosé, babe, waste two stacks (Yeah)\nHottest thing in the lot, that there mine\nCan't spell sober, lost my mind (Yeah)\n\nI'm hearing voices in my head, think I'm schizophrenic (Schizophrenic)\nI swear they saying, \"Let's get it,\" from another planet (Let's get it)\nThirty-six a thousand times, I'm doing somersaults (Somersaults)\nDo it right, and you can live your whole summer raw (Yeah)\nI'm out my mind, yeah, a nigga seeing double, y'all (Double, y'all)\nTell me, what's the chance of Jizzle fucking both of y'all? (Both of y'all)\nShe said, \"Long as we can do it with your ice on\" (Ice on)\nIf that's the case, we might as well leave the lights on (Yeah)\nI'm out my mind, just blew a thousand Swisher Sweets (Sweets)\nIn my black-and-orange Charger: call it Trick or Treat (Yeah)\nIt ain't nothing to a boss: my goons got goons (Goons)\nHouse stupid-dumb-big: my rooms got rooms (Yeah)\n\nWhy y'all trip? (Tripping) I'm just fine (Fine)\n12:45 (Five), bout that time (Yeah)\nCouldn't get it all week, time to unwind ('Wind)\nDrink like a tank (Tank), lose my mind (Yeah)\nThis shit crazy (Crazy), way too bad (Bad)\nRosé, babe (Babe), waste two stacks (Yeah)\nAyy, Young! This be rough, right?\nHottest thing in the lot, that there mine\nGoon Affiliated, baby!\nCan't spell sober, lost my mind (Yeah)\nAyy, ayy\n\nGuess what my mama told me? (What?) She hate my partners (What?)\nGuess why she hate em though (Why?) 'Cause all of em robbing\nFuck the police (Fuck 'em), cause all of them problems (Problems)\nWhite girls fun (Why?), 'cause all of them swallow (Swallow)\nWhy I ain't fuck her at the house? 'Cause the bitch hollered (Bitch)\nAnd where the pill man at? She need a blue dolphin (Dolphin)\nOld broke-ass nigga (Broke): stop cock-blocking (Blocking)\nSecurity, I need help cause the bitch stalking\nA half fuckin' mil' (Half), that's what the whip cost me (Cost me)\n100 dollars (What?), that's what the pussy cost me (Ha)\nAnd when the niggas start hating, that's when the nigga lost me (Lost me)\n\"Fantástico,\" that's what the hoes call me\n\nWhy y'all trip? (Tripping) I'm just fine (Fine)\n12:45 (Five), bout that time (Yeah)\nCouldn't get it all week, time to unwind ('Wind)\nDrink like a tank (Tank), lose my mind (Yeah)\nThis shit crazy (Crazy), way too bad (Bad)\nRosé, babe, waste two stacks (Yeah)\nHottest thing in the lot, that there mine\nCan't spell sober, lost my mind (Yeah)\n\nDrop the top, no bra, got the titties out (Titties out)\nMention my name and bring the whole city out (Yeah)\nDoing what I do best: d-boy stuntin' (Stuntin')\nNew car, old money, d-boy stuntin' (Yeah)\nStep in cleaner than a new Glock-40 (Forty)\nMy nickname in the A: \"Strapped-Up Shawty\" (Yeah)\nYou know my nerves bad, trigger like a toothpick (Toothpick)\nLine wrapped around the corner, boy, too big (Yeah)\nG-Code, black shades and my black chains (Black chains)\nLook, you wouldn't understand, it's a black thing (Black thing)\nYou know we drink that Rosé til we black out (Black out)\nWake up, drink some more, pass back out (Yeah)\n\nWhy y'all trip? (Tripping) I'm just fine (Fine)\n12:45 (Five), bout that time (Yeah)\nCouldn't get it all week, time to unwind ('Wind)\nDrink like a tank (Tank), lose my mind (Yeah)\nThis shit crazy (Crazy), way too bad (Bad)\nRosé, babe, waste two stacks (Yeah)\nHottest thing in the lot, that there mine\nCan't spell sober, lost my mind (Yeah)\n\nWhat's up? (Nigga)\n103, yo! (Yo)\nNigga, 103 (A-yo! A-yo!)\nNigga, 103! (A-yo! Yo!)\nIt go, it go...",
 "image": "https://images.genius.com/4c68004c8240c1b8f85781bce899a45a.600x600x1.jpg"
}