{
 "title": "Roger That",
 "album": "We Are Young Money",
 "year": "2009-12-21",
 "lyrics": "I'm in the collard green 6, cornbread in the guts\nGot the Halloween kicks, trick-or-treating the clutch\nC'mon nigga, is you tricking or what?\nFlow, flow tighter than a dick in the butt\nJust hopped off the plane, came back from Vancouv'\nLittle white tee, some boobs, and bamboo\nWhite girls tell me \"Hey Nicki, your camp rules\nIs that why you get more head than shampoos?\"\nAs-Salaam Alaykum, no oink for me\nAnd I never let a d-boy boink for free\n'Cause it's Barbie bitch, you can join the wave\nI've done penny nickel dimed, I done coined the phrase, ha!\nYou couldn't beat me there if you had a Lear\nIndian-style, courtside with a cavalier\nV.I.P. rosé; you can have a beer\n'Cause honey when you getting money you don't have a care\n\nNow R-Roger that, R-R-Roger that\nR-Roger that, R-R-Roger that\nR-Roger that, R-R-roger that\nR-R-R-R, ROGER\n\nYoung black Ricos,\n \nkill for the C-notes\nBut me though, I Jackson bitch uhh, Tito\nShe wanna play games but, this is not bingo\nMonopoly, I'm past go, go on ahead and deep-throat\nFour chick foursomes, skin color's mocha\nSally and Sonia, put the pussies on my totem\nPole vault stroke 'em uhh, strike ya like bowling\nNow open like you yawning, it's 6 in the morning\nSleeping on me, probably in a coffin\nI'm hotter than the end of fucking August, I'm awesome\nI'm awesome: repeat it to ya grandma, and uncles\nOr mothers, Tyga's no dad but I'm the motherfucker\nMotherfuckers, this the last supper\nLook, no hands, I'ma bread cuffer\nI don't dare love her, I'ma daredevil\nI don't fear nothing motherfucker, Young Money!\n\nNow Roger that, Roger that\nRo-Roger that, Ro-Ro-Ro-Roger that\nFuck around and never get Roger back\nHa ha ha\n\nI'm goin' in!\nFresh off the jet, \nsharper than Gillette\nThe blunt still wet, so \npass it like Brett\nWe sip side of mug, we call it upset\nSmoke more than four quarters, we call it sudden death\nI'm a beast. You a pet\nAK long neck. Keith Sweat, haha!\nWeezy motherfucker, Capo in this bitch with me\nMoney talks and have a convo in this bitch with me\nI'm mountain high Colorado in this bitch with me\nFlow crazy 7:30, you just 6:50\nTwenty bullets from the chopper take the roof off\nLaughing to the bank, I'm a goofball\nHahaha! It's YM\nAnd we at your neck, like a violin\nIt's our world, we make it spin\nAnd y'all the prey- amen!\n\nNow Roger that, Roger that\nWhere Roger at? I heard Rog' a rat\nFuc-fuck around and never get Roger back!!\nHahahaha",
 "image": "https://images.genius.com/85967f2988d0715a35c3a6f4eaf13c9f.1000x1000x1.jpg"
}