{
 "title": "Tie Me Down",
 "album": "Skinny Jeanz and a Mic",
 "year": "2009-09-15",
 "lyrics": "Yeahhh \n(Knockout) (Knockout)\n(Knockout)\n  (Ay-yup, yeahhh)\nBut she ain't gon' tie me down\n (Ray J)\nNah (New Boyz)\nBut she ain't gon' tie me down\n(No she ain't gon' tie me down)\n\nShe ain't gon' tie me down, while you on the road\nBuying all the shirts, all the hats, all the clothes\nWhat'chu want right now? Whattup right now?\nI think you need to close your mouth\nCause you ain't gon' tie me down\nTie me down, tie me down, you ain't gon' tie me down...\nYou ain't gon' tie me down\n\nAyyy, know we been together for a minute\nBut uh, its kinda been forever since we been in\nThe kinda situation not involvin other women\nAnd it's pretty obvious that your kinda trippin\nLike \"Who the hell is this bitch?\nLookin a hot mess, what you fell for this chick?\nYou know we got problems and you failed to fix it\"\nI'm like \"You need to go somewhere else with this shit\"\nBecause, I ain't gon' put up wit'chu\nTalkin 'bout how she make you uncomfortable\nLike I mean, shit I'm only 17\nAnd um a perfect couple is only in a dream\nAnd right now I'm pretty much away for this\nRelationships? I think you should wait for it\nI mean later we could try things out\nBut not right now\n\nShe ain't gon' tie me down, while you on the road\nBuying all the shirts, all the hats, all the clothes\nWhat'chu want right now? Whattup right now?\nI think you need to close your mouth\nCause you ain't gon' tie me down\nTie me down, tie me down, you ain't gon' tie me down...\nYou ain't gon' tie me down\n\nHa ha, yeah, look\nAy girl whattup? No I'm not gon' make a scene\nBut you can't tie me down like a pair of shoestrings\nYeah you cute, so what? Girl let's get it through your head\nYeah we make love, sex, weed all in the bed\nIt's the \"Best That I Ever..\" but things gon' change\nWhen I'm not faithful, you be feelin all pain\nNow you stuck like a stain and I can't believe that\nBaby girl 100, I ain't tryin to do that\nGot so many girls and I ain't lettin go\nCause my life is great, and you ain't nothin but a ho\nYeah you come to my shows and you very supportive\nJust show me a camera and my show recorded\nIt was nice, but I'm suprised that you still standin here\nAs you know, I'm a man, and I have no fear\nI'mma start it from the top, girl this ain't no lovin\nI'm a New Boy girl so\n\nShe ain't gon' tie me down, while you on the road\nBuying all the shirts, all the hats, all the clothes\nWhat'chu want right now? Whattup right now?\nI think you need to close your mouth\nCause you ain't gon' tie me down\nTie me down, tie me down, you ain't gon' tie me down...\nYou ain't gon' tie me down\nShe ain't gon' tie me down, while you on the road\nBuying all the shirts, all the hats, all the clothes\nWhat'chu want right now? Whattup right now?\nI think you need to close your mouth\nCause you ain't gon' tie me down\nTie me down, tie me down, you ain't gon' tie me down...\nYou ain't gon' tie me down",
 "image": "https://images.genius.com/a03734a9d6b411a2ea7a7e4d6ce933df.750x750x1.jpg"
}