{
 "title": "We Got Hood Love",
 "album": "Stronger With Each Tear",
 "year": "2009-12-18",
 "lyrics": "Sometimes I don't get a chance to really tell you\nBut I promise you, my love will never fail you\nDon't you get it? Right now, we're writing history\nA thousand years from now, they'll talk about you and me\nI know sometimes I go hard for no reason at all\nPut your soul through the business and test the weight of your heart\n'Cause when your back's on the wall and there's a shortage of friends\nYou know that I'm with you until the end\n\nWe got hood love, I be fussin', I be screamin' like it's over\nThen I'm longin', then I'm fienin' just to hold ya\n'Cause that's how we do\nYou know that hood love is a good love, that's me and you\nHow you feel, love? When I'm with you, never quit you\nNow that's real love, when you ain't here, then I miss you\n'Cause I still love the way that we do\nYou know that hood love is a good love, that's me and you\n\nSometimes I think about leaving you\nBut when I think about what we've been through, yeah\nI get a feeling like it could be the worst\n'Cause I've given you my best and I don't mind it, that's fine\n'Cause when you love somebody hard, then you'll love that way for life\nYou got all of my heart and I'll never leave your side\nI gave my word to love you all the way 'til the end\nSo no matter what I'll be right here I'll be right here 'cause\n\nWe got hood love, I be fussin', I be screamin' like it's over\nThen I'm longin', then I'm fienin' just to hold ya\n'Cause that's how we do\nYou know that hood love is a good love, that's me and you\nHow you feel, love? When I'm with you, never quit you\nNow that's real love, when you ain't here, then I miss you\n'Cause I still love the way that we do\nYou know that hood love is a good love, that's me and you\n[Verse 3: Trey Songz & \nMary J Blige\n]\nNow I play tough but not for too long\nYou are someone I depend on\nNo matter how I act at times, I could never walk away\nI thought about it plenty times, but no one could take your place\nWell, if there ain't no you, then there ain't no me\nAnd if there ain't no us, then I'd rather be\nBy myself 'cause no one else\nCan know just what I need and really understand me\n[Hook: Mary J. Blige & \nTrey Songz\n]\nWe got hood love, I be fussin', I be screamin' like it's over\nThen I'm longin', then I'm fienin' just to hold ya\n'Cause that's how we do\nYou know that hood love is a good love, that's me and you\nHow you feel, love? When I'm with you, never quit you\nNow that's real love, when you ain't here, then I miss you\n'Cause I still love the way that we do\nYou know that hood love is a good love, \nthat's me and you",
 "image": "https://images.genius.com/08d9cb42855b0e433b8d0e5fe5215662.600x600x1.png"
}