{
 "title": "Chill Bill",
 "album": "Straight Bummin’",
 "year": "2015-06-25",
 "lyrics": "Dun, dun, da-da-dun\nWater, ah, huh\nMwah!\n\nRob $tone, two damn phones, babylons can't crack the code (no)\nUsed to sip out styrofoam but figured I should stick to dro (Weed!)\nBackwoods overload, don't like to smoke them Swishers, ho\nIf you hit my liquor store, it's 50 cents for single Ports\n\nSaid she wanna roll with me and smoke up all my weed\nI said, \"Baby just buy Dutches 'cause you can't smoke for free\nI got some loud but no money, babe, buy me a Fiji\"\nShe said, \"You need a job\", bitch, fuck a job, I still get cheese\n\nTwo cell phones, Mr. Mothafuck A Thot\nMr. I Be On That Block, 1207, fuck an opp\nThey hear my name, they see my squad, rollin dope up on the spot\nI'm with your bitch, she on my jock, ain't got no time to love a thot\nGot niggas mad my flow so hot, got niggas mad my squad won't stop\nWe in the game, won't take no loss, I'm sippin' water out the Voss\nGot lean all in my fuckin' Sprite, turnin' up on fuckin' sight\nMr. Kenny Powers 'bout to take your girlfriend home tonight, bitch\n\nAnd I'm smokin' on that widow when you see it out the window\nGot a dusty old tee, lookin' bummy, leave it simple\nGrowin' up, I was always in the middle\nSo I gotta hold it down for my older and my little\nAnd my brothers beside me, so fuck it, we mobbin' deep\nAlways grimy, no findin' me, but I be in LG\nIf your lil' fuckboy lame ass wanna creep\nI live by the lemon 'cause that fucker chose me\n\nSaid she wanna roll with me and smoke up all my weed\nI said, \"Baby just buy Dutches 'cause you can't smoke for free\nI got some loud but no money, babe, buy me a Fiji\"\nShe said, \"You need a job\", bitch, fuck a job, I still get cheese\n\nYeah, got 1207 in this bitch, God\nShoutout to that nigga Burgers\nHe over there flipping them burgers though\nThat nigga Andy\nWe don't know where the fuck Andy's at\nBut that's my nigga (Squad)\n1207, bitch\nWater, coming up\nWater\nWater",
 "image": "https://images.genius.com/952d814fc11cc4f5a0d2e5ec5e84e89a.500x500x1.jpg"
}