{
 "title": "Come And See Me",
 "album": null,
 "year": "2017-01-05",
 "lyrics": "Usually hear the phone late night like now\nShe usually say no, but she almost always breaks right down\nShe finna drive an hour to my house, right now\nCan't wait to break the walls and knock all your lights out\nShe said that she should probably be alone right now\nHow long has it been?\nWhy are you even all up on my phone right now?\nYou leave my body weak\nThen you disappear for weeks\nAnd I'm way too strong right now\nWhere you been?\nWhy do you go missing?\nWhere you be when I need your attention?\nI know that you need that (need some)\nTell me you don't miss it you don't want it right now\nCause all I need to hear, you can lay it back down\nTell me you don't think about it, that's a damn lie\nDon't nobody make it feel, make it feel like when I'm inside\nYou don't got to gas me girl, I'm full up\nImma let you get some sleep, get some give up\nShe said you really want this pussy, you would pull out\n\nCome and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\nAll she ever say is, come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\n\nWaist too slim, got a face like Rihanna\nSay you sick and tired of the drama\nI just want to give you oh na na\nWhile your dad and mom top shotta\nI know I haven't called in a long time\nI been in the zone on my own time\nNo days off talking long nights\nNever at the crib on the long flights\nI just gotta know if it's mine tonight\nI got some time tonight\nImma roll the gas oh\nWho could fuck your bed up\nFace down hit the ass up\nYou know I keep it wetter\nImma hit it every angle\nNeighbors know my name\nGot you screaming Mike Angel\n\nCome and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\nAll she hit me with is, come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\n\nYou been putting time aside for me\nYou say I never got the time for you\nI be in the zone, I be worried about my own thing\nGirl, I know it's wrong to be this selfish\nBut I got some problems inside I don't never tell nobody\nBut there's something when I look in your eyes\nThat say it's okay for me to love you\nSay it's okay for me to trust you\nSay it's okay for me to need you\nImma put it out there, yeah\nI'm scared\nStopping at the store\nYou want anything from here?\nTen minutes Imma be there\nAll she sayin'\n\nCome and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me\nAll she ever say is, come and see me for once\nCome and see me for once\nYou don't ever come to me, you don't ever come to me",
 "image": "https://images.genius.com/784d9135e67da7eb9bab97646a1d8aef.674x674x1.png"
}