{
 "title": "24",
 "album": "Epidemic",
 "year": "2020-02-21",
 "lyrics": "(Yo, Nflated, spice that bitch up)\n\nBurnin' on Lilikoi in some Louis corduroys\nR.I.P. Kobe Bryant, R.I.P. 24\nI can make a cool 50K in less than twenty-four hours\nRidin' with the pack through the Tennessee mountains\nVPN, SOCKS, and at least three routers\nI'ma thumb through it, I don't need no counter\nHad to resuscitate a bitch, my neck almost drowned her\nI got oil, I got hemp, I got wax, I got flower\nBurnin' on pre-roll, finna go to Pluto\nDrippin' real hard when I'm hoppin' out two-door\nI just met a psychedelic plug named Hugo\nThirty laptops in my motherfuckin' condo\nWhite collar diamonds, nigga ballin' like Lonzo\nThese niggas overrated like Joe Flacco\nFeelin' like Jim Jones, nigga, I'm a capo\nI'ma flip the Rolls-Royce, I'm feelin' like Pop Smoke\n\nBanana Cream Cake in my motherfuckin' hemp wrap\nIf I don't like the smell, then the pack get sent back\nIf I don't like his energy, I push a nigga shit back\nMaking hash oil, listening to Bank, Big Facts\nMaking hash oil, listening to Scream, Big Facts\nAll that slick talkin' finna get a nigga kidnapped\nGelonade got a nigga finna go and lift off\nI'ma empty out the magazine when I'm pissed off\nI'm on that Wedding Pie, it got me geeked\nMy bitch hit it twice and then she went to sleep\nI drop bud on the clock with the perfect technique\nI'ma hit from the rear, I wan' grab her obliques\nI ain't got time in the day for my females be mad at me\nInternet racks, I'ma run it up rapidly\nShe know I'm vicious, I'm fuckin' her savagely\nShe know I get racks, she know my mentality\nGrew up in the trap watching Kobe yam on a nigga\nPull up in the Porsche, yeah, the Pan' on a nigga\nYeah, pull up in the Dodge, yeah, the Ram on a nigga\nAnybody try, yeah, I'ma blam on niggas\nOnly hit banks, got fifty different cred' lines\nTurn a lady's son to a FOX 5 headline\nI was over drippin', I should start my own clothing line\nGot two jits, dawg, I'll die for both of mine\nI ain't never satisfied 'til my money increase\nFucked up the profile, too many inquiries\nThey be low-key hatin', I can hear 'em whispering\nAll these baguette chains, you can see 'em glimmering\nHad to make a U-turn, I just seen a roadblock\nI ain't playin' no games, I ain't sparin' no opps\nIt's a full moon now, so I'm burnin' Moon Rock\nLivin' off schemes, why is he on tip-top?\n\nBurnin' on Lilikoi in some Louis corduroys\nR.I.P. Kobe Bryant, R.I.P. 24\nI can make a cool 50K in less than twenty-four hours\nRidin' with the pack through the Tennessee mountains\nVPN, SOCKS, and at least three routers\nI'ma thumb through it, I don't need no counter\nHad to resuscitate a bitch, my neck almost drowned her\nI got oil, I got hemp, I got wax, I got flower\nBurnin' on pre-roll, finna go to Pluto\nDrippin' real hard when I'm hoppin' out two-door\nI just met a psychedelic plug named Hugo\nThirty laptops in my motherfuckin' condo\nWhite collar diamonds, nigga ballin' like Lonzo\nThese niggas overrated like Joe Flacco\nFeelin' like Jim Jones, nigga, I'm a capo\nI'ma flip the Rolls-Royce, I'm feelin' like Pop Smoke",
 "image": "https://images.genius.com/040a0d8c6f5567c43efdf058e257930e.1000x1000x1.jpg"
}