{
 "title": "All In",
 "album": "Top",
 "year": "2020-07-25",
 "lyrics": "12Hunna on the beat\nGoddamn, BJ with another one\n\nIf I say how I feel, would you really listen?\nIf you was all mine, I'd be all in\n\nCame up outta that dirt pile, now I'm ballin'\nAnd I don't need no church when I'm Heaven-sent\nHope God put loyalty in all my friends\n'Cause Lord knows I got they back to the end\nRight now I'm recordin' with the mic' sittin' in my hand\nI wish Three was on my left, where my styrofoam is\nGot up out of Cypress, went to the Woodlands, got a safe room in my crib\nAin't no tellin' when I'ma have to use it, we all know how I live\nKeepin' my gun everywhere I go, we all know I'm still here\nQuestion my girl, but love her strong, we all know how that is\nPayin' for my daddy to come home, pray he get a appeal\nHope he come take me away, keep me from off of these pills\nAnd come get me from off of this drank before my kidneys, they fail\nTell my son he make me calm, I don't know what I'm doin'\nTell my girl these hoes can't make me cum, I only want her to do it\nTen lines straight, goin' on ten days, my body ain't got no fluid\nPlease, oh, please don't die tryin', on the real\nAll alone, stalks and the shottas are unjudgemental\nIt ain't too far, right by the A.M. Mart where they left my nigga\nWon't be that long, yeah, it'll be a while\n'Til my love life right again, killas on side again\nButterflies, paradise, them bullets left out the wind\n\nIf I say how I feel, would you really listen?\nIf you was all mine, I'd be all in\n\nIf I took the clean route, bank accounts got cleaned out\nWe'll still be at war, ridin' with the mops, tryna wipe the block down\n.50 rounds on the bottom of that Glock, standin' in front mom's house\nSteady screamin', \"Gang life,\" know my time comin' 'round\n\nIf I say how I feel, would you really listen?\nIf you was all mine, I'd be all in\nIf I say how I feel, would you really listen?\nIf you was all mine, I'd be all in\n\n12Hunna on the beat\nGoddamn, BJ with another one",
 "image": "https://images.genius.com/ccf7e5cb45da070c0ff6576beab740fb.1000x1000x1.png"
}