{
 "title": "BLAME IT ON BABY",
 "album": "BLAME IT ON BABY",
 "year": "2020-04-17",
 "lyrics": "I'm like fuck it, let the beat build, nigga\nI do my own thing, ain’t worry 'bout how he feel nigga, let's go\nSpecial ed, yeah, I’m a re-re nigga\nCan I get a re?\n (Ahem) Yeah, a refill, nigga\nYa favorite rapper say he fuckin' with Baby, somebody lied\nPlay with ya kids, 'cause the last nigga played me, somebody died (Yeah, yeah)\nPlayin' both sides, go play the victim, oh, now they cryin'\nI water park when I slip in my baby, she let me slide\nChocolate-ass nigga (Yeah), real nigga rockstar\nPlatinum sellin' popstar, poppin'-ass nigga (Pop)\nMy bitch is like a Barbie, woo like I'm Pop Smoke\nI lift up one leg when she drop that ass, nigga (Drop)\nShade Room, baby (Shade), shade who?\nEverybody blame you, you ballin’ like you Babe Ruth, baby (Huh)\nBlame it on Baby, I let the beat build \n(\nWait a minute, who are you?\n)\nOkay K.i.D, drop the beat and watch me take it home, baby (Let’s go)\n\nI get chicken, no tender\nFine lil' bitches on Twitter\nDenyin’ all these hoes on Insta\nBrand new drip\nI wear it one time like a nigga can't fit it\nBlame it on Baby, a greasy lil' nigga (Grease)\n​iPhone ringin', who is it? (Brr)\nProbably some lil’ nigga bitch\nHe fuck with my old ho\nAnd he think he hurtin' my feelings, I already hit (Haa), psych\nHe must ain't heard about Baby\nHe must not know about Jon Jon\nI heard they shut down the airport\nHopped on a jet to LA, bitch, I'm ballin' like Bron-Bron\nBDB, we gon' cut up regardless\nI know I'm on top, I'm a target\nMy young nigga ballin' like Giannis\nYou play, we gon' pull up and shoot\nTop floor of the penthouse, biggest one still in Charlotte (Let's go)\n\nI know these hoes gon' creep\nI'll never be a fool and think that she me\nI'm the type to let a ho do what she want\nI'm the type to let a bitch do what she please (Please)\nI ain't breakin' bread, I'm cheap\nNine out of ten of these niggas naive\nLame-ass nigga, might as well be a rat\nLettin' all these hoes run away with yo' cheese, (Slow down, slow down) please\n\nI'm startin' to think that y'all the police, nigga\nYou know that shit you see on IG, you don't know me, nigga, let's go\nYou crossed the line, gon' have to show me nigga\nThey be like \"Why you switched the beat​?\" Because my flow neat, nigga\n\"I thought he couldn't switch the flow, how the hell he switchin' the beat up?“\nThey don't know who they fuckin' with, do this shit with my feet up\nYawning on these niggas, sit back, go to sleep\nI get woke by a lil freak, with my dick in her mouth, she eat up\n300K in cash, probably still'll pull out a Visa\nAin't goin' on a date, tell a bitch to order a pizza\nGon' end up eatin' Domino's, I can't even lie\nI'm a player, I had all kind of hoes way before the designer clothes\nI put on a sweatsuit and leave with ya ho\nA whole arena full of people to see me at the show, you know?\nI rock the show and I lay low with my freak\nIt ain't too many rappers that can fuck with me, and she know, let's go\n\nI know these hoes gon' creep\nI'll never be a fool and think that she me\nI'm the type to let a ho do what she want\nI'm the type to let a bitch do what she please (Please)\nI ain't breakin' bread, I'm cheap\nNine out of ten of these niggas naive\nLame-ass nigga, might as well be a rat\nLettin' all these hoes run away with yo' cheese, please",
 "image": "https://images.genius.com/fd3a2acc2a6cfc5a37dd3e57ffc07c7e.1000x1000x1.jpg"
}