{
 "title": "Cry Baby",
 "album": "Good News",
 "year": "2020-11-20",
 "lyrics": "Real hot girl shit\n(d.a. got that dope)\n\nThat ain't DaBaby, that's my baby\nHer friends and mom hate me (Go)\nLay down on the bed, do the crybaby (Mmm)\nShe ain't gave me none of that pussy in a while\nShe had the boy waitin', I don't mind waitin' (Come here)\nOh, you ain't gon' respond to my texts? (Oh, yeah?)\nWant me keep on my diamonds, we sex? (What's your name?)\n\nKeisha? (Kei), Jasmine? (Jas), Kiera? Megan? (Go)\nLisa? Ashley? (Ashley), Sierra? Sarah?\nShe got her hands on her knees with her ass in the air, ooh, that lil' bitch a player\nIf her friends ain't around to record it, she bend over, shake that lil' ass in the mirror\nLike goddamn, what a nigga gotta do for your number?\nShawty came through with that head so good, I said fuck it, I ain't usin' no rubber\nWay she make that ass bounce, think I love her\nGot that ass and that mouth from her mother\nType to make your bae mad, you in trouble\nNBA playoffs that ass, it's a bubble\nUh-uh, uh-uh, come here, come here, uh-uh\nThrow that ass back, come here, come here\n\nThat ain't DaBaby, that's my baby\nHer friends and mom hate me (Go)\nLay down on the bed, do the crybaby (Go)\nShe ain't gave me none of that pussy in a while\nShe had the boy waitin', I don't mind waitin'\nOh, you ain't gon' respond to my texts? (Oh, yeah?)\nWant me keep on my diamonds, we sex? (What's your name?)\n\n(Wah, wah, wah, wah) Real hot girl shit (Ayy, ayy, ayy, ayy)\nLay on my stomach, toot it up, do the crybaby (Crybaby)\nLook back, hold it open, now he annihilated (Yeah)\nMoaning like a bitch when he hit this pussy\nDamn, he probably wanna wear my hoodie (Ah)\nChoke me, spank me, look at me, thank me (Thank me)\nIf I give it to another nigga, he'll hate me (He'll hate me)\nSpit, slurp, give him that work\nFell too fast for me, now the nigga hurt\nDeeper, deeper, I need a reaper\nThought I was in trouble how he tearin' them cheeks up\nKeep me a freak, who the flavor of the week?\nIf I make up the rules, then I don't think it's cheatin'\nJordan, Tommy, Timothy, Daniel (Which one?)\nMight let Jonathan bring in Sarah (Come here, Sarah)\nBitch tryna brag about taking my man (Huh?)\nHah, I needed me a nigga off my hands (Hahahaha)\nUh-uh, don't fuck me like that, fuck me like this, yeah, ayy\n\nHis friends and his dad hate me (Yeah)\nI broke his lil' heart, he a crybaby (Wah-wah-wah)\nIf I ain't let him hit the pussy by now\nThen that nigga lame if he still waitin'  (Ah, ah, ah)\nI ain't even save your number (Nope)\nSo no, I can't reply to no text (No text)\nI make him cry 'bout the pussy, hmm\nProbably why my shit so wet (Ah, ah, ah, ah, wah, wah, wah)",
 "image": "https://images.genius.com/d30190e9e0a78f306b4ee9a9c6dcb8ab.1000x1000x1.png"
}