{
 "title": "Don’t Rush",
 "album": "Plead The 5th",
 "year": "2019-11-07",
 "lyrics": "Don't rush, slow touch\nBrown and white, like I go cunch\nGrab and buy, make 'em go bust (Buss)\nEye for eye, make 'em lose trust\nWhite rum, fizzy pop (Pop)\nWhere you dey go? (go) We dey go up\nCatch my vibe (Vibe), let me go off (Off)\nBlammed her twice, man it's so tough\n\nAight yo, put the Belaire on her batty, make it kotch\nSeen the watch, now she wanna give crotch\nBoy got ps, now she hopping in the pod\nMan in real life sugar, gyaldem haffi get wopped (Yeah)\nKnow she want dark, told her \"Meet me at the top\"\nSwitching lanes the other day, I seen her waiting for a bus\nBaby this a Moncler sweater, Diesel denim\nBuy another while my pockets fat like Heather\nNeck froze like I don't know no better\nBenzo truck, white seats and they leather\nGo broke never, on my grind\nShe make it clap like I'm Busta Rhymes\nI got the juice, the sauce and all them things\nI blammed her twice tonight with all my bling\nBig Benz, I drive, I brought that ting\nAny girl you want, they want my ting\n\nDon't rush, slow touch\nBrown and white, like I go cunch\nGrab and buy, make 'em go bust (Buss)\nEye for eye, make 'em lose trust\nWhite rum, fizzy pop (Pop)\nWhere you dey go? (go) We dey go up\nCatch my vibe (Vibe), let me go off (Off)\nBlammed her twice, man it's so tough\n\nFlood my ice, make a ho blush\nBack at the tour bus, gettin' caught up\nDSquared got 'em distressed, gotta hand wash\nNew racks with the old Nikes in the shoe box\nKeep my stripes, no cuffs\nPull up in a new plate and she might just\nShe weren't tryna move bait when our eyes locked\nNew tints on the coupé, that's her head lost\nOff my whites, right my wrongs\nGucci my mum, while you diddle your thumbs\nCount my sums, this is gonna get long\nLove my green, I'm tryna get strong\nTryna get bun, where I'm from, it's on\nYes, man don't take no dumb, threats\nThey see funds, they hop, fence\nWe been up, not up next\n\nDon't rush, slow touch\nBrown and white, like I go cunch\nGrab and buy, make 'em go bust (Buss)\nEye for eye, make 'em lose trust\nWhite rum, fizzy pop (Pop)\nWhere you dey go? (go) We dey go up\nCatch my vibe (Vibe), let me go off (Off)\nBlammed her twice, man it's so tough\n\nAnd introducing\nThe one and only\n\nBig truck, no clutch (Clutch)\nWrist froze, don't touch\nFrench Ciri, I'm so drunk (Turnt)\nCourse I can't drink and drive, where's my chauffeur?\nBando upsuh, whip that coca\nI really hope this time my worker don't floss\nSee, I was in the wok, now my penthouse at the top\nShawty said they're best friends, I bet they both fuck\n'Cause they won't cuss, 'cause they said I sold drugs\nAnd when you down there, ain't nobody around\nWhere's the comeback? When you blow up\nI forgot my jacket but my heated seats help me warm up\nFast train to Inverurie, I used to go up\nIt's ironic, I just sold out my show in Scotland\nUsed to say I wanna put Tottenham on the map\nBut one day I'ma change the map in Tottenham\n\nDon't rush, slow touch\nBrown and white, like I go cunch\nGrab and buy, make 'em go bust (Buss)\nEye for eye, make 'em lose trust\nWhite rum, fizzy pop (Pop)\nWhere you dey go? (go) We dey go up\nCatch my vibe (Vibe), let me go off (Off)\nBlammed her twice, man it's so tough",
 "image": "https://images.genius.com/e0c0be6323c69f27246d263d05c34ece.640x640x1.png"
}