{
 "title": "Don’t Stop",
 "album": "Good News",
 "year": "2020-10-02",
 "lyrics": "Real hot girl shit\nAh, ayy (Buddah bless this beat)\n\nI got a stank ass walk and a reckless ass mouth (I don't give a fuck)\nAnd my shit so tight, when we fuck, my pussy talk (My pussy talk)\nI don't even say, \"What's up?\", I just tell him what I want (What I want)\n'Cause I got another nigga that's gon' do it if he don't, ah\nAttitude bad, pussy too good (Yeah)\nWhen he say, \"Fuck me,\" I tell him, \"Fuck me good\" (Good)\nChase these niggas? I wish I would\nBad bitch like me? Hoes wish they could (Could)\nShe a Casper to me, I need glasses to see\nIn the mall with her daddy, she a bastard to me (Yeah)\nYou ain't fuckin' him right, bitch, pass him to me\nReal niggas love me from the H to thе D\n\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shakе that shit (Brr, brr, brr)\nHmm, hmm, work it, bitch\n\nPatek just for the day (Sex)\nShe gotta go, roll the Ace of Spades\nShe catch a cold when she rock the chains (Catch a cold)\nBut let me see, Pinky and the Brain (Huh)\nOur baby mamas ain't the same (No)\nShe like, \"Baby daddy, ice my chain\" (Ice)\nShe 'bout to come and give me top like a crane (Woo)\nYou a bitch and a ho, but you gang, ayy (Ayo)\nShake what your doctor gave ya\nAnd I'ma ice your wrists like a player (Ayy)\nDoctor Miami add layers\nNow the ass is fat like an acre\nCome to the spot and we lay up\nAnd I'll cream that pussy like mayos\nEver since I got my cake up (Woo, woo)\nI been runnin' these bitches like the mayor (Whew)\nDon't stop, hatchback (Uh, uh)\nShakin' that ass on Snapchat (Yeah)\nOff the script and shakin' that ass (Uh)\nWhat you'll do for these rack, racks (Yeah, woo)\nWhere my thots at? (Mmm, mmm)\nI just freed this bitch like a bird, yeah (Yeah)\nWhere my thots at? (Mmm, mmm)\nLet me hit it from the back, say, \"Slatt, Slatt\"\n\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shake that shit (Brr, brr, brr)\nHmm, hmm (Hey), work it, bitch\n\nI'm gon' blow him like AC (Mwah)\nGive me big head like IT (Ah)\nLick, lick, lick me 'til I scream\nTwist his tongue like I, I mean\nI mean my body so out of this world\nChange my at name to ASTROGIRL (ASTROGIRL)\nPeople say I'm way too full of myself\nYou're right, and I ain't even made it to dessert, ah\nBuffy, no Angel, star, no spangle\nForty-inch weave by Kellon don't tangle\nCall my drug dealer boyfriend on Tango\nUse the Tajín when I'm eatin' a mango\nYeah, I get jealous\nIf you ate it real good, I can't help it\nAny bitch you fuckin' with, you need to dead it\n'Fore I come through and shit get hectic, ah\n\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shake that shit (Brr, brr, brr)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shake that shit (Brr, brr, brr)\nHmm, hmm, work it, bitch (Ah)",
 "image": "https://images.genius.com/91cd3f8529186c71879ba8bc0594581f.1000x1000x1.png"
}