{
 "title": "Mood Swings",
 "album": "Shoot for the Stars Aim for the Moon",
 "year": "2020-07-03",
 "lyrics": "[Intro: Pop Smoke & \nLil Tjay\n]\n(\nMood swings\n)\nOh, you ain't know I could sing? (\nOh, oh, oh\n)\nHahaha (\nYeah\n)\n[Chorus: Pop Smoke & \nLil Tjay\n]\nShorty a lil' baddie (\nShe a lil' baddie\n)\nShorty my lil' boo thing (\nBoo thing\n)\nAnd shorty got the fatty\nShorty be catching mood swings\nEvery time I fuck without a rubber\nI nutted on the covers\nAnd I kept it undercover\n'Cause I don't kiss and tell (\nKiss and tell\n)\n[Verse 1: Pop Smoke & \nLil Tjay\n]\nEvery time I fuck, she call me daddy\nMy lil' mama nasty\nI see the pussy through the panties (Whatever you want)\nShe taste like candy\nShe a queen, like Nefertiti\nUh oh, my lil' mama sittin' pretty\nAnd we be shoppin' through the city (\nOh, oh\n)\nI gave her keys to the Bentley (\nWoah, woah\n)\nGet off your knees, you don't gotta cry to me\nI'm your best friend, baby, you don't gotta lie\nI'll get you everything that you want and that you need from Chanel to Celine\nIt's on you to decide\nValentino, yeah, I put you in the best\nStart liftin' up your dress, start kissin' on your neck (\nOh no, no\n)\nStart rubbin' on your butt, start massagin' your breasts\nI ain't wanna give you a baby just yet, so I backed out and nutted on your breasts\nI put you in a Uber (\nUber\n) and sent you to your bed (\nOh\n)\nThe very next day (\nOh\n), you sent me a text (\nOh\n)\nYou pulled up to the crib and we did it again (\nOh, oh\n)\n[Chorus: Pop Smoke & \nLil Tjay\n]\nShorty a lil' baddie (\nShe a lil' baddie\n)\nShorty my lil' boo thing (\nBoo thing\n)\nAnd shorty got the fatty\nShorty be catching mood swings\nEvery time I fuck without a rubber\nI nutted on the covers\nAnd I kept it undercover\n'Cause I don't kiss and tell (\nOoh\n)\n[Verse 2: Lil Tjay & \nPop Smoke\n]\nYou know, I never found love until I looked into your eyes (\nUntil I looked into your eyes\n)\nFirst time blushin', I ain't even gon' lie (\nAin't even gon' lie\n)\nFour rounds in, leavin' bruises on your thighs\nYou the only bitch could make me spin off on the guys\nAnd the only bitch that make me wanna nut when I'm inside\nIt's your vibe, leave with me you gettin' high\nGirl, ain't bitches fuckin' wit' you even if they tried\nShe a tsunami, I ain't never felt it dry\nClose my eyes while I sleep, hope you be there when I wake\nHonestly, I feel the vibe we have is great\nAnd if there's something in your mind, you can tell me\nAnd if I told you what's on mine, would you help me?\nYou gon' see the bigger picture, it's just gon' take time\nJust because you mine, I'ma keep you lookin' like a dime\nAin't no imperfections, girl, you fine\nBaby, what's your sign?\nI hope you ain't against the slow grind\n(\nWork, work, it's me and you\n) Me and you\nKeep it silent, there ain't nothin' we can't do\nThrough the storm, baby, we can make it through\nWhy you actin' brand new? You know you my lil' boo, yeah\nGot up on my Birkin, it's workin'\nShe said she a virgin (\nIt's hurtin'\n)\nShe my biggest fan, she always lurkin'\nAnd she know I'm a man, I'ma put that work in\nI know she can't stand me, I'm fancy\nSo I'ma bring her out when I get my Grammy\nLate night sex, she can't find her panties\nCouldn't hold it in, now she need a plan B\n[Chorus: Pop Smoke & \nLil Tjay\n]\nShorty a lil' baddie\nShe my lil' boo thing\nAnd shorty got the fatty (\nShorty got the fatty\n)\nShorty be catching mood swings\nEvery time I fuck without a rubber\nI nutted on her covers\nAnd I kept it undercover\n'Cause I don't kiss and tell",
 "image": "https://images.genius.com/0324a12198af1188460bac355b472c68.1000x1000x1.png"
}