{
 "title": "Mr. Right Now",
 "album": "SAVAGE MODE II",
 "year": "2020-10-02",
 "lyrics": "(\nMetro\n)\n\nI'ma slide anytime you want\nPut you in Chanel, I'ma teach you how to stunt (21)\nSlip and slide like a waterfall\nYou need some TLC, we can creep if you want (21)\n\nAyy, turn your phone off, take your clothes off (21)\nI'm a savage, but I fuck her to a slow song (21)\nTurn the lights down (21), lay the pipe down (21)\nI ain't Mr. Right, but I'm Mr. Right Now (Straight up)\n\nShe want me to fuck her to Beyoncé (Straight up)\nBut I don't treat her like she my fiancé (On God)\nMake that thing sing like Sade (21)\n1942, it ain't no Chardonnay (21)\nIn a Lam' truck (Yeah), with my Richard on (Yeah)\nGot a pretty girl (21), that I'm feelin' on (21)\nWe in quarantine (On God), but my M's long (On God)\nBuddy lame-lame, he got friend-zoned (On God)\nGot a couple spots (21), and they all owned (21)\nBought a penthouse (21), 'cause I'm never home (On God)\nThrew my heart out the window, feelings gone (21)\nThrew my heart out the window, but\n\nI'ma slide anytime you want (21)\nPut you in Chanel, I'ma teach you how to stunt (On God)\nSlip and slide like a waterfall (Straight up)\nYou need some TLC, we can creep if you want (Straight up)\n\nAyy, turn your phone off (Straight up), take your clothes off (Straight up)\nI'm a savage, but I fuck her to a slow song (Straight up)\nTurn the lights down (Straight up), lay the pipe down (Straight up)\nI ain't Mr. Right, but I'm Mr. Right Now (21)\n\nTurn your phone off, take your clothes off\nI'm a sav', but I fuck her to a slow song\nSaid the nail lady went and did her toes wrong\nSaid her last man was always playin' Drake songs\nYeah, cellphones out when I roll up\nYeah, the nigga had a problem 'til I showed up\nEverybody with a \"at\" before they name tough\nYeah, more concerned with blowing up than growing up\nYeah, said she wanna fuck to some SZA, wait\n'Cause I used to date SZA back in '08\nIf you cool with it, baby, she can still play\nWhile I jump inside that box and have a field day\nI'm the slow stroke king, hit me anytime\nAnd my goal is to get you to the finish line\nI seen good movies end bad plenty times\nSo let me finish strong, girl\n[Pre-Chorus: 21 Savage & Drake, \n21 Savage\n, \nDrake\n]\nI'ma slide anytime you want\nPut you in Chanel, I'ma teach you how to stunt (\nOn God\n)\nSlip and slide like a waterfall\nYou need some TLC, we can creep if you want (\nIf you want\n)\n\nAyy, turn your phone off (Straight up), take your clothes off (Straight up)\nI'm a savage, but I fuck her to a slow song (Straight up)\nTurn the lights down (Straight up), lay the pipe down (Straight up)\nI ain't Mr. Right, but I'm Mr. Right Now (21)\n\nShe want me to fuck her to some Keith Sweat (21)\nBut she stay in apartments I got beef at (On God)\nPussy so good, I had to sneak back (On God)\nHit her with my Glizzy, boy, I keep that\nYou fuck with the ones that fuck with you, what?\nThe niggas—, the bi—, the dumb-ass bitches wanna come up and lay up and give you pussy at, what?\nTwelve? One o'clock at night? Face-ass nigga, do I look dumb, stupid or slow?\nNigga, please, what the fuck is you talkin' 'bout?\nJust like you wanna stick a dick up in me, I want some motherfuckin' money\nAnd don't get in your motherfuckin' feelings when you see me in the motherfuckin' club randomly\nAnd one of your niggas wanna get down on me\nAnd I wanna give them some pussy 'cause they gave me some money\nKnow what I mean? It's easy",
 "image": "https://images.genius.com/b37e9ec812dac4d8b6b8cbfb274dcf77.1000x1000x1.png"
}