{
 "title": "On Chill",
 "album": "Wow... That’s Crazy",
 "year": "2019-07-12",
 "lyrics": "We've been on a tragedy for months\nWhy can't you agree with me for once?\nMaybe we can be on chill tonight\nMaybe I can give you chills too\nWe've been on a tragedy for months\nWhy can't you agree with me for once? Yeah\nMaybe we can be on chill tonight (One time)\nMaybe I can give you chills too (Chill)\n\nI'm gettin' mine like fine wine measured in time\nMany other brothers loved you but this pleasure is mine\nIt's no pressure for us to say that I love you for now\nSo fuck that cuffin' shit, I just want us be comfortable now, for real\nWho you lovin'? Who you wanna pull up with?\nWho don't care who you dated long as you care and you trustin'?\nI'm tryna hear all your problems so I can lighten the load\nNo, you not fighting alone 'cause I'm protectin' you from 'em, so chill\nLife hard and ex-lovers is like scars\n'Cause it stop hurtin' but never forgettin' what it was\nI was a youngin, my biggest enemy was the club\nWith voicemails on third rings fucking me up\nSo I don't trust\n\nWe've been on a tragedy for months (So I don't trust)\nWhy can't you agree with me for once? (And I'm tryna slow up)\nMaybe we can be on chill tonight\nMaybe I can give you chills too\nWe've been on a tragedy for months\nWhy can't you agree with me for once? Yeah\nMaybe we can be on chill tonight\nMaybe I can give you chills too (Hey, shawty, look, okay)\n\nThey switch up on you, I'm gonna stay the same, yeah\nI pull up on you then put it in with patience\nI'm good, well we got it without no expectation\nWhat good is a title when shawty been that wave? Yeah\nLet me illustrate you, let my tongue repaint you\nIt's already waxed, have you had a brainstorm?\nEverywhere a nigga take you, just know that my face good\nModify your energy so your bank and your skin glow\nMaxfield, let it fly, I be up in there a lot\nJust to show I don't care, gon' wear it to that nigga house\nWe don't share our whereabouts or the gossip the hood love\nJust supreme confidence, if we good that's good enough, woah, yeah\n\nWe've been on a tragedy for months\nWhy can't you agree with me for once?\nMaybe we can be on chill tonight\nMaybe I can give you chills too\nWe've been on a tragedy for months\nWhy can't you agree with me for once? Yeah\nMaybe we can be on chill tonight\nMaybe I can give you chills too\n\nHow 'bout that? Oh\nI'm tired of makin' up and fallin' out\nWanna be the nigga you callin' up\nTo pick your body up when you down and out, let's chill\nHow 'bout that? Oh\nI'm tired of makin' up and fallin' out\nWanna be the nigga you callin' up\nTo pick your body up when you down and out, let's chill\n\nWe've been on a tragedy for months\nWhy can't you agree with me for once?\nMaybe we can be on chill tonight\nMaybe I can give you chills too\nWe've been on a tragedy for months\nWhy can't you agree with me for once? Yeah\nMaybe we can be on chill tonight\nMaybe I can give you chills too\n\nYou give me, oh\nJust be there, and then",
 "image": "https://images.genius.com/e2796cd021dadc6499b3db92abe8ab48.1000x1000x1.jpg"
}