{
 "title": "PICK UP",
 "album": "BLAME IT ON BABY",
 "year": "2020-04-17",
 "lyrics": "Let's go\nWait a minute, who are you? (\nAyy, yo, K.i.D\n)\n\nPick up, pick up, pick up\nBetter watch his lil' bitch 'cause I'm up off the liquor\nI been turnin' her down, she on go, tryna get up\nCrack a smile at your ho, she gon' fall out and shiver\nNigga going out sad 'bout the ho, he a Skittle (Sweet)\nTake the jet to New York like I'm Jigga (Yoom)\nWhen you poppin', you know that come with paparazzi\nI hate going outside, they all know I'm that nigga (Let's go)\n\nSlide on a nigga, they drive through like Wendy's (Slide)\nThey all pray for the time of the day, I been busy\nI turned her down, now that lil' nigga picky\nShe wasn't gettin' no money, I told her to miss me\nOh, y'all like takin' pictures? Think y'all niggas sissy\nMy lil' nigga been loyal, I threw him a fifty\nI pull up in an Escalade, hop out in Timberlands\nMy bitch, she got finger wave hair like she Missy (Bitch)\nKiss me, kiss me, kiss me\nI look better in person, lil' ho, I get jiggy\nSpend that lil' money, I ain't tryna save it\nWe ain't tripping on none of that, bitch, we got plenty (Bread)\nBread on your head, bitch, I'm Jiffy\nFuck around, drop a movie on niggas like 50\nIf Big Worm would've pulled up, I would've start hitting\nIf Deebo choked me out, bitch, I would've killed him, bitch\n[Chorus: DaBaby & \nQuavo\n]\nPick up, pick up, pick up\nBetter watch his lil' bitch 'cause I'm up off the liquor\nI been turnin' her down, she on go, tryna get up\nCrack a smile at your ho, she gon' fall out and shiver\nNigga going out sad 'bout the ho, he a Skittle (Sweet)\nTake the jet to New York like I'm Jigga (Yoom)\nWhen you poppin', you know that come with paparazzi \n(\nWait a minute, who are you? Ayy, yo, K.i.D\n)\nI hate going outside, they all know I'm that nigga (Let's go, \nQuavo\n)\n\nPick up, pick up, don't pick up the phone\nI'm trappin', lil' nigga, don't pick up (Brrt, brrt)\nWe been havin' drip and I'm puttin' that shit on\nAnd I'm lightnin', I'm icin', I'm flooding my wrist up (Ice)\nAdd it up, nigga, just put your lil' 'fit up (Add it)\nYes, sir (Yes, sir), put that lil' shit up (Woo)\nBad bitch, look like she do sit-ups (Bitch)\nI bought the Lamborghini just to get up (Go)\nKeep talkin' that talk and I popped him, laughin'\nSkrrt (Skrrt), yeah, I'm ducking the traffic (Woo)\nI'm doing this shit in spectacular fashion (Uh)\nStraight out the Nawf and that chopper get tactic (Woo)\nShoot up the floor (Rraow), I got him dancing, dancing\nShake that bitch out of your panties\nI am the Cho (Cho), what did I score? (Woo)\nHo, you already know I'm the G.O.A.T. (G.O.A.T.)\n\nPick up, pick up, pick up\nBetter watch his lil' bitch 'cause I'm up off the liquor\nI been turnin' her down, she on go, tryna get up\nCrack a smile at your ho, she gon' fall out and shiver\nNigga going out sad 'bout the ho, he a Skittle (Sweet)\nTake the jet to New York like I'm Jigga (Yoom)\nWhen you poppin', you know that come with paparazzi\nI hate going outside, they all know I'm that nigga (Let's go)",
 "image": "https://images.genius.com/fd3a2acc2a6cfc5a37dd3e57ffc07c7e.1000x1000x1.jpg"
}