{
 "title": "PRACTICE",
 "album": "BLAME IT ON BABY (DELUXE)",
 "year": "2020-08-04",
 "lyrics": "Okay\nBoom, boom, boom (Firzt on the track)\nBoom, boom, boom\n\nI be feelin' like I don't be poppin' enough, I be humble\nI'ma keep showin' my ass if I wanna\nHang up the phone on they ass, block the number\nI told you don't play with me, nigga\nAnd she be actin' funny, probably think a nigga need her (Uh-uh)\nI thought I was faithful, she say I'm a cheater\nThey thought I was taken, I'm ready to mingle\nThe fuck is you saying, lil' nigga? (Go)\n\nI do my lil' dancy-dance (Go)\nI fill up my pants with bands, quit playing, lil' nigga\nAnd I don't think the talk is cheap (Talk)\n'Cause now when they talk to me, they paying me, nigga (Shut up)\nI probably say the word \"nigga\" too much\nI'm a real nigga, I don't be giving a fuck (Shh)\nTommy Hilfiger 'fits with the shit coming up (Go)\nWhen you stay down like this, you rock Fendi and stuff (Okay)\nHe broke as hell, put a boot on him\nI hit the bitch, put her out, put a move on her (Bitch)\nHe wanna be just like Baby for real\nOn the low tryna do what I do, don't he? (Yeah)\nJust so you prepared, I'ma let you know\nThey probably told you I'm scared, but I'm ready, though (No)\nThe industry can't take the hood out of me\n'Bout to go get some head from a ghetto ho (Uh-uh)\nThey do it nasty\nPull up new whip and it's flashy\nGun on my hip and it's plastic\nThis the deluxe\nI like her, but don't give a fuck (Fuck)\nI'm fucking her rough, I'm her daddy (Mmm)\nThat's how I live\nShe told me she wanna have kids (Mmm)\nI told her don't know what that is (Uh-uh)\nThat ain't how we speakin' (Uh-huh)\nI broke her heart into pieces\nShe probably gon' call Dr. Phil\n\nI be feelin' like I don't be poppin' enough, I be humble (Pop it)\nI'ma keep showin' my ass if I wanna\nHang up the phone on they ass, block the number (Brrt, brrt, brrt)\nI told you don't play with me, nigga\nAnd she be actin' funny, probably think a nigga need her (Uh-uh)\nI thought I was faithful, she say I'm a cheater\nThey thought I was taken, I'm ready to mingle\nThe fuck is you saying, lil' nigga?\n\nI always had a thing for ghetto bitches, where the Trinas?\nI'm known to set it off like Queen Latifah\nYou wanna make Billboard? Come get a feature\nYou fucking with Baby, lil' nigga (Yeah)\nHot nigga, hot nigga (Hot)\nNumber one song on the Billboard, he still got a Glock with him (Hot)\nYou ain't gon' never see me hate on no nigga\nI think this work better, I'm tryna go shop with 'em\nYeah, what you need, lil' nigga?\nWe havin' the bags of gas and they movin' fast (Fast)\nThan you can imagine\nThat bitch on the way, my bro catch the pack like it's Madden (Go)\nHavin' my way with an actress (Come on)\nFuck on the floor, fuck a mattress\nThey probably saying I'm not on y'all asses\nI feel like AI, we talkin' 'bout practice\n\nI be feelin' like I don't be poppin' enough, I be humble\nI'ma keep showin' my ass if I wanna (We talkin' 'bout practice, man)\nHang up the phone on they ass, block the number\nI told you don't play with me, nigga (We talkin' 'bout practice)\nAnd she be actin' funny, probably think a nigga need her\nI thought I was faithful, she say I'm a cheater (We talkin' 'bout practice?)\nThey thought I was taken, I'm ready to mingle\nThe fuck is you saying, lil' nigga?",
 "image": "https://images.genius.com/df70be1690cbb7c0ef1c86a172c2a1b1.1000x1000x1.png"
}