{
 "title": "ROCKSTAR",
 "album": "BLAME IT ON BABY",
 "year": "2020-04-17",
 "lyrics": "Woo, woo\nI pull up like\nHow you pull up, Baby? How you pull up? (Oh, oh, oh)\nHow you pull up? I pull up (Woo, \nSethInTheKitchen\n)\n\nLet's go\nBrand new Lamborghini, fuck a cop car\nWith the pistol on my hip like I'm a cop (Yeah, yeah, yeah)\nHave you ever met a real nigga rockstar? (Yeah)\nThis ain't no guitar, bitch, this a Glock (Woo)\nMy Glock told me to promise you gon' squeeze me (Woo)\nYou better let me go the day you need me (Woo)\nSoon as you up me on that nigga, get to bustin' (Woo)\nAnd if I ain't enough, go get the chop\n\nIt's safe to say I earned it, ain't a nigga gave me nothin' (Yeah, yeah, yeah)\nI'm ready to hop out on a nigga, get to bustin'\nKnow you heard me say, \"You play, you lay,\" don't make me push the button\nFull of pain, dropped enough tears to fill up a fuckin' bucket\nGoin' for buckets, I bought a chopper\nI got a big drum, it hold a hundred, ain't goin' for nothin'\nI'm ready to air it out on all these niggas, I can see 'em runnin'\nJust talked to my mama, she hit me on FaceTime just to check up on me and my brother\nI'm really the baby, she know that her youngest son was always guaranteed to get the money (Okay, let's go)\nShe know that her baby boy was always guaranteed to get the loot\nShe know what I do, she know 'fore I run from a nigga, I'ma pull it out and shoot (Boom)\nPTSD, I'm always waking up in cold sweats like I got the flu\nMy daughter a G, she saw me kill a nigga in front of her before the age of two\nAnd I'll kill another nigga too\n'Fore I let another nigga do somethin' to you\nLong as you know that, don't let nobody tell you different\nDaddy love you (Yeah, yeah)\n[Chorus: DaBaby & \nRoddy Ricch\n]\nLet's go\nBrand new Lamborghini, fuck a cop car\nWith the pistol on my hip like I'm a cop (Yeah, yeah, yeah)\nHave you ever met a real nigga rockstar? (Yeah)\nThis ain't no guitar, bitch, this a Glock (Woo)\nMy Glock told me to promise you gon' squeeze me (Woo)\nYou better let me go the day you need me (Woo)\nSoon as you up me on that nigga, get to bustin' (Woo, \nyeah\n)\nAnd if I ain't enough, go get the chop (\nYeah, yeah\n)\n\nKeep a Glocky when I ride in the Suburban\n'Cause the codeine had a young nigga swervin'\nI got the mop, watch me wash 'em like detergent\nAnd I'm ballin', that's why it's diamonds on my jersey\nSlide on opps' side and flip the block back, yeah, yeah\nMy junior popped him and left him lopsided, yeah, yeah\nWe spin his block, got the rebound, Dennis Rodman\nFool me one time, you can't cross me again\nTwelve hundred horsepower, I get lost in the wind\nIf he talkin' on the yard, the pen' dogs'll take his chin\nMaybach SUV for my refugees\nBuy blocks in the hood, put money in the streets\nI was solo when the opps caught me at the gas station\nHad it on me, thirty thousand, thought it was my last day\nBut they ain't even want no smoke\nIf I had to choose it, murder what she wrote\n\nLet's go\nBrand new Lamborghini, fuck a cop car\nWith the pistol on my hip like I'm a cop (Yeah, yeah, yeah)\nHave you ever met a real nigga rockstar? (Yeah)\nThis ain't no guitar, bitch, this a Glock (Woo)\nMy Glock told me to promise you gon' squeeze me (Woo)\nYou better let me go the day you need me (Woo)\nSoon as you up me on that nigga, get to bustin' (Woo)\nAnd if I ain't enough, go get the chop",
 "image": "https://images.genius.com/fd3a2acc2a6cfc5a37dd3e57ffc07c7e.1000x1000x1.jpg"
}