{
 "title": "Runnin",
 "album": "SAVAGE MODE II",
 "year": "2020-10-02",
 "lyrics": "Am I really hard to please?\nPerhaps I have such special needs\nI wondered what was wrong with me (Haha)\nMy friends all fall so easily (Pussies)\n\nCalled the first one Savage Mode, my mood, that's what it was (21)\n2016, we was ridin' around, beatin' niggas up in the club\nI know she around for the money, but act like she loyal, I don't feel the love (21)\nI'm so rich, get bored, might wake up, buy me a car just 'cause (On God)\nHer titties is hard 'cause she spent a five, my bitch titties cost me a dub (21)\nAll my bitches got BBLs, all my bitches got butts (Straight up)\nI ain't with thе rap beef, Draco pedophile, all of my opps get touchеd (Straight up)\nWe ain't never ran off on no barber, but we still be hoppin' out cuts (Straight up)\n\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', I leave all my cars\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', all my opps be\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', wipe his nose, it was\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', Savage never did no\n\nThat Clasé for your wife (21), that hookah for your wife (Pussy)\nI'm Slaughter Gang, pussy, you know I brought my knife (21)\nHe was talkin' gangster (21), we caught him at a light (Pussy)\nI let my young nigga do it, it was free, he wanted a stripe (On God)\nHavin' my way with the cheese, I'm in the den with the thieves (On God)\nI know that she ratchet, I could tell by the way that she wearin' her weave (21)\nSmokin' on zaza, this shit came out the garden with Adam and Eve (21)\nChopper go fow-fow, shoot up your pow-wow, niggas tryna make y'all bleed (21)\nGot out of line, spanked that baby, we had to rock him to sleep (Pussy)\nIs it a issue? Keep me a pistol, I ain't finna diss you (Pussy)\nAll that pillow talk, I'ma have to send The Boogeyman to come get you\nChain hang low like a yo-yo, your bitch ridin' dick like pogo\n\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', I leave all my cars\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', all my opps be\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', wipe his nose, it was\nRunnin', runnin', runnin', runnin'\nRunnin', runnin', Savage never did no\n\nI brought a Hollywood bitch to Club Crucial (On God)\nI was at the Met Gala with my shooter (On God)\nSlaughter Gang, Gang, we don't do recruitin' (21)\nSay you ready to catch a body, gotta prove it\nGotta prove that shit, nigga\nShit ain't no motherfuckin' game, nigga\nGet your bitch ass whacked, nigga\nBig facts, big 4L, nigga\nBig Zone 6, nigga\nWe run the motherfuckin' city, nigga\nY'all niggas know what the fuck goin' on, nigga\nBody for body, nigga, money for money, nigga\nWe skunkin' everybody\nFuck your crew, nigga, we'll kill your crew\nPussy, pussy, pussy\n(If Young Metro don't trust you, I'm gon' shoot you)\nAre things better or worse the second time around?\nCan we really do anything more than once?",
 "image": "https://images.genius.com/b37e9ec812dac4d8b6b8cbfb274dcf77.1000x1000x1.png"
}