{
 "title": "Said Sum",
 "album": "Code Red",
 "year": "2020-06-30",
 "lyrics": "(Turn me up, YC)\n\nHuh? (What?)\nAh, I thought a broke nigga said somethin' (Ah)\nTalkin' shit, but they still ain't sayin' nothin' (Ain't sayin' nothin')\nWe gon' trap this bitch out 'til the feds come (Run it up, run it up)\nHuh? (What she say?)\nAh, I thought a pussy ho said somethin' (Ah)\nHow it goes, when I'm talkin, you listen (Just listen)\nCut her off 'cause she spoke on the business (Go)\n\nHundreds and fifties, can't swap a dime for a penny\nYou know that's a stupid decision (Yup)\nHeadfirst with it\nI shot a shot at my nigga bitch, really didn't think before I did it (No)\nMake it make sense (Please)\nLuckily, I was on point with the last ho, kept my receipts (Why?)\nWarranty good, made sure I got a full refund when I gave her back to the streets (Go)\nForever I rep, put the set on the chain\nI'm thuggin', you already know how I came (Know how)\nYeah, he got money, but niggas be lame\nI Lambo'd her life, told her, \"Get out that Range\"\nHer mani and pedi same color as my teeth (White)\nShe got a blue check and a check without me (Nice)\nHood nigga ridin' in a foreign on E (Still)\nSick of these niggas, COVID-19 (Ugh)\nKarate’d the wock, he tryna kick the cup  (Shake it)\nCame up like Giannis, I get bigger bucks (Made it)\nGot four different choppers, right there in this truck (Now)\nI'm just being honest, I could get you touched (Brr)\nPut you in the blender, I could get you slushed (Haha)\nI see the comments but really unbothered\nI know it's hurtin', she salty, I scarred her\nBeware what you lay up and say to these bitches, they can't hold water (Period)\n\nAh, I thought a broke nigga said somethin' (Ah)\nTalkin' shit, but they still ain't sayin' nothin' (Ain't sayin' nothin')\nWe gon' trap this bitch out 'til the feds come (Run it up, run it up)\nHuh? (What she say?)\nAh, I thought a pussy ho said somethin' (Ah)\nHow it goes, when I'm talkin, you listen (Just listen)\nCut her off 'cause she spoke on the business (Go)\n\nI thought a nigga who watch what I do\nBut he can't get his bitch back said somethin' (Tough)\nIs it true that he postin' another nigga money?\nProbably, I don't put that past him (Maybe so)\nI thought a ho that be speakin' on me\nBut be fuckin' a broke nigga said somethin' (Listen)\nHol' up, lil' bitch, get a nigga that's lit\nI'm the whole loaf, he the breadcrumbs (Go)\nRappers with their mixed feelings (What?)\nI ain't fuckin' with 'em (Nope)\nLike a Richard Mille, let me know what time it is\nBagg, where the Runtz at? (Huh?) Know you got it on you '\n'Posed to be smell-proof, bussin' out the vacuum seal\nThese niggas lil' boys, childish, Fisher Price\nConfident, I'm not cocky, so get it right\nShe bendin' over, but I want some head first\nI don't even wanna know what the pussy like\nTrippin' too close to fallin', so I'm ballin'\nIt's crazy, my opp got shot but I ain't call it (Sike, slow up)\nI come around, niggas gon' put they ho up\nThese bitches stay on my channel, yeah\nMust've seen me on TV, yeah\nIt took me six hours to count a mil' exactly, I'm accurate with the cheese, yeah (Big Bagg)\n\nHuh? (What?)\nAh, I thought a broke nigga said somethin' (Ah)\nTalkin' shit, but they still ain't sayin' nothin' (Ain't sayin' nothin')\nWe gon' trap this bitch out 'til the feds come (Run it up, run it up)\nHuh? (What she say?)\nAh, I thought a pussy ho said somethin' (Ah)\nHow it goes, when I'm talkin, you listen (Just listen)\nCut her off 'cause she spoke on the business (Go)",
 "image": "https://images.genius.com/5c1bcbbf7132d4cdefd3a1eebd4a1f6a.1000x1000x1.png"
}