{
 "title": "Savage",
 "album": "Suga",
 "year": "2020-03-06",
 "lyrics": "I'm that bitch (Yeah)\nBeen that bitch, still that bitch (Ah)\nWill forever be that bitch (Forever be that bitch)\nYeah (Ayy, ah)\n\nI'm the hood Mona Lisa, break a nigga into pieces\nHad to X some cheesy niggas out my circle like a pizza (Yeah)\nI'm way too exclusive, I don't shop on Insta' boutiques\nAll them lil' ass clothes only fit fake booties\nBad bitch, still talking cash shit\nPussy like water, I'm unbothered and relaxing\nI would never trip on a nigga if I had him\nBitch, that's my trash, you the maid, so you bagged him, ah\n\nI'm a savage (Yeah)\nClassy, bougie, ratchet (Yeah)\nSassy, moody, nasty (Hey, hey, yeah)\nActing stupid, what's happening? (Woah, woah)\nBitch, what's happening? (Woah, woah)\nBitch, I'm a savage, yeah\nClassy, bougie, ratchet, yeah\nSassy, moody, nasty, huh\nActing stupid, what's happening?\nBitch, what's happening? (Ayy, ah)\n\nEat me and record it, but your edge-up all I'm showing (Ah)\nI keep my niggas private, so his AP all I'm showing (Baow)\nBeefing with you bitches really getting kinda boring\nIf it ain't about the money, then you know I'm gon' ignore it\nI'm the shit, ooh (Ayy)\nI need a mop to clean the floor, it's too much drip, ooh (Too much drip, ooh)\nI keep a knot, I keep a watch, I keep a whip, ooh (I keep a whip, baow)\nLet's play a game, Simon says I'm still that bitch, ayy (Still that bitch)\nI'm still that bitch, yeah (Ah)\n\nI'm a savage\nClassy, bougie, ratchet (Yeah)\nSassy, moody, nasty (Yeah)\nActing stupid, what's happening? (What's up?)\nBitch, what's happening? (What's up?)\nBitch, I'm a savage, yeah\nClassy, bougie, ratchet, yeah (Bitch)\nSassy, moody, nasty, huh\nActing stupid, what's happening? (What's up?)\nBitch, what's happening?\n\nBitch, I'm lit like a match, ooh\nAnd any nigga I let hit is still attached, ooh\nThat body right, but you know this pussy fat, ooh\nI drop a picture, now these bitches feel attacked, ayy\nDon't let that nigga gas you up and get you whacked, ooh\nI make a call and get a pussy nigga smacked, uh\nThese bitches talkin' 'bout pulling up, well, where you at? Ooh\nI'm in a Lam', bitch, catch me if you can, ooh\nI'm kickin' bitches out they spot, Stalli' Chan, yeah (Ah, yeah)\n\nNiggas say I taste like sugar, but ain't shit sweet (Ah)\nMwah\nAyy, ayy, ooh, ooh, ooh, ooh, mwah",
 "image": "https://images.genius.com/bd757918fc4dac7583266b3b554434a0.1000x1000x1.jpg"
}