{
 "title": "Shots Fired",
 "album": "Good News",
 "year": "2020-11-20",
 "lyrics": "Brrt, brrt, baow (\nBuddah Bless this beat\n)\n\nImagine niggas lyin' 'bout shootin' a real bitch (Huh?)\nJust to save face for rapper niggas you chill with\nImagine me givin' a fuck it was your fuckin' birthday (Fuck you)\nYou in your feelings, I just thought it was another Thursday\nNow imagine me cockblockin' niggas on some dry shit (What?)\nI don't want you on the bench, believe you wouldn't've been invited (You wouldn't've been invited)\nAnd if it weren't for me, same week, you would have been indicted (Should've let them lock your ass up)\nYou offered M's not to talk, I guess that made my friend excited, hmm\nNow y'all in cahoots\n, huh (Okay), you a \npuss in boots\nYou shot a 5'10\" bitch with a .22\nTalkin' 'bout bones and tendons like them bullets wasn't pellets\nA pussy nigga with a pussy gun in his feelings\nOkay, he in the backseat and he keep callin' me a bitch (He a bitch)\nWe all know the shit I could've came back with (Lil'-ass nigga)\nHe talkin' 'bout his followers, dollars, and goofy shit\nI told him, \"You're not poppin', you just on the remix\" (What's poppin'?)\nNow here we are, 2020, eight months later\nAnd we still ain't got no fuckin' justice for Breonna Taylor (Breonna Taylor)\nAny nigga on that nigga's side is a clout chaser (Fuck y'all)\nA bitch who he fuckin' or a ho that he payin', uh\n\nImagine me, hahaha\nImagine me entertaining you fuckin' goofy-ass niggas and you fuckin' goofy-ass bitches\nBrrt, brrt, blaow (\nBuddah Bless this beat\n)\n\nWho you takin' shots at, goofy-ass nigga?\nKeep your broke ass out a rich bitch business\nAnd that go for you bitches too that's tryna get picked\nTalkin' shit, I'll slide on you, thinkin' that you slick\nOoh shit, it's a lotta weak niggas in this bitch\nThey confused\nThey hate me, but watch my videos beatin' they dick\nWho a snitch? I ain't never went to the police with no names\nI thought a bitch that got her chain snatched, caught a loss had something to say, ayy\nI be speakin' facts, uh, they can't handle that, uh\nThey want me to be the bad guy, let me put my mask on\nI was chose, I ain't ask to be this motherfuckin' cold\nStill the brightest star and not just the ones that's up in this Rolls\nKeep it pimpin' always, actions do the talkin'\nI know you want the clout, so I ain't sayin' y'all names\nOh, you out here ballin', huh? Who you get that money from?\nTen toes down for whoever get the Patek, huh?\nI be so content 'cause I know I'm a real bitch\nAnd anything I say, I'm never scared to repeat it\nYou'd think I was a killer how these niggas scared as shit\nI pull up one deep, but niggas bring they whole clique, ayy\nWho you takin' shots at, goofy-ass bitch?\nWatchin' me succeed from your knees, suckin' dick\nI know you want attention from the niggas that I get\nI'm a steak, you a side plate, shrimp, stay in your place\nReal bitch, yeah, yeah, I ain't sellin' fairytales\nFaceTime my nigga while my other nigga layin' there\nBitch think she sabotagin' somethin', tryna run and tell\nBitch, I got a bond with my niggas and they all aware, yeah\nWho you takin' shots at? Shut up with your scary ass\nNo profile pic, bitch, your mama shouldn't've had\nKick me while I'm down bad, I remember all that\nNext nigga send a shot, I'ma sent it right back (Ah)\n\nBrrt, brrt\nBrrt, haha\nAh\nShould've let them lock your ass up\nPussy",
 "image": "https://images.genius.com/d30190e9e0a78f306b4ee9a9c6dcb8ab.1000x1000x1.png"
}