{
 "title": "Slide",
 "album": "HER1*",
 "year": "2019-09-27",
 "lyrics": "You always wearin' them glasses\nYou don't wanna let no sucker look you in your eyes, huh?\nBetter show off them eyelashes\nYou love what you do with a passion\nOoh, that shit attractive\nI fuck with you, girl\n\nAll he wanna do is gas me\nHow we end up in the backseat?\nJust tryna get to the bag\nWe on the same page, you the same way\nOnly keep the fam around me\nSo let me know what it's gon' be\nI don't plan on gettin' no sleep, while we\n\nDoin' our thing, movin' too fast\nCandy paint with the windows all black\nSeats crème brûlée, what they gon' say?\nWith the top down screamin', \"Money ain't a thing\"\nAnd we up 'til six in the mornin'\nWhen the sun rise, we be on it\nOoh, I got five, you know it's all live\nTell me when to go, baby, when we gon' slide?\nBaby, when we gon' slide? Hey, hey\nUp all night, baby, when we gon' slide? Oh, yeah, yeah\nBaby when we gon' slide, slide, slide, slide?\nSlide, uh\n\nI don't care if we on the run\nNothin' matters when we one on one\nLookin' at us 'cause we goin' dumb\nWe on the same wave, you the same way\nYou know I be down if it's with you\nWhere we goin'? Baby, what's the move?\nWe should take a trip up to the moon\nGet a room\n[Chorus: H.E.R. & \nYG\n]\nDoin' our thing, movin' too fast\nCandy paint with the windows all black\nSeats crème brûlée, what they gon' say?\nWith the top down screamin', \"Money ain't a thing\"\nAnd we up 'til six in the mornin'\nWhen the sun rise, we be on it\nOoh, I got five, you know it's all live\nTell me when to go, baby, when we gon' slide?\nBaby, when we gon' slide? Hey, huh\nUp all night, baby, when we gon' slide? Yeah\nUp all night, baby, when we gon' slide? Oh\nUp all night, baby, when we gon' slide? (\n4Hunnid\n)\n\nI need a baecation\nI need my bitch in an apron\nBooty all out cookin' bacon\nOrange juice and Ace what we drinkin'\nI only come out when the stars out\nI'm on a mission, but we far out\nThis city talkin' with a large mouth\nYeah, they after the boy like Fall Out\n \n(4Hunnid)\nDrop it, give me fifty, girl, drop it, give me fifty\nYou should slide with me 'cause you be trippin' when you miss me\nYou gon' hold me close and on your neck gon' be a hickie\nI ain't gotta do too much, I know what get you sticky\nI ain't gotta know astrology, I know your vibe\nSkip the foreplay, you don't let niggas fuck with your mind\nI ain't givin' out apologies when I'm behind\nFuckin' up the seats of the brand new ride\n\nDoin' our thing, movin' too fast\nCandy paint with the windows all black\nSeats crème brûlée, what they gon' say?\nWith the top down screamin', \"Money ain't a thing\"\nAnd we up 'til six in the mornin'\nWhen the sun rise, we be on it\nOoh, I got five, you know it's all live\nTell me when to go, baby, when we gon' slide?\nBaby, when we gon' slide? Hey, huh\nUp all night, baby, when we gon' slide? Yeah\nUp all night, baby, when we gon' slide? Oh\nUp all night, baby, when we gon' slide? Uh\n\nFuckin' up the seats of the brand new ride",
 "image": "https://images.genius.com/a1df7845d51d3305c9e018168d385430.620x620x1.jpg"
}