{
 "title": "Something Special",
 "album": "Shoot for the Stars Aim for the Moon",
 "year": "2020-07-03",
 "lyrics": "I think you are (You are) something special\nI'll take you on a shopping spree (Oh, yeah)\n'Cause I'm so into you (Oh)\nI'm so into you (I love you, baby)\nI'm so into you (Oh, my)\nI'm so into you (To you), baby (Baby)\n\nWhat you like? What you wear?\nSay the name, say the price, put them diamonds on your ear\nShinin' like a chandelier\nWhat's your thoughts? What's your fears?\nYeah, I need that real love (Real love), talkin' Bobby and Whitney (Whitney)\nYou don't gotta worry 'bout nothin' as long as you with me (With me, look)\n'Cause shit could get sticky, that's why I keep a glizzy\nRide around through my city (Woo)\nFuck Cassandra, Kanesha, Kaneeka and Tisha, Lisa and Tricia (Fuck them hoes, uh)\nFuck them hoes 'cause I don't need them, all them bitches treeshas\nThey ain't in the field, they on the bleachers (Treeshas)\nOn your back, I start applying that lotion (Yeah, lotion)\nSo deep, I'ma go in, pullin' all on your sew-in (Sew-in)\nI'm Pop Smoke, but you know all my governments\nAll that gangster shit, she be lovin' it\nShe love how I'm thuggin' it (Oh, you like that)\nShawty brown and petite (Yeah)\nFly and discreet, a demon in the sheets\nMother was a lawyer, her father the police\nThey be working long hours, so she always had the free\nShe said I could come with her if it get hot up in the streets\n'Cause I'm a 'rilla in the jungle and a shark up in the sea\nShe like, \"Papi, you so fire, but get up out the streets\"\nI'm like, \"Baby, what you mean?\" (What you mean?)\nLook\n\nI think (Baby) you are\nYou are (You are) something special (My girl)\nI'll take you on a shopping spree\n'Cause I'm so into you (To you)\nI'm so into you (You are)\nI'm so into you\nI'm so into you, baby (Baby)\n\nBaby (Baby)\nYou are (You are) my girl (My girl)\nYou are (You are) my girl\n\n(I think) You are (You are)\nYou are (You are) something special (Oh, yeah)\nI'll take you on a shopping spree (Oh, baby)\n'Cause I'm so into you (Baby)\nI'm so into you (You are)\nI'm so into you (My girl)\nI'm so into you (You are), baby (My girl)",
 "image": "https://images.genius.com/0324a12198af1188460bac355b472c68.1000x1000x1.png"
}