{
 "title": "The Woo",
 "album": "Shoot for the Stars Aim for the Moon",
 "year": "2020-07-03",
 "lyrics": "She want a Woo nigga\n\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna ride with the Woo\nYeah, yeah, yeah, yeah\n\nI told her, \"Ooh-woo-woo\"\nShawty wanna fuck me inside of the coupe\nI can take you out everywhere, fuck a jet fare\nVersace hotel with Versace robe, woah, woah\nLike you when you let down your hair with no comb\nAnd I stay to myself 'cause I never liked these hoes (Yeah)\nAnd she only liked the guap, red light these hoes\nWhy would I waste my time on a shorty that don't got me on the front of her mind?\nEspecially when you get designer and I wine and dine\nAnd the Bentley came with the wings like a number nine, yeah\nCome through, just us two\nI like you 'cause you cut how I'm cut too\nCome through, just us two\nI like you 'cause you cut how I'm cut too\n[Chorus: Pop Smoke & \nRoddy Ricch\n]\nShe wanna fuck with the Woo (\nAyy, she wanna fuck with the Woo, Woo\n)\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna ride with the Woo\nYeah, yeah, yeah, yeah\n\nThat's my kind of bitch, she be sayin' some shit\nLike, \"When you gon' fly me in private, so I can land on that dick?\"\nShe said, \"Tricks is for kids\", she don't fall for the tricks\nShe can handle her own, she just want some dick\nGot that big Birkin bag worth five, six figures\nYou might be out your league, can you buy that, nigga? (Buy that)\nI pull up on her top gone on the Dawn, I'm the don\nYou can fuck around, if you want, if you want\nOut in Bali, big swing, big dress\nBig ass, make her squirt and make a big mess\nBefore we done, she ask \"Where we gon' do it next?\"\nNext, so wet it fucked up the seats in the jet\nShe like all that gangsta shit\nTop down, ridin' 'round with the blick\nWho you with? Woo\nShe like all that gangsta shit\nI said, \"She like all that gangsta shit\"\n\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna ride with the Woo (Hahaha)\n\nLet me take you to the candy shop (Candy shop)\nShow you all I got (All I got, all I got)\nI put diamonds on your chain (Chain, uh)\nTo match your diamond ring (Uh, uh, uh)\nI'm 092, nigga, Woo (Woo, back)\nHate it or love it (Uh, uh), it's me and you (Woo)\nLet's turn nothin' into something\nShe said she love Woo niggas (Woo, uh)\nThem niggas who gon' pull triggers (Grrt, oh)\nI was fine when I met you (Met you, pow)\nThen I sexed you (Woo)\nThen I left you (Uh)\n'Cause your pussy feel the same (Feel the same, feel the same)\nAnd I don't got time to waste (No time to waste)\n\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna fuck with the Woo\nShe wanna ride with the Woo\nYeah, yeah, yeah, yeah",
 "image": "https://images.genius.com/8a1f7823c54eceb8924a137571ab0b1c.600x600x1.jpg"
}