{
 "title": "Bad Boyz",
 "album": null,
 "year": null,
 "lyrics": "Shyne F/ Barrington Levy\nMiscellaneous\nBad Boyz\n\nNow tell me who want to fuck with us?\nAshes to ashes, dust to dust\nI bang - and let your fuckin brains hang, snitches\nFuck all them able bitches with riches\nWho carry 22's, up in they hosiery\nA black teller when my father bust and unloaded me\nThink he just finished sniffin a ki, and dippin the D's\nDon't hate me, hate Nicky Barnes for hittin my moms\nLetting the condom pop, nigga I was born in the drop\nCoke boil in the pot, shake the Feds\nAnd bust shots at them street cops\nFuck yo' point is? My point is double fours at your fuckin jaws\nPointed, hollow point shit\nFour-point-six, need I say more?\nOr do you get the point bitch? C'mon\nWhat type of nigga slang and bang in the streets? (Bad Boyz)\nWhat type of nigga stay in the Trump for weeks? (Bad Boyz)\nWhat type of nigga fly Bentley Coupes? (Bad Boyz)\nAim for the sky, cop the shit then shoot ..\n\nMinks draggin on the floor - bangin on your whore\nSuckin the croissant just examine it for flaws\nPour the Cristal on the way to trial, RICO law\nGot a nigga head hurtin squirtin til they pull the curtain\nLet the money drip dry, hundred dollar bills\nWipe the tears from my eyes, no love\nFuck y'all niggas, hope you die a slow death\nAs I coke-test and see the lawyers talk of protest\nCan't fuck with you weak rap niggas, witcha gay raps\nRunnin 'round talkin this and talkin that\nSee me in the streets, tried to give me dap\nAndrew Cunanan ass niggas\nMy two cannons blast niggas, ass niggas\nGot me fucked up in the game, get your shirt stained\nKeep your five mics nigga, give me the 'caine\nDo the shit to clean my money dummies, gleamed the wrist out\nCop the pist-al, nigga, talk shit now, uh\nWhat type of nigga slang and bang in the streets? (Bad Boyz)\nWhat type of nigga stay in the Trump for weeks? (Bad Boyz)\nWhat type of nigga fly Bentley Coupes? (Bad Boyz)\nAim for the sky, cop the shit then shoot ..\n\nBling bling, it's a Bad Boy thing\nBullets heat-seekin, streep sweepin, with an evil grin\nWatch you die, one love, one life, one Shyne\nY'all niggas ain't sayin nothin, like a mime\nEvery line, I live it, I write it with a pencil so niggas die\nOf lead poison if they bite it, hate it but recite it\nIt's a G thang, me and Puff in St. Bart's set it off\nBitches walkin topless with G-strings, menage'\nBust shots at your crew, another charge\nAs the gulf stream fly through the fog\nMake ya popular\nPockets filled with more high notes than the opera\nFranklins on top of the - Jacksons\nMy nigga Ty leave you tired\nBad Boy, repsect it or die, coward\nWhat type of nigga slang and bang in the streets? (Bad Boyz)\nWhat type of nigga stay in the Trump for weeks? (Bad Boyz)\nWhat type of nigga fly Bentley Coupes? (Bad Boyz)\nAim for the sky, cop the shit then shoot ..\nWhat type of nigga slang and bang in the streets? (Bad Boyz)\nWhat type of nigga stay in the Trump for weeks? (Bad Boyz)\nWhat type of nigga fly Bentley Coupes? (Bad Boyz)\nAim for the sky, cop the shit then shoot ..",
 "image": "https://assets.genius.com/images/default_cover_image.png?1620675870"
}