{
 "title": "Case of the Ex (Whatcha Gonna Do)",
 "album": "Fear of Flying",
 "year": "2000-04-25",
 "lyrics": "Yeah, Mýa\nRedZone, what, what?\nUh\n\nIt's after midnight and she's on your phone (Phone)\nSaying, \"Come over,\" 'cause she's all alone ('Lone)\nI could tell it was your ex by your tone (Tone)\nWhy is she callin' now after so long?\n\nNow what is it that she wants?\nTell me, what is it that she needs?\nDid she hear about the brand new Benz\nThat you just bought for me?\n'Cause y'all didn't have no kids\nDidn't share no mutual friends\nAnd you told me that she turned trick\nWhen y'all broke up in '96\n\nWhatcha gon' do when you can't say no?\nWhen the feelings start to show, boy, I really need to know and\nHow you gonna act? How you gonna handle that?\nWhatcha gon' do when she wants you back?\nWhatcha gon' do when you can't say no?\nWhen the feelings start to show, boy, I really need to know and\nHow you gonna act? How you gonna handle that?\nWhatcha gon' do when she wants you back?\n\nThere's no need to reminisce 'bout the past (Past)\nObviously, 'cause that shit did not last (Last)\nI know how a woman will try to game you (You)\nSo don't get caught up because, baby, you'll lose\n\nNow what is it that she wants? (What is it that she wants?)\nTell me what is it that she needs? (She needs)\nDid she hear about the brand new Benz\nThat you just bought for me? (Bought for me)\n'Cause y'all didn't have no kids (Didn't have no kids)\nDidn't share no mutual friends (No, no, no, no)\nAnd you told me that she turned trick\nWhen y'all broke up in '96\n\nWhatcha gon' do when you can't say no?\nWhen the feelings start to show\nBoy, I really need to know and (I really need to know, baby)\nHow you gonna act? How you gonna handle that?\nWhatcha gon' do when she wants you back?\nWhatcha gon' do when you can't say no? (Oh, no)\nWhen the feelings start to show\nBoy, I really need to know and (Oh)\nHow you gonna act? How you gonna handle that?\nWhatcha gon' do when she wants you back?\n\nWhatcha gon' do when you can't say no? (Whatcha gonna do?)\nWhen the feelings start to show\nBoy, I really need to know and (Ooh)\nHow you gonna act?\nHow you gonna handle that? (How you gonna handle that?)\nWhatcha gon' do when she wants you back? (Oh, yeah, yeah)\nWhatcha gon' do when you can't say no? (Whatcha gonna do?)\nWhen the feelings start to show, boy, I really need to know and\nHow you gonna act? (Oh, how you gonna handle it, babe?)\nHow you gonna handle that?\nWhatcha gon' do when she wants you back?\n\nTell me, why she on the phone in the middle of the night? (Middle of the night)\nTell me, why she in your life tryna get what's mine? (All mine)\nShe don't know me, she's about to know me\nI'm in your life (Uh-uh), that's how it's gon' be (That's how it's gonna be, yeah)\nI seen her photo, she ain't even all that (All that, all that)\nSo if you want her back, you can take her back\n'Cause game recognize game, I could do the same thing\nGet it right, change or take back this ring\n\nWhatcha gon' do when you can't say no?\nWhen the feelings start to show\nBoy, I really need to know and (Oh)\nHow you gonna act? How you gonna handle that? (Yeah)\nWhatcha gon' do when she wants you back? (Yeah, oh)\nWhatcha gon' do when you can't say no?\nWhen the feelings start to show (I need to know)\nBoy, I really need to know and\nHow you gonna act? How you gonna handle that?\nWhatcha gon' do when she wants you back? (Wants you back)\n\nWhatcha gon' do when you can't say no? (No)\nWhen the feelings start to show\nBoy, I really need to know and (Ooh)\nHow you gonna act? How you gonna handle that? (Oh)\nWhatcha gon' do when she wants you back? (Oh)\nWhatcha gon' do when you can't say no? (Oh)\nWhen the feelings start to show\nBoy, I really need to know and (Oh)\nHow you gonna act? How you gonna handle that? (Oh)\nWhatcha gon' do when she wants you back? (Wants you back)\n\nYeah\nPlay wit' it right now\nUh, Mýa\nYeah, Mýa\nRedZone, what, what?",
 "image": "https://images.genius.com/4f5a7047e3f4f72a5b2b34e76db530b6.280x280x1.jpg"
}