{
 "title": "Just Be a Man About It",
 "album": "The Heat",
 "year": "2000-11-21",
 "lyrics": "Hey, hey hold up a minute\nLet me stop up here and use this payphone real quick\nHey, hey Toni, it's me, I was just calling, you know\nJust calling to let you know, don't wait up for me tonight\nI mean I just got a lot of things on my mind\nI gotta think about, you know\nJust umm, I'll be over Brian's house\nYou know, just for the night\nI mean, I know things are different, but you know\nIt's not you, it's me, you know, it's really me, you know\nAnd basically, I just think I'ma need some space\n\nWhy you calling me on the phone?\nWhy you not at home on time?\nYou say you're staying over your friends\nCause you've got a lot on your mind\nNow you're swearing up and down that it ain't me\nSo you say that things have changed\nSo tell me what exactly does it mean\nWhen you say you need your space?\nJust don't make no excuses, no no\n\nWhy you gotta lie to me?\nJust be a man about it\nBaby, you don't gotta lie to me, no\nJust be a man about it\nIf you wanna leave (I can tell you wanna leave), go on now\nJust be a man about it\nCome and grab your things (So come and get your things and leave)\nAnd go on right now, woo\nJust be a man about it\nYeah, yeah, yeah\n\nI mean, you gotta understand I love you\nYou know what I'm saying\nAnd I love you enough to say that I think\nI think you deserve somebody better than me, you know\nAnd right now, I can't give you what you need, you know\nI mean, I wanna love you and I'm gonna love you\nOne day but you know...\nI mean, you just gotta understand where I'm coming from\n\nYou say right now that you're not what I'm looking for\nAnd what you really need is time to grow\nYou're promising that one day you may come around\nAnd I'm supposed to let that go\nBut where the hell do you get off?\nTelling me your mama said I'm not what you need\nTell you what, since she knows it all\nThen that's where you need to be\nJust don't make no excuses, no no\n\nWhy you gotta lie to me?, no no, yeah\nJust be a man about it\nBaby, you ain't gotta lie to me, no no no, no (baby, you ain't gotta lie to me)\nJust be a man about it\nIf you wanna leave (I can tell you wanna leave), go right now\nJust be a man about it\nCome and get your things (so come and get your things and leave)\nAnd go, baby\nJust be a man about it, ooh yeah, oh\n\nCan you tell me how\nYou can say you're in love\nAnd then treat me so bad?\nBoy, you know it just ain't right\nI cannot believe\nThe way you handled things\nYou want to lie\nIf you were a man...\n\nWhy you gotta lie to me?\nJust be a man about it (Just be a man about it baby)\nYou don't gotta lie to me\nJust be a man about it\nYou ain't gotta lie to me, no no baby (I can tell you wanna leave)\nJust be a man about it\nIf you wanna go grab your things and leave now\nSo come and get your things and leave\n(Don't wanna stay, don't wanna be no more lying)\nJust be a man about it\n(If you wanna go on and leave)\nWhy you gotta lie to me?\nJust be a man about it\n(You ain't gotta be here so leave, no)\nYou don't gotta lie to me\nJust be a man about it\n(Baby, just be a man, woo)\nI can tell you wanna leave\nJust be a man about it\nSo come and get your things and leave\nJust be a man about it",
 "image": "https://images.genius.com/77983e62d1eaf337856fcf2d37fd4eb4.1000x1000x1.jpg"
}