{
 "title": "Let’s Get Married",
 "album": "J.E. Heartbreak",
 "year": null,
 "lyrics": "See, first of all\nI know these so-called players wouldn't tell you this\nBut I'ma be real and say what's on my heart\nLet's take this chance and make this love feel relevant\nDidn't you know I loved you from the start? Yeah\nWhen you think about all the years we put in this relationship\nWho knew we'd make it this far?\nThen I think about where would I be if we were to just fall apart\nAnd I can't stand the thought of losing you\n\nMeet me at the altar in your white dress\nWe ain't gettin' no younger, we might as well do it (We ain't gettin' no younger, girl)\nBeen feelin' you all the while, girl, I must confess (Feelin' you all the while)\nGirl, let's just get married, I just wanna get married\nMeet me at the altar in your white dress (Yeah)\nWe ain't gettin' no younger, so we might as well do it (Yeah)\nBeen feelin' you all the while, girl, and I must confess\nLet's get married (Baby, let's get married)\n\nSaid I done it all, but frankly, girl, I'm tired of this emptiness\nI wanna come home to you and only you\n'Cause makin' love to just anyone ain't happenin'\nI just gotta be with you\nDo you think about us finishin' somethin' we started so long ago?\nI wanna give you my all\nDo you think about maybe us havin' some babies?\nCome on, won't you be my lady, forever, girl?\n\nI'm ready to commit to you\nAnd I just can't wait for that night\n'Cause I need you here with me\nAnd let's start a family, oh-woah\n\nMeet me at the altar in your white dress\nWe ain't gettin' no younger, we might as well do it (We might as well do it)\nBeen feelin' you all the while, girl, I must confess\nGirl, let's just get married, I just wanna get married (I just wanna get married, oh)\nMeet me at the altar in your white dress (Oh-oh)\nWe ain't gettin' no younger, we might as well do it (We ain't gettin' no younger, hey)\nBeen feelin' you all the while, girl, and I must confess (Marry, marry, marry, marry)\nLet's get married (All I want you to do, haha, is meet me at the altar)\nMeet me at the altar in your white dress (Yeah, yeah)\nWe ain't gettin' no younger, we might as well do it (Baby, we ain't gettin' no younger)\nBeen feelin' you all the while, girl, I must confess (Feelin' you, feelin' you, feelin' you all the while, all the while)\nGirl, let's just get married, I just wanna get married (Yeah)\nMeet me at the altar in your white dress (Yeah, yeah, yeah)\nWe ain't gettin' no younger, we might as well do it (We might as well do it, baby)\nBeen feelin' you all the while, girl, and I must confess (Girl, I must confess)\nLet's get married (Let's get married, baby, said let's get married, baby)\nMeet me at the altar in your white dress (Baby, baby, baby, baby, woah, ooh)\nWe ain't gettin' no younger, we might as well do it\nBeen feelin' you all the while, girl, I must confess (Hey, let's get married, baby)\nGirl, let's just get married, I just wanna get married (Woah-oh)\nMeet me at the altar in your white dress (Ooh)\nWe ain't gettin' no younger, we might as well do it (Do it, do it)\nBeen feelin' you all the while, girl, and I must confess\nLet's get married",
 "image": "https://images.genius.com/59e71b86760d3b4792dd63dbeb7cd1b2.586x599x1.jpg"
}