{
 "title": "Mr. Too Damn Good",
 "album": "G.",
 "year": "2000-03-07",
 "lyrics": "Ooh\nYeah, yeah yeah yeah yeah\nOh oh, yeah, mhm\n\nGuess you never know a good thing\nWhen it's right in your face\nYou've been abused for so long\nLove gets tainted and all seems the same, mhm\nI guess it's unbelievable\nSomeone could love you like this\nWell, time ain't no object and money ain't a thing\nWhen you have someone to ease your pain\n\nWanna be the smile on your face\nBe your stars and your moon\nI wanna be your sunny day\nCan I be your favorite tune?\nI wanna be your breakfast in bed, yeah\nAnd baby, I'll be your fool\nMr. Too Damn Good To You\nYes sir, mhm\n\nYes sir, hmm\nYou've been hurt so many times\nYou don't know when love's for real\nSo you don't open up (Open up)\nOr give in to love (Give in to love)\nOr express how you feel (Uh-uh, no)\nBut just like Sunday Morning\nI'll take it easy\nGirl, I'm gonna wait\n'Cause lovin' just ain't right (Just ain't right)\nWithout you by my side (By my side)\nBaby, you're my soul mate\n\nBaby, I'll open doors\nBe there for you any time\n'Cause that's what your man's supposed to do\nBaby, I wanna cook for you\nI will spoil you\nGirl, my whole objective is to please you\nI'll run your bubble bath\nMake you laugh\nGirl, through thick and thin, I've got your back, yeah\nI ain't gon be pressin' you or stressin' you to make love\nWe've got so much time for that, oh\n\nI wanna be the smile on your face\n(Smile on your face)\nBe your stars and your moon\n(Be your stars and moon, baby)\nCan I be your sunny day?\n(Every day, all day) I'll be your favorite tune\n(Your favorite tune, yeah)\nI wanna be your breakfast in bed\n(Every morning that you wake up I want you to see me, baby)\nAnd baby I'll be your fool\n('Cause I'll be your fool)\nMr. Too Damn Good To\n(Yes, I will, baby, baby, baby, yeah)\n\nI wanna be your shoulder when you need one to cry on (Mhm, yeah)\nI wanna be your pillow when you need one to lie on (Oh yeah)\nI wanna be the spotlight that shines on ya (Mhm)\nGirl, I'm gonna write \"the girl is mine\" on ya (Yes, I am)\nI wanna be your thought in your daydreams (Mhm)\nI wanna be your everything, your everything\n(Mr. Too Damn Good To You)\nI wanna be everything you ever thought you wanted\n(Mr. Too Damn Good To You)\nEver needed, baby, yeah\nGirl, I wanna shout about it\nYou wanna tell the world about it\n(Mr. Too Damn Good To You)\nAnd can't nobody else believe it\nYou'll have everything you've needed, yeah, yeah\n(Mr. Too Damn Good To You)\nI'm gonna be so so so good to you, baby, yeah\n(Mr. Too Damn Good To You)\nI'm gonna do things that you never thought I would do\n(Mr. Too Damn Good To You)",
 "image": "https://images.genius.com/49c25770a93e302db8935586890d82b5.491x491x1.jpg"
}