{
 "title": "Once Upon A Time",
 "album": "Get It On... Tonite",
 "year": "1999-11-09",
 "lyrics": "Well here is my story that I tell to you\nYou may not believe me but I swear it's true\nI escaped to Havana for a getaway\nIn a tiny club with a cuban band on a Saturday\nAnd that's when I saw her from across the room\nLike something from a movie or a storybook\nShe had a short dress with curly hair and chocolate skin\nThat's how it all began\n1 - I remember when she came into my life\nAnd all at once-upon-a-time\nLove was in the air\nJust like an ocean breeze\nAnd we were dancing to the sweetest melodies\nI held her in my arms until she danced into the night\nIt happened all at once-upon-a-time\nOnce upon a time\n{Girl} Hifuela mijo tell me what happened next\nThe next day I was walking to the marketplace\nI passed by the cathedral so I stopped to pray\nI imagined this journey without my friend\nAnd just like an angel she appeared again\nBut before I could ask her why she had gone\nThe Padre started yelling that \"She's the one\"\nAnd suddenly the Policia were everywhere with chaos in the air\nI remember when she had to say goodbye\nAnd all at once-upon-a-time\nI could not believe they said she was a thief\nAnd I stood there as they drove her away from me\nAnd what was I to do, now they've accused her of a crime\nIt happened all at once-upon-a-time\nI remember when I couldn't sleep that night\nAnd all at once-upon-a-time\nI had to find a way to bring her back to me\nSo I made a plan of how to set her free\nAnd so tomorrow night, mi amore I will find\nIt happened all at once-upon-a-time\nOnce upon a time\n{Girl} So tell me, how did you get outta there?\n{Girls} He disguised himself in sheets\n{MJ} I waited for the guards to fall asleep\n{Girls} Snuck into the tower, took the keys\n{MJ} And then I told the girl, stick close to me\n{Girls} He was in a sword fight 'till the death\n{MJ} Everyone that watched just held their breath\n{Girls} And then he ran\n{MJ} I ran\n{Girls} Jumped\n{MJ} I jumped\n{Girls} Climbed\n{MJ} Faster and faster and faster\n{Policia} Guards, stop him! Don't let him get away, Guards!\nI remember when she came back in my life\nAnd all at once-upon-a-time\nWe made our getaway to another time and place\nWe were riding while the tears rolled down her face\nShe knows I can not stay so we'll say our goodbyes tonight\nIt happened all at once-upon-a-time\nI remember when he came into my life\nLove was in the air like an ocean breeze\nSweetest melodies\nUntil she danced into the night\nIt happened all at once-upon-a-time\nOnce upon a time",
 "image": "https://images.genius.com/dca84b175021cdabdc39107ef706ee10.470x463x1.jpg"
}