{
 "title": "Say My Name",
 "album": "The Writing’s on the Wall",
 "year": "1999-07-27",
 "lyrics": "Darkchild '99\n\nSay my name, say my name if no one is around you\nSay, “Baby, I love you,” if you ain't runnin' game\nSay my name, say my name, you actin' kinda shady\nAin't callin' me \"baby,\" why the sudden change?\nSay my name, say my name if no one is around you\nSay, “Baby, I love you,” if you ain't runnin' game\nSay my name, say my name, you actin' kinda shady\nAin't callin' me \"baby,\" better say my name\n\nAny other day, I would call, you would say (Say)\n\"Baby, how's your day?\" But today, it ain't the same\nEvery other word is, \"Uh-huh (Uh-huh), yeah, okay\" (Okay)\nCould it be that you are at the crib with another lady? (Another lady)\nIf you took it there, first of all, let me say (Say)\nI am not the one to sit around and be played\nSo prove yourself to me, if I'm the girl that you claim (Claim)\nWhy don't you say the things that you said to me yesterday? (Yesterday)\n[Pre-Chorus: \nDestiny’s Child\n, Beyoncé]\nI know you say that I am assuming things\nSomething's goin' down, that's the way it seems\nShouldn't be no reason why you're actin' strange\nIf nobody's holding you back from me\n'Cause I know how you usually do\nWhere you're sayin' everything to me times two\nWhy can't you just tell the truth?\nIf somebody's there then tell me who\n\nSay my name, say my name (Say my name) if no one is around you\nSay, “Baby, I love you,” if you ain't runnin' game\nSay my name, say my name, you actin' kinda shady\nAin't callin' me \"baby,\" why the sudden change? (Yeah, hey, yeah)\nSay my name, say my name if no one is around you (Yeah, yeah, yeah)\nSay, “Baby, I love you,” if you ain't runnin' game (No, no)\nSay my name, say my name, you actin' kinda shady\nAin't callin' me \"baby,\" better say my name\n\nWhat is up with this? Tell the truth, who you with? (With)\nHow would you like it if I came over with my clique?\nDon't try to change it now, sayin' you gotta bounce (Bounce)\nWhen two seconds ago, said you just got in the house (The house)\nIt's hard to believe that you are at home by yourself (By yourself)\nWhen I just heard the voice, heard the voice of someone else\nJust this question, why do you feel (Feel) you gotta lie? (L-Lie)\nGettin' caught up in your game, when you cannot say my name (Say my, say my name)\n[Pre-Chorus: \nDestiny’s Child\n, Beyoncé]\nI know you say that I am assuming things\nSomething's goin' down, that's the way it seems\nShouldn't be no reason why you're actin' strange\nIf nobody's holding you back from me\n'Cause I know how you usually do\nWhere you're sayin' everything to me times two\nWhy can't you just tell the truth?\nIf somebody's there then tell me who\n\nSay my name, say my name if no one is around you\nSay, “Baby, I love you,” if you ain't runnin' game\nSay my name, say my name, you actin' kinda shady (Baby)\nAin't callin' me \"baby,\" why the sudden change?\nSay my name, say my name if no one is around you (If ain't nothin' changed, oh)\nSay, “Baby, I love you,” if you ain't runnin' game (Baby, say my name)\nSay my name, say my name, you actin' kinda shady (Ooh, whoa)\nAin't callin' me \"baby,\" better say my name (Hey, yeah)\n[Bridge: Beyoncé, \nRodney \"Darkchild\" Jerkins\n]\nWhere my ladies at?\nYeah, yeah, yeah, yeah, yeah (\nCan you say that? C'mon\n)\nYeah, yeah, yeah, yeah (Yeah, yeah, yeah)\nYeah, yeah, yeah, yeah (Yeah, yeah, yeah) (\nAll the girls say\n)\nYeah, yeah, yeah, yeah (Yeah, yeah, yeah) (\nI can't\n)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah (Yeah, yeah, yeah)\nYeah, yeah, yeah, yeah (Yeah, yeah, yeah)\nYeah, yeah, yeah, yeah (Yeah, yeah, yeah)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah (\nBreak it down\n)\nOh-ooh, whoa-whoa\n(\nUh, uh-uh, D-C, take it to the bridge, c'mon\n)\n[Pre-Chorus: \nDestiny’s Child\n, Beyoncé]\nI know you say that I am assuming things\nSomething's goin' down, that's the way it seems\nShouldn't be no reason why you're actin' strange\nIf nobody's holding you back from me\n'Cause I know how you usually do\nWhere you're sayin' everything to me times two\nWhy can't you just tell the truth?\nIf somebody's there then tell me who\n\nSay my name, say my name if no one is around you\nSay, “Baby, I love you,” if you ain't runnin' game (Call me your boo)\nSay my name, say my name, you actin' kinda shady (And tell me what you'd like to me, whoa)\nAin't callin' me \"baby,\" why the sudden change?\nSay my name, say my name if no one is around you\nSay, “Baby, I love you,” if you ain't runnin' game\nSay my name, say my name, you actin' kinda shady (Shady)\nAin't callin' me \"baby,\" (Baby) better say my name\n\nSay my name, say my name if no one is around you\nSay, “Baby, I love you,” (Say, \"Baby, I love you\")\nIf you ain't runnin' game\nSay my name, say my name (Say my name)\nYou actin' kinda shady (Say my name)\nAin't callin' me \"baby\"\nWhy the sudden change? (Yeah, yeah, yeah, yeah)\nSay my name, say my name (Yeah, yeah, yeah, yeah)\nIf no one is around you (Yeah, yeah, yeah, yeah)\nSay, “Baby, I love you” (Yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nIf you ain't runnin' game (Yeah, yeah, yeah, yeah)\nSay my name, say my name (Yeah, yeah, yeah, yeah)\nYou actin' kinda shady (Yeah, yeah, yeah, yeah)\nAin't callin' me \"baby\" (Yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nBetter say my name\n\nThou shalt know she can't love you",
 "image": "https://images.genius.com/be977942da67b106f76965c574b5f133.300x300x1.jpg"
}