{
 "title": "Shut Up",
 "album": "Book of Thugs: Chapter A.K., Verse 47",
 "year": "1999-11-22",
 "lyrics": "We gon' let the band deal with this\nM-I-A style, old school\nOkay, shut up\n\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\n\nRiding round in my brand new '99, fo'-do', Volvo\nI got a pocket full of Bs, cocoa weed\nAnd ain't got no place to go, though\nBut all my Boca Boys, they know dough, that's fosho doe\n(Are those Bugle Boy jeans you're wearing?)\nHell nah, ho, you know they Polo\nI been used again, accused again\nThis time, been wrong to chop something done by one of my union friends\nSoon as they seen the Benz, hating season was in\nHell, cause they figured me for not understanding they reason being\nHeh, but I'm the man for this\nWhile y'all was doing fine, I was doing time, just praying for this\nLocked up, making plans for this\nWithout all that fancy shit, way too advanced for this\nJust Polo socks, tank tops, and drawers up under my pants and shit\nShut up\n\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\n\nOkay, who's the baddest bitch?\nI been real, been rich, been had this shit\nBig Benz, big house and shit\nThat's right, okay, I been down with Trick\nOkay, it make sense to me\nCause if your money ain't right, you speaking French to me\nMiss Trina, don't play with me\nOr you can say Miss Bigg, that's okay with me\nYou need a grand just to speak to me\nOkay, are you sure you wanna sleep with me?\nOkay, you better be fosho\nCause I done left niggas like you stuck befo'\nOkay, you can ball with me\nSince you got a hot knot, spend it all with me\nOkay, y'all know what's up\nOkay, uh huh, I ride, shut up\n\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\n\nThis goes out to my niggeroles\nAnd them pretty ass jazzy hoes, bitch, what's up\nC-O got a verse in the book of thugs\nSo when I come through, bitch, show me love\nIf you 'bout that flow, then raise it up\nYou got that funk, then blaze it up\nI got two mos of them phat hoes\nLate night and I'm ready to bust\nAre you okay? Look like you got a lot to say\nOkay, come widdit\nNiggas, keep hiding your hoes, what you do that fo'\nMe and Money Mark been done hit it\nBeen done split it, okay, playboy? Fuck you say, boy?\nDon't even much bring your ho 'round C\nNiggas, y'all better quit fucking with me\nShut up\n\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\n\nLay down, playboy, what's up\nWhat about the slugs in your head and your gut\nWhat's up with the keys to the truck\nYour own nigga say you got Bs in the cut\nWhat's up with the safe, what the combo\nOpen that shit, nigga, fuck all the convo-sation\nWhat's up witcha Haitian\nProbably got birds at the safehouse, waiting\nWhat's up, where you store the D?\nI ain't found shit but a quarter ki\nNigga, you better not be playing me\nYou gon' bleed to death, you understand me?\nWassup, are you ready to go?\nYou ready to tongue kiss with the blue fo'-fo'?\nWhat's up, fuck nigga, say something\nSet your crime, we ready to spray something\nGun play, how I got the stripes\n2-4-K turned out the lights\nGun play, how I got the stripes\n2-4-K turned out the lights\n\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up\nAh hah, okay, wassup? Shut up",
 "image": "https://images.genius.com/8172d0f6713e8dfc92cd5ba60269a93d.600x600x1.jpg"
}