{
 "title": "13 and Good",
 "album": "Sex and Violence",
 "year": "1992-02-25",
 "lyrics": "I walked in the place, very big space\nEvery kind of race, dancin' and niggas made chase\nA very pretty face, so I walk in the place\nThrow the bass\nBasses kick, fly girl jumps on my tip\nThe drink that I sip implies this it it\nShe looked to be about twenty-six, I ain't dizzy\nIt's time to get busy\nWelcome, female is in my arms\nYes, overwhelmed by my playboy charms\nWe jumped in the ride, rushed to the crib\nI ain't gotta explain what we did\nBuilt to last, I simply waxed that\nAsk the question, no need for guessin'\nHey baby, how old are you?\nTwenty-six, twenty-one, maybe twenty-two?\nI'm twenty five, she shucked and kinda neighed\nAnd said, \"Hee hee hee I'm only thirteen\"\nThirteen!? I need a quick escape\nThat's statutory rape, but she was (Good!)\n\nGOOD\n(You should been there she was)\nGOOD\n(Man that jail term won't be)\nGOOD\n(But she looked)\nGOOD\n(Man her brothers will beat you )\nGOOD\n(Even if I get beat down it was still)\nGOOD\n\nIt gets better, This girl is kinda clever\nShe said, \"I wanna be with you forever\"\nI said, \"Forget it, I need to get my life in order\nYou could almost be my daughter\"\nShe started sighin' and her sighin' turns into cryin'\nHer cryin' turns into her replyin'\n\"Where's the phone?. I think it's time that I went home\"\nShe called her pops and said, \"Come get me, I'm all alone\nI'm sorry daddy, I slept with an older man\"\nHe said, \"Don't worry. The .45 is in my hand\nI'll be there before you count to four\"\nOne, two, three, four, he's at my door\nShe said, \"See what you did? You caused me all this grief\nYou're goin' to jail my daddy's a police chief\nIf I can't have you no one will and I ain't even on the pill\"\nBut you was\n\n\nDaddy comes through the door\nNow I'm thinking I got at least one shot at his jaw\nWhen he entered, the whole mood kinda changed\nHe grabbed his daughter and almost beat the girl insane\nShe's cryin' down the hall and now goin' home\nHe closed the door and, \"I'm happy we're all alone\nJump on the bed and look me straight into my eyes\nI think your kinda cute,\n don't make me use my .45\"\nDaddy's lookin' for a lubricant\nHe pulled out a little piece of gum and started chewin' it\n\"For years I've been lookin' for a big strong man\nI've got an apartment out in Brooklyn\nOnly my daughter and I are there\nYou can see my daughter anytime, anywhere\nBut it's you that I want to be mine\nThe price tag is your behind, don't worry it'll be\n\n\nThe morale of this story?\nThere is no moral you finish the story for me\nWhen you're livin' your life everyday in the hood\nWakin' up in the mornin' should feel",
 "image": "https://images.genius.com/2b0d6db94cc7f39239b5615aefb2f882.1000x1000x1.jpg"
}