{
 "title": "Best Kept Secret",
 "album": "Stunts, Blunts & Hip-Hop",
 "year": "1992-08-18",
 "lyrics": "You see, I skip to my lou like Napoleon at Waterloo\nMy name is Diamond D, tell you what I'm gonna do\nI dip and I dab like a Mike Tyson jab\nEven though there's flab, I possess the gift of gab\nI shoot it like a jammy and girls give the panties and\nEven with a fanny and I might win a Grammy and\nMaybe I won't, so I'll chill like the Pope\nSee, I'll never mope 'cause I know my shit is dope\nLike Colombian fish scale, ask my man Ishmael\n(Diamond D got props like a cop)\nOr better yet DT 'cause brothers can't see me\nEven your girl says you got a small wee wee\nNow you wanna go upside her head\nDo you feel intimidated by the things she said?\nDon't be mad 'cause I paid her back\n(You know I) took her to the rest and I laid her back\n(I go) on and on like popcorn with the butter\nA-a-a-a-yo! I used to stutter\nBut I fall on track and some may say I'm wack and\nFat, but in fact, I'm not any of that, black\nSee, I'm the best kept secret (Yeah)\nSo shut the fuck up and peep it\n\n\"Diamond D\"... \"Raised in Forest\"\n\"Rapper tries to diss, I crush the motherfucker\"\n\nSee, I write my own rhymes, produce my own shit\nYeah boy, I ain't the one to fuck with (Nope)\nI'll take a beat and I'll flip it\nWith so much flavor, niggas wanna sip it\nBut that's cool 'cause they know I got skills\nLet me demonstrate if you will, ahem\nRock is my man and so is Dapper Dan and\nI'll shake your hand and don't try to flam\nOr front like a stunt who lost her cunt\nI only hit grand slams, never will I bunt\nBases are loaded, bottom of the ninth\nI step to the plate 'cause I know my shit is great\nI can't walk down the street\n(A-yo Diamond, can you make me a beat?)\nYou gotta have cheese, about a couple of G's\nBut if I know ya, I might just throw ya\nA little somethin' on the side, troop\nA funky bassline and a hype loop\nI got a thousand old records in my crib\nI used to hustle but I never did a bid\nSome people call me Jo Jo, I keep a low pro\nNon-stop props, so act like you know, bro\nPass me a mic and I'mma keep it\nYeah boy, I'm the best kept secret\n\n\nYo, I'm deadlier than Michael Myers\nMy style will embrace you like a pair of pliers\nBut don't sweat it, G, why don't you let it be?\n'Cause Diamond D is a pedigree\nIn other words, I'm official\nI'll never go out like a wet piece of tissue\nRuff and rugged, stronger than Bounty\nNew York is the city, Bronx is the county\nLearned from the best so the rest just fess\nNow I'm gettin' booked at the Fillmore West\nLocated in the Village, so kill it, 'skillet\nYou ask yourself, will it ever cease?\n'Cause Diamond's sharp as a crease\nI only use bees wax, I'll never use grease on my dreads\nBut instead, if you want some kicks\nStep to the mic, I'm an 8 to 1 pick\nYou reap what you sow and I can reap it\nYo, I'm the best kept secret",
 "image": "https://images.genius.com/9156c910c1dee0fa11ea33400e334de5.600x600x1.jpg"
}