{
 "title": "Fakin’ The Funk",
 "album": "Breaking Atoms",
 "year": null,
 "lyrics": "Now, I've never been one to knock the next man for gettin' his\nYou know what I'm sayin'? (Right, right)\nAnd I do realize that Hip Hop is now a form of showbiz (Uh huh)\nBut this has always been somethin' with which you have to be true\nSo, in the year on 1992... (Now, this is how we do!)\n[Verse 1: Large Professor & \nNeek The Exotic\n]\nAt the age of 19, heard the scene\nA lot of MC's that do not come clean\nFrontin' on dealin' hard times in rhymes\nYou see 'em in the streets and you see no signs\nOf the hell, and they get on stage and tell\nSome old cornball war story, ring the bell! (Word!)\nYou're fakin' the funk\nTalkin' that extra hard junk, you're probably a punk\nAnd I'mma let you know\nThat this way, you just don't cut with the artificial flow\nNeek the Exotic breaks backs and necks\nWhen fakes try to front, they get smoked like blunts\nMy rhymes penetrate like skunk\nAiyo, word up, I think you're fakin' the funk\nYou're fakin' the funk! (You're fakin' the funk!)\n\nYo! You're fakin' the funk! (You're fakin' the funk!)\n[Verse 2: Large Professor & \nNeek The Exotic\n]\nYou do a song about a current event\nGet on television and seem hesitant to represent\nAnd that's what we call (Fraud!)\nYou can't kick the streets with a \"Look, I sold out\" award (Word!)\nAnd everywhere has streets\nThat's not tryin' to hear the same wack rhymes\nOver the same stink beats\n'Cause times are real and I can't feel\nPuttin'... down on the reel to reel\nNow, I'mma let you know\nWith those weak style of raps, it's time to go\nI eject rejects that step\nI'm a vet' ready to snap your neck\nI shine and rise at the same time\nThe mastermind of the sport called the rhyme\nNow, it's my time to dump chumps that front\n(Aiyo, Professor, what's up?)\nYou're fakin' the funk! (You're fakin' the funk!)\n\nYo! You're fakin' the funk! (You're fakin' the funk!)\n[Verse 3: Large Professor & \nNeek The Exotic\n]\nThe era of the wack MC is gettin' shut down\nWhen the Main Source stomps through your town\n'Cause we don't play the role of a clown\nAnd keep things jumpin' with the real rap sound\nSo, to all the people stealin' beats (You're fakin' the funk)\nTo the crossover rapper with the pleats (You're fakin' the funk)\nTo all the chumps that's claimin' the streets (You're fakin' the funk)\nFrontin' incredible feats (You're fakin' the funk)\nTo the girl actin' like a prostitute (You're fakin' the funk)\nWearin' that hooker type suit (You're fakin' the funk)\nTo the rapper with the big space suit (You're fakin' the funk)\nTo the artist that doesn't pay dues (You're fakin' the funk)\n'Cause, Exotic and then you're torn with the hyper tone\nI can't be blown because my rhymes are hard like stone\nSo, prepare for the scare 'cause I'm you're worst nightmare, punk\n'Cause you're, 'cause you're...",
 "image": "https://images.genius.com/eb50fc32e188a0880f0eb8e159c5e98d.600x592x1.jpg"
}