{
 "title": "Ghetto Red Hot",
 "album": "Don Dada ",
 "year": null,
 "lyrics": "Now special dedication to all dogs of dogs\nDedicated to all top dog celebrity crew\nMan call Tony Kelly and the man called Robert\nAnd Wild Apache riding through\nCurfew !\n\nSome tan so back and some a dem a rally back\nWe a rudebwoy yute and we nuh take back no chat\nSome tan so back and some of dem a rally back\nBut we a rudebwoy yute and we nuh take back no chat\nYou full a big chat and can't defend that\nIf a jailhouse you come from, we sending you go back\nYou full a big chat and can't defend that\nIf a Bellevue you come from we sending you go back\nCause\n\nWeh dem deh ya when di ghetto run hot?\nWhen we lookin' di food fi di pot?\nMan have M-16 over him back\n45 and we have it ram packed\nCarry bazooka, nah lef di glock\nWhen we moving we move compact\nA man will take a couple store couple bank and shop\nAnd police man a talk bout we hot\nJah Jah know, we haffi run lef di spot\nDon die-hearted dogheart, say dat uh\nWhen we come, dancehall haffi block\n\nMi say some a rally back and some of dem tan so back\nWe a rudebwoy yute and we nuh lef di glock\nSome a rally back, and some of dem tan so back\nTony Kelly inna di place and di place haffi block\nCause\n\nWeh dem deh when Kingston run hot?\nWhen we looking di food for we pot?\nKingston we deh when Massop get shot\nKingston we deh when Copper get shot\nKingston we deh when Bird get shot\nMan a, Kingston we deh when Cow get shot\nSandokan when him lick down flat\nNatty Morgan lick down flat\nJungle man, Spangler, Rema man did hot\nAnd the Uptown man dem did hot\nAnd the Riverton man dem run hot\nFirehouse, Mall Road did hot\nAnd the Payne land man dem hot\nAnd  back bush man dem did hot\nWareika Hill man, dem running hot\nNannyville man, dem did hot\n\nMi say some a rally back a some a dem tan so back\nDem a rudebwoy yout', we a buss off di glock\nSome a rally back a some a dem tan so back\nMi say some a dem are fryers and some a dem are not\n\nFull a pose and nuff big chat\nWhen you buck dem can't defend that\nRunnin' off dem mout' non stop\n'Bout dem have up di 16 and glock\nAnd mi shot him, a \"cat in box\"\nAn' di bwoy start run non stop\nMr Cat 'pon di mic now chat\nAnd police come in a Jeep back\nAnd dem comin' from Harman barracks\nAnd dem comin' an' comin' non stop\nAnd di rude bwoy dem firin' shot\nBussin' di shot dem, buss it non stop\nMek me tell yuh dem, deh pon di attack\nMr Cat round di mic and a chat\n\nMi say some a rally back, and some of dem tan so back\nWe a rudebwoy yout' an' we nuh lef' a glock\nSome a rally back, and some of dem tan so back\nWe a rudebwoy yout' an' we nuh tek no back chat\n\nWhere dem deh when Kingston run hot?\nWhen we looking di food for di pot?\nAnd guardin' poor people head-top?\nWhen the politics friction drop?\nWhen the bomb a drop pon house top?\nAn' every mornin' a dead man on spot\nAn' the yout' dem go school through shot\nMek me tell yuh, dem bend down flat\nAnd school book man dem deh 'pon dem back\nMr Cat, him deh ya, and a chat uh\nWhen mi chat, dancehall haffi block\n\nMi say some a rally back, and some of dem tan so back\nWe a rudebwoy yout' an' we bussin' off di glock\nSome a rally back, and some of dem tan so back\nWe a rudebwoy yout', we nuh tek no back chat\nFull a back chat and can't defend that\nBut if a jailhouse yuh come from we sendin' yuh go back\nFull a back chat and can't defend that\nAn' if a Bellevue yuh come from we sendin' yuh go back\n\nWeh dem deh when Kingston run hot\nWhen we lickin' di six packs an' clock\nWareika Hill man dem, nuh tek back chat\nJungle man dem, nuh tek back chat\nGarden man dem, nuh tek back chat\nRema man dem, nuh tek back chat\nSpanglers man dem, nuh tek back chat\nMall Road man dem nuh tek back chat",
 "image": "https://images.genius.com/45d7b331f6ad3e715880b325e46e16b8.1000x1000x1.jpg"
}