{
 "title": "Hazy Shade Of Criminal",
 "album": "Greatest Misses",
 "year": "1992-10-13",
 "lyrics": "\"But he like so many other White leaders appears to have missed the point\"\n\"Once the riot started, it went like a forest fire. It started in a lot of different places at pretty much the same time\"\n\nFive hundred FBI agents comin' after us with a license to kill\nThirty mil, claimin' it's just a drug bust\n\nThey thinkin' they making a fly switch\nReplace the devil for a witch, dirty *****\n\nReach uppity reach gotta reach\nPower to the people and the beats\n(Oh yes)\n\nSome people accuse some people of crimes\nSome people get away with losin' my rhyme (Uh!)\nThey don't like where I'm comin' from, so they play dumb\nDumb-diggety-dumb-diggety-dumb\nBut I'm tellin' you what they do,  everybody plays a fool\nWhile the real thief cools in a pool (Yeah!)\nHe who got the finger on the war button\nTalkin' loud and sayin' nothin'\nTV got 'em bigger than life\n(Oh yes) All he needs is a knife\nWho the criminal?\n\nBlind, deaf and dumb, hard to see 'em comin', but they come, here they come\nDon't be dumb-diggety-dumb\nPolitickin' write bad checks, still they gettin' wrecked\nGoing for a ***** neck (Uh!)\nRolling in a blue and white gang\nReady to bang-biggety-bang\nHanging 'round the hangin' rope\n(Nope, nope, nope!) N-O-P-E\nI ain't bendin' for the soap (Yeah!)\nNever understood why the 'hood half a who's in the joint\nNow they got me losin' my point\nGotta have it goin' on\nBorn criminal, born\n\nTake a piece of America back, but who had it first?\nHear the Indian curse (Uh!)\nRobbed and stole so many so much, it ain't funny\nNow who got 'em face on money?\nPolitician passin' a bill, paid in full\nC-note rockin' in a pocket, how they livin'\nMaking sure they lockin' us up, I got a feelin' I'm (In a minute)\nWhen it come to somethin' we say\nWhat they don't like is a brother like me on the mic in fact\nTo the gritty, ain't none of us wack\nNoriega had back (Yeah!)\nJeffrey Dahmer enters the room without cuffs\nHow the hell do we set stuffed\nIn the back of a cell on a isle, ain't it wild?\nWhat's criminal?\n\nPower to the people and the beats\n\nOnly if I had one more\nTime to kick the rhythm that keep rippin' down the door\nSo the real criminals get exposed behind the clothes\nDoors and the suits that make and break the law\nLookin' for my own 'cause I had enough bull\nI can't understand it, must been the crooked way they planned it\nPolice 'posed to keep the peace\nBut I can't trust 'em, so I keep my piece\nLoaded and cocked 'cause I don't miss the block\nTalk about the ones who don't get chained to the rock\nThose who got away with the dirt and the grime\nWhile we go away for the neighborhood crime\nNever liked what I saw in the law\nIndiana trees hanging us instead of leaves (Yeah!)\nWe hanging from the roof (Yeah!)\nBy real criminals\n\nThey thinkin' they making a fly switch\nReplace the devil for a witch, dirty *****\n\nReach uppity reach gotta reach\nPower to the people and the beats\nReach uppity reach gotta reach\nPower to the people and the beats\nReach uppity reach gotta reach\nPower to the people and the beats\nReach uppity reach gotta reach\nPower to the people and the beats\n\nPower to the people and the beats\nPower to the people and the beats",
 "image": "https://images.rapgenius.com/69b99b102786679487af43fad64f7985.600x594x1.jpg"
}