{
 "title": "I Got a Thang 4 Ya!",
 "album": "Where Dey At?",
 "year": null,
 "lyrics": "I got a thang for you, baby\nI got a thang for you, baby\n\nDark and lovely, no one above thee\nOoh, girl you really got it goin' on\nI wanna spank ya, I wanna thank ya\nYou're the reason why I sing this song\nAre roses red, are violets blue\nWho cares as long as I'm with you\nSo girl, let's just run away, oh\nWhere only the two of us can play, girl\nLet's run away\nYou're sweet as honey and just as sunny\nAs a nice and warm afternoon\nYour smiling face, your love and grace\nCould light up any room\nNow I won't flinch but I need a pinch\nTo make sure I'm not dreaming\nCause loving like this doesn't come ev'ry day\nAnd I've got a couple of words that I'd like to say\n\nSo here is something that you should know\nI'm in L-O-V-E\n(Girl I'm so in love with you)\nI got a thang for ya baby\n\nMs. Good Stuff, oh you're so tuff\nYou put some things on my mind\nNow don't desert me but, Girl, just hurt me\nWith all the love you could find, oh, Baby Girl\nMy lemon drop, my lollipop\nGirl, candy must be yo name\nCause yo sweetness is my weakness\nAnd I'm damn sure nothing can beat this\nGirl, I bet cha that since I met ya\nThe sun just shines everyday\nNo dreariness or loneliness\nHas darkened my pathway\nI never wonder cause my heart grows fonder\nBaby when we're apart\nCupid must have hit the spot\nShooting an arrow straight to my heart\n\nSo here is something that you should know\nI'm in L-O-V-E\n(I got so much love for you baby)\nI got a thang for ya baby\n\nSome folks are just old fashioned, well\nAnd I know that other folks just want some action\n(That's all they want)\nCan you tell me who is looking for the passion in their heart\nCause you and I keep love alive\nAnd Baby, you know we should never ever let it die\n\nGirl I got a thang for you\nSho'nuff got a thang for you\n\nSo here is something that you should know\nI'm in L-O-V-E\nI got a thang for ya baby\n\nAnd there's nothing that they can do about it\nI got a thang for you",
 "image": "https://images.genius.com/686eb87cc88d5955e0a4f472bd1fc46f.580x580x1.jpg"
}