{
 "title": "Jump Around",
 "album": "House of Pain",
 "year": "1992-05-05",
 "lyrics": "Pack it up, pack it in, let me begin\nI came to win, battle me, that's a sin\nI won't ever slack up, punk, you better back up\nTry and play the role and yo, the whole crew'll act up\nGet up, stand up (C'mon!) c'mon, throw your hands up\nIf you've got the feeling, jump up, touch the ceiling\nMuggs lets the funk flow, someone's talking junk\nYo, I bust him in the eye, and then I'll take the punk's ho\nFeelin', funkin', amps in the trunk and I got more rhymes\nThan there's cops at a Dunkin' Donuts shop\nSho' nuff, I got props\nFrom the kids on the Hill plus my mom and my pops\nI came to get down, I came to get down\nSo get out your seat and jump around!\n\nJump around! (Jump around!)\nJump around! (Jump around!)\nJump around! (Jump around!)\nJump up, jump up and get down!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump!\n\nI'll serve your ass like John McEnroe\nIf your girl steps up, I'm smacking the ho\nWord to your moms, I came to drop bombs\nI got more rhymes than the Bible's got Psalms\nAnd just like the Prodigal Son I've returned\nAnyone stepping to me, you'll get burned\n'Cause I got lyrics, but you ain't got none\nIf you come to battle, bring your shotgun (Shotgun)\nBut if you do you're a fool, 'cause I duel to the death\nTrying to step to me, you'll take your last breath\nI got the skills, come get your fill\n'Cause when I shoot the gift, I shoot to kill\nI came to get down, I came to get down\nSo get out your seat and jump around!\n\nJump around! (Jump around!)\nJump around! (Jump around!)\nJump around! (Jump around!)\nJump up, jump up and get down!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump!\n\nI'm the cream of the crop, I rise to the top\nI never eat a pig 'cause a pig is a cop\nOr better yet a Terminator, like Arnold Schwarzenegger\nTry to play me out like as if my name was Sega\nBut I ain't going out like no punk bitch\nGet used to one style and yo and I might switch\nIt up, up and around, then buck, buck you down\nPut out your head\n \nand then you wake up in the Dawn of the Dead\nI'm coming to get ya, I'm coming to get ya\nSpitting out lyrics, homie, I'll wet ya\nI came to get down, I came to get down\nSo get out your seat and jump around!\n\nJump around! (Jump around!)\nJump around! (Jump around!)\nJump around! (Jump around!)\nJump up, jump up and get down!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump! Jump! Jump! Jump! (Everybody jump)\nJump! Jump! Jump! Jump!\nJump!\n[\nOutro\n]\nYo, this is dedicated to Joe \"The Biter\" Nicolo\nGrab the Bozack, punk",
 "image": "https://images.genius.com/ebbdde24383d6f8eb5c61b19b314e1b3.600x600x1.jpg"
}