{
 "title": "Just the Two of Us",
 "album": "The One",
 "year": null,
 "lyrics": "Yoooooo!\nChubb Rock comin back hard for nineteen nine-TY!\nWord up, word up\nKick this out to my man Rob Swinga, Hot Dog Dinky\nManager (?) Ev Lover y'knahmsayin? Dr. No, here we go..\n\nIt's the Hitman, yes the Hitman, yo ya know it\nThe thirst quencher, the man on the sequencer\nHe was scared to kick a sixteen bar, he's not a rap star\nNot saying that I am, but I'm the jam\nI'm going to kick a little not a Dr. Suess riddle\nNo cats in hats\n, \nfox in some socks\nBut to the DJ jocks check your clocks\nHalf past what? Time to bust nut\nNot a pistachio; he uses a Casio keyboard\nAnd a Tascam board\nTo kick in the P-50, get nifty\nBorn with the gift, time to get riffed\nNot with the manufacturing of a spliff\nHe never rolled one; never sold none\nThe beats give me the high that brought fame to us\nAnd, how we gonna kick it, How?\n(Just the two of us!)\n\nChubb has been dope since he came out the shaft of his pops' wood\nYes I'm (*good!*)\nYo he shouted and he plopped into the uterus\nAnd they knew this about me; was gonna be a dope MC\nWhen I get on the mic my windpipe strikes and ignites\nA lyric when you hear it you fear it and like\nChubb is not a man to get souped like Campbell\nI'm the man with the plan and my jam sells\nLike a whore, in the store, hardcore and more\nOn the tour makin money you never saw\nI don't like dreaming, never ever beam and\nNever involved with girls like like scheming\nOr skiing or toboggan sledding, cause I'm shredding\nAny thoughts of a wedding, so Helen, Keller\nListen to the rules and\nMe and Hitman Howie Tee is all about coolin\nShe went buckwild, screamed, yelled, hollered\nI told her I loved her and then she did a solid\nDid it real good like a nice girl should\nBack polish waxed up the hood\nYo Hitman Howie Tee you should have seen her on me\nShe got all Vanessa Del Rio on me\nBut after she slept cause I had nothin left\nOn the Martin Butler tip, yes half step\nBut yo cousin Howie Tee and me\nOur love is all about making a dope LP\nThat will crush and sell and bum rush\nDon't hush, how we gonna do it How?\n(Just the two of us!)",
 "image": "https://images.genius.com/3f23f417b7e643db9c2df17275a1af69.803x800x1.jpg"
}