{
 "title": "Just Kickin’ It",
 "album": "MC Breed & DFC",
 "year": "1991-08-13",
 "lyrics": "1-2, 1-2\nYeah\nMy name is MC Breed\nI'm down with DJ Flash Technology, right?\nAnd what we're doin here together as a team, the true-doers\nIs what we call\nKickin it\nAh-ha, I said\nWe kickin it\n\nDa-bigga-da-bigga-da-bigga-da-bigga-da-bigga\nDa-bigga-da-bigga-da-Back in '86 when I started this\nI said, the people told me: \"Breed, you're not an artist\"\nBut now it's 1990, I'm servin em well\nWith the rhymes, rhythms, style and clientele\nConcert after concert, one after the other\nA man with the plan, plus a hustler undercover\nA president, a guy of his own\nSaid, I knew I was proper, and I knew I was strong\nBut all it takes is concentration, rhyme calculation\nEnough crew members to carry a nation\nTo be exact, yo Jack, I rehearsed\nThe cat wants your tongue, but I be catchin it first\nAnd I'm kickin it\n(Ah yeah)\n\nSaid, it's real necessary, not lack of control\nTo be at the tip-top with nothin but bankroll\nTo develop an actual skill, son\nYou gotta be born a natural real one\nNot high up on a pedestal, just a born idol\nTo me it's just a typical man-made title\nTo remain an architect and stand, in fact\nYou're startin to sweat, to eject is your best bet\nCertified legal, not against the law\nI'm not irrelevant, but terribly raw\nI got on-the-job knowledge and puttin it on paper\nNo bun for those who b.s. the baker\nThat's right, the mack Eric Breed is all that\nIt's pretty simple, not to mention a fact\nCausin major upsets for you so-called vets\nWho was there in the beginning, now you're sittin in check\nI'm kickin it\n(Ah yeah)\nYeah, I'm kickin it\nNow this beat is so dope\nYo Flash, get busy one time\nUknowmsayin?\n\nNigga-da-nigga-da-nigga-da-ni...\nNot once do I think I need to change my mind\nTechnology's here with me to co-sign\nYeah, for the occasion, Breed's invasion of death force\nSit back, relax, Techno cuts of course\nYo, the B-r-double e-d, and it's me\n]From the city of F-l-i-n-t with Technology\nServin on the wheels of steel and we're real\nAnd if you squeel you're killed, pimp, that's the deal\nBig Breed, I'm servin at the top of my mind\nBut his wax is just like 'jax, so then grind\nIt's like MC Kickin-It, one time like this and that\nStep back, Jack, goin black for black\nYeah, not wearin a Kangol, but maybe a cable\nThick shades, now you know, no lookin like Kool Moe\nYo, the rhyme that I'll be kickin will collect\nD-d-d-all respect, so why should I fess?\nAnd I'm kickin it\nDa-bigga-da yeah\nHuh, and I'm kickin it\n(Ah yeah)",
 "image": "https://images.genius.com/a94d2496d2865cf786d1eb7f264cba83.910x910x1.jpg"
}