{
 "title": "Latifah’s Had It Up 2 Here",
 "album": "Nature of a Sista",
 "year": "1991-09-03",
 "lyrics": "The Queen is hyped up\nThe Queen is hyped up\nThe Queen is hyped up\nThe Queen is hyped up\nAy yo Manda\nWhat's up La?\nYo, people have been trying to get fierce on me\nI think it's time I tell them about themselves\nYo, just give it to them \nSafari Style\nWell, well, well\nIt's the L A the T I the F A H, you'll see why\nQ U double E N. Is the reason I must be myself\nWhat else? Well fame hasn't got me\nSouped up selling out, sloppy or poppy\nThere so much to live for, therefore\nHere's more from a woman\nAll women keep the rumors to yourself\nThe over blown home grown not known\nFools who never shown proof let alone own\nA lot of props or a hip hip pop chart\nNotch on your clock is my spot\nNow who got the Mott’s?\nWhy you little played out\nAa-choo!\nI'm allergic to wack crews\nThe La, the ti, the fah\nThe queen is up\nThrowing salt that you never seen before\nHow dare those who talk we can't have them\nSome make me wanna go out with the bat and a magnum\nBut a wise, civilized and growing higher\nJudgments from the Queen punishment is the fire\nI'm here to make these fools out of liars\nYou must learn step and respect the sire, face the fire\nLatifah had it up to here the frauds felling fear, fear\nThe sound is playing like a \nQ-tip\n digging your ear ear\nMama Zula stands for positivity, knowledge and grace\nI never run my piece Damn! I'll take it to your face\nOpen why you hoping none stutter stop 'em\nMaybe choke (choke)\nBecause it's very hard to breathe while La got you in a yolk\nI'll cut your throat, I'll cut it short\nNo one ever getting near\nLatifah's had it up to here\n\nGive it to 'em Queen, yeah, yeah, yeah\nGive it to 'em Queen (I got it)\nGive it to 'em Queen, yeah, yeah, yeah\nGive it to 'em Queen (I got it)\nGive it to 'em Queen, yeah, yeah, yeah\nGive it to 'em Queen (I got it)\nGive it to em Queen, yeah, yeah, yeah\nThe Queen L A T I F A H in command\nSome of these commercial entertainers\nAre commercially a pain to my mind and my behind\nTry to dis \nDana\n, bumping me off\nBecause the Queen has reached a certain plateau\nAll I do is boo and say \"Is that so?\"\nTalk is cheap and if talk got any cheaper\nThey'd be selling Nike tongues instead of sneakers\nKay sa rah sa rah, blase bla, etcetera\nThis is a scene from the Queen La, La\nLovely and lyrically loose, but lady like\nIm too slick to slip up or get tricked by the shady type\nChomps y'all talk and still wonder how loose I got\nWhen Im in town I give the boosters booster shots\nBreaks breaks, face face, never never, waste waste\nYour mind on a rhyme\nThat will get thrown in your fronting face\nI'll cut your throat, I'll cut it short\nNo one ever getting near\nLatifah's had it up to here\n\nRoyal and loyal\nFace the fire boy\nYou wouldn't get the time of the day\nSo make way, hey, silence I say\nLay low and have a cold one\nCause the whipping I'm dishing is an old one\nI through some soul into my morning bowl then I rolled\nI took your gold and stopped your singled\nCause it never ever sold\nMatter of fact it never even got the time to sprout\nSo you could never give me body or come in my house\nThe flavor unit is doing it back again this year\nHow many flavors of the flavor can you love to hear\nFeel the force of my holocaust I'm staring at ya\nPut in a bid on who will fall I'm sure to match ya\nSnatch ya stature\nYour broken looks more like a fracture\nCatch that rapper\nLatifah will be back to crush ya\nGo buy a heart\nCause from the start I told ya no one getting near\nLatifah's had it up to here\n\nGive it to 'em Queen, who got it?\nGive it to 'em Queen Latifah\nGive it to 'em Queen, who got it?\nGive it to 'em Queen, the flavor unit\nGive it to 'em Queen, I got it\nGive it to 'em Queen, Latifah\nGive it to 'em Queen, DJ A D\nGive it to 'em Queen, ease off\nGive it to 'em Queen\n\nL A, L A T I F A H in command\nGive it to 'em Queen\nL A T I F A H in command\nGive it to 'em Queen\nL A T I F A H in command\nGive it to 'em Queen\nL A T I F A H in command\nL A T I F A H in command",
 "image": "https://images.genius.com/56a95ab70f98e173e08e91a297a5057a.640x640x1.jpg"
}