{
 "title": "Let It All Hang Out",
 "album": "The Concrete",
 "year": null,
 "lyrics": "Ahhh.. yeahh..\nChillin with, A.D.O.R., c'mon\n Me and Pete Rock\n Uh-huh\n Kick the fat tracks\n Yeahh!\n C'mon\n C'mon\n\nPumpin out fuel, for all to use yo\nWe're gettin buckwild on this A.D.O.R. slammin groove\nSteppin up to bumrush the stage\nGet the crew motivator by the spark of the rage\nThe mic is the teacher, to get you out the cage\nFrom the get-go, the critics ranted and raved\nCause Hip-Hop was too strong\nThe road to the riches we began to pave\nWhere the body, the mind, the soul become one\nIntertwined with PEACE and hostility none\nIs the message loud and clear, for all to hear\nAnd may the crowds cheer (UHH) which is a season of the year\nThe flow, a-to a rugged kind of tempo\nAnd what this all means it's time to let yourself go (GO)\nIt's time to get you on to this ninety-delic tip\nI'm not a hippie but yo B I'm hip\nA ninety-delic definition means no more self doubt (yeah)\nFuture on point yo my brother's gonna work it out\nThe pressure gets hot a state of mind is in with clout\nFlip off the vibes c'mon and let it all hang out\n + (A.D.O.R.)\nLet it all hang out (uhh, cause we got what ya like)\nHang it out.. let it all hang out (cause we got what ya like)\nHang it out.. (let it all hang out) yeah, c'mon, hang it out\nLet it all hang out, hang it out\n\nC'mon, feel the vibe from the rhythm as I break the devil's ties\nA feeling of good times, musical highs (yeah)\nRhythm, harmony, soul skills and that put together\nFor the master plan is surely to attract (UH)\nThe people it take, the speakers to quake, the points to make\nThe A.D.O.R. posesses what it takes\nTo make it feel good, the way it should\nGive me the mic and Pete Rock and you know I could\nStand up get'cha all, UHH, all night long (yeah)\nIt feels too right, too strong to be wrong\nLet's turn it up, full blast, and make it last\nYo I'm thinkin bout the future, {*fuck*} the past\nWith the beat that's pumpin (uhh)\nTo get the people jumpin but sayin somethin\nDo you know what, I'm talkin about\nWhen I tell you to express yourself (yes sir)\nAnd let it all hang out\n + and - some ad libs\n Pete Rock, give it to 'em\n{*Pete scratches and mutters incomprehensibly*}\n\nSo clap your hands, hip-hop fans\nFor Another Definition Of the Rhythm is what you demand (yeah)\nPump your fists and yell go, go\nFor what A.D.O.R. posesses is a feeling from seasoned soul\nFor all to feel, cause our feeling is real\nSome new jacks don't know the deal\nIf you can shake it (shake it), and not fake it (fake it)\nC'mon rise you're gonna make make make it\nTo the top of the pile, get hyped fly child (yeah)\nWhile this record's spinnin, I'm settin the pace\nFeel the bass cause the verdict is in (uh-huh)\nE.M.'s on the case, to get you all, uhh\nWith the beat that's raw\nAnd {?}'ll give it to you, uhh of course\nI don't drink the Stout, but I get wide open (yeah)\nWhen I shout, when I shout ah-let it all hang out\n + and - some ad libs\n\nCause we got whatcha like\nAh-let it all hang out, cause we got whatcha like\n - repeat above to fade",
 "image": "https://images.genius.com/67e73551df3aea256a8c98401202cad3.500x500x1.jpg"
}