{
 "title": "Lost in the Storm",
 "album": "I Gotta Get Mine Yo!",
 "year": null,
 "lyrics": "I walk down the street, yo pick any one\nI see a little ruffneck kid with a gun\nI said, \"Little homeboy what's up with the Glock 19?\"\nHe said a damn crack fiend just went and took his mama's life\nAnd now the kid's over there smoking the pipe\nI said, \"Guilt will let him know what he did\nAnd you don't need to go to jail, you're just a kid\nGive me the gun little G, just cool it down\nYou've got a lot to live for you're college bound.\"\nAnd so he screams and cries, we start huggin\nOn the corner in Ft. Greene, we're buggin\nTears drip as we walk to the crib\nAnd I'mma try to be there to comfort the kid\nI woke up it's a brand new day\nLittle man blew himself away\nAnd I'm scorned, an emotional thorn\nAnd I'm lost in the storm\nWell back in the hood, understood, I mean understand\nThe conspiracy upon the first man\nDeath to the Klan pump the fists that's connected\nTo the elbow joined by cartilage to the dark hand\nAnd the plan to conserve this confused violent land\nDifferent races, faces share the same spaces\nSewed by arrogant laces\nTaste this peach its real, real sweet\nExtra reasoning seasoning to the weak\nWill be done before the sun starts to nova\nOr we'll be over\nReveal the passion button now hit it\nCause no one is born a bigot\nDelete what you have engraved in your mind\nAnd throw up the peace sign\nAnd maybe be reborn or be lost in the storm\nWell it's ninety-two we will make it to ninety-three\nWith no P-E, A-C-E\nIt won't happen so stop your damn finger tappin\nFind the music of peace and start rappin\nThe answer lies in your hearts then your minds\nAnd maybe then we can save human kind\nPut away the guns and have fun was a strong motto in ninety-one\nBut a Woodstock ninety-two the many join the few to delete the racist crew\nWithout death cause that will be illogical\nPeace will cover every newspaper article\nSo now then, where do we start\nEverybody knows they have to play a part\nOpen your minds and clear your minds\nAnd throw up the peace signs\nCause to scorn, be reborn, everybody let's be reborn\nOr be lost in the storm",
 "image": "https://images.genius.com/a2ac14383ad468f33b703d68c72a01ba.400x400x1.jpg"
}