{
 "title": "Mic Checka",
 "album": "Dead Serious",
 "year": "1992-07-16",
 "lyrics": "Riggidy-raow, \nZiggidy Gadzooks\n, Here I go, so\nFliggedy-flame on\n, G-Geronimo, yo\nI biggedy-burn riggedy-rubber when I blabber great\nI miggedy-make the Wonder Twins deactivate\nIt's Krazy, I'm \nbiggedy-breakin' backs and bustin' lips\nI friggedy-freaked Gladys Knight and those freakin' Pips\nShrimps, \nI miggedy-make enough noise like Bamm-Bamm\nThrow boulders from Bedrock you'll get dropped, I slam man\nSo check it, I riggedy-wreck it quick, aw shucks\nI giddedy-got the big ducks\n like Daddy Warbucks\nOh and ah, I riggedy-rocked the Copacabana\nBanana split, \nhack-thoo, spit! So sit!\nI friggedy-freak it from here to Bangladesh\nI'm riggedy-rippin' flesh plus I get fresh like this\nSwish, swiggedy-swooshed kid, you'll get it done\nSquooshed for fun, I riggedy-rhyme like no one\nI biggedy-bum riggedy-rush chiggedy-chumps, I'm savage\nI shake 'em up and down like the Dow Jones Average\nI'm cocky, like Rocky, I biggedy-bangs the best\nSo tiggedy-tell your friend, chump, cause here comes Das EFX\n\nA-higgedy-hoy there matey, I giggedy-gots to flow\nMy Saturday nights are live-er than Joe Piscopo\nSo yo, siggedy-save the bait for Charlie Tuna\nSee I be the boogie banger, like Esiason's the Boomer\nI'm higgedy-hots to trot, I giggedy-\ngots the Motts\nJewels plus dreads, so toots, call me Goldilocks\nI ciggedy-catch the scoop from \nPeter Jennings\nDo a spin like the Mack \nand I slide like Peggy Fleming\nOr a smiggedy-smack a fag and choke 'em up until he squeals\nI \nHawaiian punched\n the \nCaptain and now I'm maxing with Tenille\nI piggedy-pack steel, I got a big gun\nI'm freaking the track from Brooklyn, yo, cause Brooklyn's where I'm from\n\nOOOH-WEEEEEEE! Tiggedy-time to get buckwild\nCall me Butterfingers cause I drippedy-drop umm, 'nuff styles\nIggedy-eeny-meeny-miney-moe\nShiggedy-bop-bap, I'll snatch a rapper by the toe\nYo, I riggedy-write my pages when I figgedy-feel the flavor\nI fliggedy-fly the friendly skies, so now I take a SkyPager\nLePew! I figgedy-freaks the funker\nThe rough Nestle Cruncher\n, \nword to Arch' Bunker\nSo gimme the mic and I'll liggedy-light it up like Uncle Fester\nMicrophone checka, one two checka\nOh yessir! I tiggedy-take no shorts, I'm not the fella\nI might can even act; Stella - who? Stella - who?\nYo Stella, \nhere kiggedy-comes the bumrush\n, mayday!\nNo static, I niggedy-knows more kids than umm, Bebe\nSo higgedy-hey hey hey, not Dwayne but I got props\nI biggedy-bust rhymes like Slick Rick busts shots\nSo when, I friggedy-freaks the funk, I'll be the ill funk freaker\nI stiggedy-stole an apple from this bum named Bonita\nSo riggedy-rub-a-dub I got the lip to make ya flip\nBustin' heads with Erick Sermon and my nigga Parrish Smith\n\nKiggedy-kiss my grits\n, check the jingle\nI diggedy-don't bruise but snooze like Rip Van Winkle\nSo twinkle, twinkle, twinkle little star\nI sliggedy-slam dunk like Kareem Abdul-Jabbar\nNumbskull, \nI piggedy-pump up like Reebok Pumps\nI friggedy-freak the stuff that makes a camel lose his humps\nChumps, \nso wiggedy-where's the beef\n, um chief\nHe figgedy-fits the mold like the gold that's on his teeth\nI rocks 'em, I socks 'em\n, I drops 'em, ah-choo\nSo riggedy-ready sit down, hut one, hut two\nI diggedy dot my i's, and cross my tiggedy-t's, bro\nI swiggedy-swing more action than Hawaii Five-O",
 "image": "https://images.genius.com/5f75acd47eb7460196cbe38f320bfafc.580x576x1.jpg"
}