{
 "title": "One Time’s Got No Case",
 "album": "Mack Daddy",
 "year": "1991-11-21",
 "lyrics": "What you pullin' me over fo' mistuh offi-suh?\nI'll be askin' the questions Leroy\nMy name ain't Leroy, man\nHeh, all right Jerome, outta the car\nMan, why I gotta be Jerome man? Why can't I be Tommy or Philbert or something?\nJust put your hands on the hood Muhammad\n\nIt's the man that you love to hate\nComing outta Washington state\nCops don't like my profile\nCause Mixalot kicks much style\nSo the man is on my trail\nHe wanna take Mix to jail\nIf he does, I'll make the bail\nCause I know alot of rich females\nI'm shakin' 'em just like this\nKeepin' that Porsche in fifth\nKing County cops don't quit\nEven when a young brothers legit\nSo they follow me wherever I go\nI hear 'em on the radio\nWith a scanner that I bought from the sto'\nCause a brother like Mix gotta know\nI'm checkin' them cops with radar\nThey don't believe I'm a rap star\nThat my brain is up to par\nAn I'm ready when they follow my car\nI know they wanna spray me with mace\nCause my trunk keeps pumpin' much bass\nBut they best get outta my face\nCause one-times got no case, give it to me\n\nOne-times got no case\n\nThe police think I'm movin' them keys\nThey trip cause I clock much D\nThey pull a gat an' they yell out \"Freeze!\"\nI'm whippin' out my I.D\nMy gat sits under my seat\nThe cops throw me out in the street\nThey found my gun like thieves\nOfficer Friendly has got a new beat\nSo I show him my gun permit\nI told him I roll legit\nGive me a test to see if I'm drinkin'\nThey claim my breath was stinkin'\nThey had me walk on the line\nI walked backwards stopped on a dime\nMy female just reclines\nCause she knows I know the time\nI'm hip to the cop procedure\nThey get ya everytime they see ya\nThey stop ya, they cuff ya\nThey roll ya an' they rough ya\nThey ask what I do for a livin'\nShould this information be given?\nThis is what keeps me driven\nSome cops want a brother in prison\nSo I got me a few attorneys\nJust in case a cop wanna burn me\nThey protect me from the state\nCause one-time's got no case, break it on down\n\n\nA cop asks me \"What's my name, and don't lie\"\nAnd I'm askin' officer \"Why?\nWhy ya wanna mess with a brother like Mix\nWhen you know I'm livin' legit?\"\nThe cop said \"Don't get smart\nI tear soul-brothers apart\"\nI said \"Well take off your gun, if you wanna get done\nAn' I'll show you that I ain't the one\"\nThe cop rolled up his fist\nPuts the handcuffs on my wrists\nThen he threw a straight jab and he missed\nA female cop pulls up and she's pissed\nBut this cop had K-9\nA soul sister, yes she's fine\nI said \"Won't ya help a brother outta bind?\"\nBut that badge was going to her mind\nSo she stuck a billy club in my back\nShe said \"Don't think because you're black\nThat I won't beat you\", crack, \"hit you with the gat\"\nHer partner starts to laugh\nOooh, hit 'em again. Hit 'em again\nSo they took me on down to the jail\nP.L.B. came to pay my bail\nThen we called \nGoldstein\n and Claire\nThem's my lawyers walkin' up the stairs\nTo the courtroom dressed in suits\n'Bout to give a couple cops the boot\nSo the female cop takes the stand\nTook her oath with the wrong damn hand\nMy lawyers ate her up like catfish\nThe other cop pleads the fifth\nShe lost her job, I seen a few tears on her face\nSorry baby, one-time's got no case",
 "image": "https://images.genius.com/1580817e18560ca4eaa91d1117286033.600x600x1.jpg"
}