{
 "title": "Pass da Mic",
 "album": "Somethin 4 da Youngsta’s",
 "year": "1992-03-10",
 "lyrics": "I strike back with the mic and track\nWhen it comes to drums it's like I hyper-react\nMy mind starts to generate words that penetrate\nThen I eliminate suckers who imitate\nOnce again, I reveal the skill\nMoney's growin' like grass with the mass appeal\nIt doesn't matter; hardcore or commercial\nI'm universal, this says rehearsal\nThe name's Qur'an, consider me a brighter man\nI'm climbin' charts like Spider-Man\nA legend in my own time, with the microphone I'm\nOne of the world's most electrifyin' hosts\nI dust MC's off like an antique\nSo, sit back and let this young man speak\nSorry suckers, take a hike\nBut for now, I'mma pass the mic\n\nPass the mic, yo, pass the mic!\nYo, Tarik, why don't you grab the mic?\n\nI come to riggidy riggidy rip the rhyme, again and again and again\nI go for what I know, more ready then I ever been\nMy rhymes luck against you all because it gets wicked\nNever comin' off soft, so we could kick it\nI'm slicker, quicker with the vocals\nMy pocket stay thicker than bifocals\nSo, here's a telescope if you can't tell it's dope\nYou put your hand in my spot? Nah, I'm here to tell you nope\nComin' with more hits than The Red Sox\nNo, I don't smoke blacks or dreadlocks\nSo, take notes to every move I'm makin'\n'Cause Rick Gz'll definitely get your booty shakin'\nRippin' 'em up, throwin' 'em down\nGroomed pound for pound with a hardcore sound\nRight about now, I'm doin' just what I like\nMy time's up, so I'mma pass the mic\n\nPass the mic, yo, pass the mic!\nYo, Taji, why don't you grab the mic\n\nI'm known to riggity rip, rip a rhyme like Jack the Ripper\nSlick, ???\nI got more juice than citrus, suckas can't get with this\nI ring more bells than a Jehovah Witness\nSomebody said I went out like a grape\nI wouldn't hurt you physically, I hurt you on tape\nSit back, relax and just chill\n'Cause I'm about to give you the definition of a real deal\nThe name's Taji, destiny's my crown\nFor everyone who's standin', it's time to get on down\nThen you wonder how the heck I'm on stage\nRippin' up the scene just like the 12 gauge\nThen let me flip, then rip and turn the page\n'Cause I get dissed, very good for my age\nRight now, I'm about to take flight\nSo, I'm gonna pass the mic\n\nPass the mic, yo, pass the mic!\nMentally Gifted, why don't you grab the mic?\n\nHere's a quick flashback by me on the last track\nGet a whiff of this, you won't want none of your cash back\nContinuous flavor, I always seem to set you straight\nYou heard so many wack songs, I couldn't let you wait\nAnother minute, better yet another second\n'Cause once I give 'em 1-2 check it, you know the brother's wreckin'\nSo, put me in the books, one of the best who did it\nI'm the top soloist, all the rest should quit it\nAin't nothin' to it, I'mma do it like I'm hittin' skins\nAnd at the same time, you can believe I'm gettin' ends\nI catch fits 'cause it gets irritative when\nSuckers act like they got a creative pen\nBut they don't, so they need to just settle down\nBecause it's time to put my foot on the pedal now\nSome suckers thought I really couldn't do it right\nBut for now, I'm gonna pass the mic\n\nPass the mic, yo, pass the mic!\nMentally Gifted, why don't you grab the mic?",
 "image": "https://images.genius.com/f548a958904a29a166754b099ca50a61.800x800x1.jpg"
}