{
 "title": "Roadrunner",
 "album": "The Fabulous Chi-Ali",
 "year": null,
 "lyrics": "Verse 1: Chi-Ali\nI be the Chi, oh who I be\nNo matter cause the serve say tre on a dime platter\nBatter up batter boy, joy to the world\nGet goosed by the Footloose crew and the youth\nBack your brother Bam Bam, here comes the stool with more\nWhat you hear will come clear\nFix up the mommy doo, jams that I adore\nMaking it clear to all ears\nYou wanna grab a yolk, don't choke on the young one\nCome here I come, here I kiddy come come\nMe not ??? yo ways in the days\nThat come, lay low, and then you get some\nI'm around you on the neck for respect\nYou didn't want to cash in, so I'm mashin\nLevel from the low mumbo jumbo\nThey be splashing, and I be asking\nWanna swing a chop-shop rhyme by the pack?\nThat's a no no coyote, look how ya act\nAfter I step on, you'll be stepping all in it\nCause I'm the roadrunner running things\nChorus: Dove\nCool it coyote, I'm the roadrunner running things (Repeat 4x)\nVerse 2: Chi-Ali\nSo on after Jabberjaw and for sure\nI rhymes any rhymes, I rhyme for sure\nPashes to bashes, bigger figure here\nAshes to ass, I trigger niggas here\nCoyotes learn I burn every time\nIt's my turn, seems like a perfect\nBut is it worth it? Better be, better G\nThan the next wrecks, or else I get vexed\nNo how did this adept kid turn rap?\nAll hips wanna flip when they check the stat\nBut 40 ain't the shorty to be guzzling with\nI'm out to get paid so I sip lemonade\nThe ruffian youth with the pocket full of poof\nSo don't check the label, you're liable to goof\nI work wonders, put a drumbeat to thunder\nRhyme like a rain, lay low and maintain\nBreak the batter boy with my rat-tat-tatta toy\nDon't block the roadrunner boy, son enjoy\nA talk from a New York brother in a swing\nIt's the roadrunner running things\nChorus\nVerse 3: Chi-Ali\nMy problem coyote? I wrote this hit\nThis for the doggy doggy step right out\nDon't flow the ritual puppy just sit\nSoon comes a mini rhyme, in styles out\nI funk the whole pile, wicked and wild\nMust I profile? Well not by the mile\nI got you nagging, bragging, that the Chi was raggin\nBut I grin and just smile\nSo listen real close, the brother might boast\nAlthough I appear as the guest and the host\nNo need for all the lingering and loitering\nWhen the roadrunner's running things\nChorus",
 "image": "https://images.genius.com/62850ade6ed5ea761aa795fb07fd8144.640x640x1.jpg"
}