{
 "title": "She’s Got That Vibe",
 "album": "Born into the 90's",
 "year": "1991-11-22",
 "lyrics": "Ayo, R. Kelly, what's up, man?\nYou've been spending a lot of time with this girl, man\nI don't know, man\nShe just got that vibe, you know what I'm saying?\nAiight, tell me the script\nAiight bet\n\nVibe (hey), vibe (vibe), vibe (you've got that vibe)\nYou've got that vibe (you've got it)\nVibe (that vibe), vibe (girl, you've got that)\nYou've, you've, you've got that\nVibe (yeah, she's got that vibe)\nVibe (come on, she's got that vibe)\nVibe (yeah, she's got that vibe)\nGirl, you've got that\nYou've got that vibe (come on, she's got that vibe)\nVibe (yeah, she's got that vibe)\nVibe (come on, she's got that vibe)\nYou've, you've, you've got that\n\nOoh, stop the press, girl, you turn me on\nAnd I wonder if I could take you home\nI must confess, the tight mini-skirt you wear\nI just can't help it, baby, I can't help but stare, so\n\n(Tell the DJ)\nTo pump it up a little more\nHey, girl\nI gotta let you know that you've got that vibe\n\nVibe (yeah, she's got that vibe)\nYou've got it, vibe (yeah, she's got that vibe)\nBaby, vibe (come on, she's got that vibe)\nGirl, you've got that (yeah, she's got that vibe)\nVibe (come on, she's got that vibe)\nVibe (come on, she's got that vibe)\nYou've got that vibe (yeah, she's got that vibe)\nYou've, you've, you've got that (she's got that vibe)\nIt's one o'clock and the party's just beginning\nThe place is jumping, ooh, what a lovely scene\nGotta let you know, let you know the deal\nI want you now, baby and I'm for real, so\n\n(Tell the DJ)\nTo pump it up a little more\nNow, baby, I gotta let you know that\nYou've got that vibe\n\nVibe (yeah, she's got that vibe)\nAlright, vibe (come on, she's got that vibe)\nBaby, vibe (yeah, she's got that vibe)\nGirl, you've got that (come on, she's got that vibe)\nVibe, you've got it (come on, she's got that vibe)\nVibe, that vibe (come on, she's got that vibe)\nYou've got that vibe (yeah, she's got that vibe)\nYou've, you've, you've got that (she's got that vibe)\nYeah, how would you like to get a piece of this pie?\nYou could be my girl, and I could be your guy\nYeah, cuddle me in your arms like I'm your teddy bear\nThere, isn't that nice? You'll have no fear, yo\nKiss me you fool and make me melt like butter\nWhen it comes to sayin', \"I love you\", I won't st-st-st-stuttter\nI'll turn you on like a neon light\nMake everything alright, like in the middle of the night\nYo, when you need somebody to love you\nLike Flintstones, we'll have a yabbadabbadoo\nKiss and caress you and hold you and my word is bond\nYo, P. A. (wassup?) She's got that vibe, huh\n\nVibe (she's got that vibe, yeah, she's got that vibe)\nSwing it with me, baby\nVibe (she's got that vibe, yeah, she's got that vibe)\nSwing it with me, baby\nVibe (she's got that vibe, yeah, she's got that vibe)\nSwing it with me, baby\nVibe (she's got that vibe, yeah, she's got that vibe)\nGirl, you've got that\n\nVibe (yeah, she's got that vibe)\nVibe, you've got that (come on, she's got that vibe)\nVibe (yeah, she's got that vibe)\nYou've got that (come on, she's got that vibe)\nYou've got that vibe (come on, she's got that vibe)\nVibe, you're looking good (come on, she's got that vibe)\nFeels so nice (yeah, she's got that vibe)\nYou've, you've, you've got that (she's got that vibe)\n\nJoAnn's got it (yeah, she's got that vibe)\nLanise has got it (yeah, she's got that vibe)\nTheresa's got it (yeah, she's got that vibe)\nTonia's got it (yeah, she's got that vibe)\nI tell ya Cheryl's got it (yeah, she's got that vibe)\nBoy, I tell you Betty's got it (come on, she's got that vibe)\nChip has got it (yeah, she's got that vibe)\nAnd Ann's got it (that girl has got that vibe)\nGail's got it (yeah, she's got that vibe)\nStephanie's got it (come on, she's got that vibe)\nAnd Sabrina's got it (that girl has got that vibe)\nRochelle has got it (yes yes, she's got that vibe)\nGladys got it (come on, she's got that vibe)\nMontina's got it (come on, she's got that vibe)\nLittle cute Aaliyah's got it (yeah, she's got that vibe)\nOoh, Stacy's got it (that girl has got that vibe)\nI'll tell you Tina's got it (come on, she's got that vibe)\nI'll tell you Ria's got it (Yes yes, she's got that vibe)\nOh, Laura's got it (come on, she's got that vibe)\nAnd Kim's got it (yes yes, she's got that vibe)\n\nVibe (yeah, she's got that vibe)\nYou've got that vibe (come on, she's got that vibe)\nCome on, baby (yeah, she's got that vibe)\nYou've, you've, you've got that (she's got that vibe)\nGo to work on me (come on, she's got that vibe)\nGo to work on me (come on, she's got that vibe)\nGo to work on me (come on, she's got that vibe)\nGo to work on me, baby (come on, she's got that vibe)\nGo to work on me (come on, she's got that vibe)\nGo to work on me (come on, she's got that vibe)\nVibe (yeah, she's got that vibe)\nYou've, you've, you've got that (she's got that vibe)",
 "image": "https://images.genius.com/17a700c0495a0342f69a83ef1866ecdc.600x599x1.jpg"
}