{
 "title": "The Choice is Yours",
 "album": "A Wolf in Sheep’s Clothing",
 "year": "1991-10-22",
 "lyrics": "Oh, Yeah! Yeah, baby!\nThat's it, that's it!\nI'm working with that\n\nWho's the Black Sheep? What's the Black Sheep?\nKnow not who I am, or when I'm coming, so you sleep\nWas it in your room, or was it in your sphere?\nKnew not who I was, but listen here\nDres, D-R-E-S, yes I get suckers start\nIf it's all right with you, I'll rip this here one apart\nBack, middle, to the front, don't front\nWanna a good time, gonna give you what you want\nCan I hear a hey? (Hey!)\nNow get a yo! (Yo!)\nYou got a hey? (Huh!)\nIt's for the hoes (Oh!)\nThe styling is creative, Black Sheep of the Native\nCan't be violated, or even decepticated\nI got brothers in the Jungle, cousins on the Quest\nDeaf, retarded uncles, \nin parties where\n they rest\nGuess, which way, what, when, how\nMista Lawnge, Dres, Black Sheep slam now\nKnow you've heard the others, phonies to the lovers\nThen of course, the choice is yours\n\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at, where it's at\n\nWhere's the Black Sheep? Here's the Black Sheep\nEven if we wanted to, the flock could not be weak\nWatch me swing like this, why should I swing it like that?\nBecause, in fact, on me, it might not attract\nTherefore, I ignore, do as I feel inside\nI live with me, I've got my back tonight\nY'know what I'm saying?\nYo, Black, I'm not playing\nNeed to go with this or go with this with no delaying\nSee, in actuality, one day can it be\nI made it look easy because it is to me\nAnytime capacity was filled, try to rock it\nAnytime a honey gave us play, tried to knock it\nNever was a fool, so we finished school\nNever see us sweat and you'll never see us drool\nOut to rock the globe while it's still here to rock\nDon't punch girls and we don't punch a clock\nGotta go, gotta go, see you later by the cat\nAnd you can't beat that with a bat\n\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at, where it's at\n\nNow you can get with this, or you can get with that\nI think you'll get with this, yes, for this is kind of phat\nIf you get with that, then you will surely miss\nBecause that is so wack, I think you'll get with this\nFor in the day in my life, or rather the life through my days\nNever sweat the chaos, for a Balck Sheep has ways\nAlthough, how shall I say it? Take a point, convey it\nStyling is quite Dolby, yes, I know those for you play\nNot to be all that, thought all that is my goal\nStumble and fell, brother, like Dres would roll\nNeed a sexy honey for a twilight stroll\nGave up on sushi, give me an egg roll\nAt A&W, get to the Root, with a boot or sneaker\nGet near a speaker, demo to a single\nTo the kind with fly hoe, damned the scenario\nAnd pass a plate or cross the fader\nBlack Sheep getting played, like a Sony Innovator\nDres, the creator of a style that is much greater\n\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nYou can get with this, or you can get with that\nI think you'll get with this, for this is where it's at, where it's at\n{Please get rid of these annotations as they aren't actually a part of the song}\nPick it up! Pick it up! Pick it up!\nAnd you can get a scoop",
 "image": "https://images.genius.com/7744f0768629d8a143c0c7c80654c893.1000x1000x1.jpg"
}