{
 "title": "Final Frontier",
 "album": "Kizz My Black Azz",
 "year": "1992-05-14",
 "lyrics": "Hey, hey Ren, hey check this out loc\nHey man I've been hearing a gang of niggas\nTalking a whole lot of unnecessary bullshit man\nWhat if one of them trick ass niggas\nCome at you the wrong way, loc?\n\nI'll beat a nigga's ass on this track just for the hell of it\nThere the motherfucking piece of pussy there's no tell of it\nI don't give a damn I'll beat a nigga like he stole something\nAnd then I'll let the motherfucker know where Ren is coming from\n(Where you from, loc?)\nI'm from Compton, everybody's on the wagon\nI'm looking for niggas that's thinking\nThat they're the shit, that's who I'm tagging\nNever asking questions I just go right in and do it\nAnd if you're thinking that you can fuck with Ren\nYou bitch already blew it\nLike I said before, fools want up in my shoes\nBut after fucking with me\nThey giving up rapping and singing the blues\nMe and DJ Train dropping bombs like a B-2\nSo you should get the picture or if not, you get a preview\nThat we don't take no shit\nCause MC Ren ain't a nigga that you wanna try and fuck with\nKick a little ass in my spare time\nTo keep myself occupied when I'm not busting up a rhyme\nWriting that shit that ya love to hear\nCause MC Ren is the final frontier\n\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10\n\nNow throw your hands in the air and let me see ya slap a ho\nStart the violence going on through an MC Ren show\nI don't give a fuck if niggas is fighting in the crowd\nI only got one concern, that's my vocals pumping loud\nI'm standing on the stage I got my niggas to my right\nI bust a couple of verses\nThen jump in the crowd and get with the fight\nI hit a nigga off in the head with a chair\nThe reason for that, the motherfucker he was standing there\nThen DJ Train will grab the \ngauge\n - just in case a motherfucker\nTalks shit; he'll be the victim on the front page\nHe's on his way to the morgue - to kick it with the rest\nOf them motherfuckers that I gave free room and board\nSo when you at my show\nLet me see ya throw your hands up in the air and slap a ho\nCause that's the only noise I wanna hear\nCause MC Ren is the final frontier\n\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10\n\nThe final frontier makes the average nigga wonder\nWhy they do a couple of records and then they go up under\nTry to copy Ren but Ren just can't be duplicated\nMotherfuckers making pussy shit so I come in and fade it\nSlap the niggas like bitches if they have to talk back\nPut my foot so deep in their ass they have a hole and not a crack\nThe shit just makes a nigga laugh, cause niggas be coming to me\nAsking me why did I leave a size 10 Nike in their ass\nI tell them I had to do it was part of the plan\nTo try to stop the fools jacking off by the hand\nPutting wack records in the make\nBy using R&B fucking singers in the god damn breaks\nTrying to go commercial but they started out street\nThat's reason why they're still drivin in their two feet\nThinking they can diss Ren's flow, but singing and dancing\nDon't go with the format that I be using in my show\nIt's just hardcore niggas acting crazy on the stage\nWearing gangsta clothes yo and spitting on the hoes\nDoing that shit that ya love to hear\nCause MC Ren is the final frontier\n\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nWho is it?\n - The black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10",
 "image": "https://images.rapgenius.com/082faa1e7fc1639a5290c343678cbda6.946x952x1.jpg"
}