{
 "title": "True Fuschnick",
 "album": "F.U. Don’t Take It Personal",
 "year": "1992-08-14",
 "lyrics": "I don't wanna grow up cuz I'm a True Fuschnick\nWe got a million styles that we compile\nThat we can play with\n\nI'm a True, what? I am a True Fushnick (Repeat 3X)\nSo sit, Buddah, sit\n what lyrical styles should we kick?\n\nI'm a \nrowdy roddidy piper\n I flash my \ndread sherlock Holmes\nThe thicker the richer the bigger the dread\nSo I don't need no honeycomb\nSo eeney, meeney, miney, mo good goobelly goo I bumped my toe\nUh-oh, \"Uh-oh better get Maaco\" chocolate Chip's about to flow\nThe super the cola the fraja the listic expialadope Chip\nWhen the mic is gripped in ridobidobip bip da be bong de dang, bo!\nCause worries and botherations when I wraps it up again and again\nBut not with the same few styles, I'm wicked and wild and versatile\nWhen the mic is gripped by Chip you better believe it's worth your while\nPause for the cause stop make way hurry up\nHere I come come come\nMy lyrical styles are not to ifos nos in other words\nThey're not soft son rocks it rigade raggamuffin say it backwards\nAggarniffum so abra Fu alacazam run come follow me man\nPut it by one phenomenon huminahumina I'm not done\nMe-oh-me oh my hello hello hi\nI'm not Huckleberry Finn I'm still speaking, shoo, fly\nDon't bother I\nSo Fe hello hifi Fu fo, make shapes of play-dough re mi\nNear far then I will sip yo Lipton Tea bo Tae Kwon Do\nLyrics are bubbling, bubbling, bubbling, bubbling, bubbling\nBubbling,*bubbling,*bubbling,*bubbling,*bubbling,*bubbling,*bubbling\nBubbling til' they're boiled\nSo don't drink the milk, Why? Cause it's rotten in other words it's\nSpoiled\nSo don't say drats, drats double or triple, quadruple drats\nMe big and me black and me hot up de spot G \njumping Jehosphats\nSome MC's rhymes ain't jack or Jill\nAnd at my styles they peak-a-boo o what I\nDoo wa diddy, diddy dum, diddy Fu\nSo peace to this Fu, peace to that Fu\nAnd a true Fu, Poc Fu, is what I dub you\n\nI'm a True, what I am a True Fuschnick (Repeat 3X)\nSo sit, Buddah, sit what lyrical styles should we kick?\n\nRock n' roll, rock'n roll!\nWhat's up with hip-hop, reggae, let's kick some soul\nI'll be a braveman like Captain Caveman\nUnga bunga, yapple-daple\nOh, snap! Holy batfu, it's an apple\nThe capital P.O.C. is on a fliptop so hip, hip hooray\nMove out my way\nCheck out what I cockadoodle doo\nSee it's true I needed psychiatric help\nWhen I was small I had \"Poc-Fu\" on my nameplate belt\nThen at last suffering succotash I waste no more time\nUsed my noodle yankee doodle came up with a rhyme\nThat was wild, bugged, delirious, looney\nDamn! it's hittin' hard\nThat's word to Gerry Cooney\nKnocking heads off shoulders rippin' em clean\nYou can even ask Idi (WHY?) He know what I mean\nCuz I'm a\n\nI'm a True, what? I am a True Fuschnick (Repeat 3X)\nSo sit, Buddah sit what lyrical styles should we kick?\n\nMoc's on wax grip, this ain't no demo\nDon't even try to flex or uck-fay with my\nMental contender, Apollo\nTime for training, jack\nAgenda. The M.O. also the Asian Mack\nIn fact I will attract, shock shit, a True Fuschnick\nClassified as I crop to the crip\nNot a gimmick to the limit, upset, confused\nYou gotta vomit\nFrom the excess food called waste\nBut a taste of oriental True Fu\nNo haste as I pace\nGogoo gogoo, \nnanoo-nanoo\nStyles that'll have you becomin' a Fuschnick too\nPsyche!\nWait a minute, you thought that I was finished\nBeginnin' in a hum endin' in a beat drum\nBeat?\nYou like it, it's comin' from the Tribe, side by side\nThird stage is the Moc\nUnifying lyrics until my tongue drops\nConsidered as an mc klepto\nTechniques could be beat, you think so?\nHell, no!\nRomp and rage upon the scene like a lyrical\nNinja master\nCrazy zany voiced out styles\nThat had ya in a dimension as I mentioned\nA True Fu steppin'\nAll attention to the Micken\nStyles that I am kickin', whippin', flexin, never flippin\nAsian that is hittin' hard until my cup runneth over\nLike a boulder never told ya\nThe M.O. was in control of\nOriental styles to compile or get with\nFiend as I hold the mic with a tight grip\nSlipped!\nHa, ha, ha!\nThat's what you get when you mess around with a True Fuschnick\n\nI'm a True, what? I am a True Fuschnick (Repeat 3X)\nSo sit, Buddah, sit what lyrical styles should we kick?",
 "image": "https://images.genius.com/97e13ffb9e7a7a7df49aa7f2240122f4.600x600x1.jpg"
}