{
 "title": "Can’t Nobody Hold Me Down",
 "album": "No Way Out",
 "year": "1997-01-07",
 "lyrics": "Bad Boy\nWe ain't gon' stop\n[Verse 1: Puff & \nMase\n]\nNow it's Sean on the hot track\n, \nmelt like it's hot wax\nPut it out, all the stores, bet you could shop that\n (that's right)\nLeave a nigga with a hot hat, fronting like\nBad boy ain't got tracks (nigga stop that)\nThere's no guy slicker than this young fly nigga\nNickel-nine nigga, floss you die quicker (uh-huh)\nDid fed time, outta town pie-flipper\nTurn Cristal into a crooked-I sipper\nEverybody want to be fast, see the cash\nFuck around they weak staff, get a \nheat rash\nAnything in bad boy way we smash (we smash)\nHundred G stash, push a bulletproof E-Class (ehehe)\nI'm through with bein a player and a baller\nJust want me one bad bitch so I can spoil her\nMase wanna be the one you respect, even when you're vexed\nRock Versace silks over a steel V-neck\nGot green never seen so you suck my jewels\nClutch my uz', anything I touch I bruise\nPuff make his own laws, nigga fuck your rules (that's right)\nGoodfellas, you know you can't touch us dudes\n\nDon't push us, 'cause we're close to the, edge\nWe're tryin', not to lose our heads, a-hah hah hah hah\n\nBroken glass everywhere\nIf it ain't about the money, Puff, I just don't care (that's right)\nI'm that goodfella fly guy, sometimes wiseguys\nSpend time in H-A-W-A-I-I\nMase, can you please stop smoking la-la?\nPuff, why try? I'm a thug, I'mma die high\nI be out in Jersey, puffin' Hershey\nBrothers ain't worthy to rock my derby\nThough I'm never drug free when I'm the club, G\nThough I know the thug be wantin' to slug me (uh-huh)\nCould it be I move as smoove as Bugsy? (yeah)\nOr be at the bar with too much bubbly? (c'mon)\nYo I think it must be the girls want to lust me\nOr is it simply the girls just love me\nBrothers wanna: rock the rolls, rock my clothes\nRock my ice, pull out Glocks, stop my life (uhh)\nI'm like, \n\"Damn, how these niggas got that trife?\nUsed to be my man, how he gonna plot on my wife?\"\nDo you think he snake me 'cause he hate me?\nOr he got his\n Ph.D; Player Hatin' Degree? (Ahaha!)\n\nCan't nobody take my pride\nUh-uh, uh-uh\nCan't nobody hold me down... ohh no\nI got to keep on movin'\n\nQuit that! (uh-huh) You a big cat? (yeah)\nWhere your chicks at? (yeah)\nWhere your whips at? (where dey at?)\nWherever you get stacks, I'mma fix that\nEverything that's big dreams, I did that (that's right)\nDon't knock me 'cause you're boring\nI'm record sales soaring, straight touring\nSimply a lot of men be wantin' to hear me\n'Cause their words just don't offend me (uh-uh, uh-uh)\nWe spend cheese, in the West Indies\nThen come home to plenty cream Bentleys (ahehe)\nYou name it, I could claim it\nYoung, black, and famous, with money hangin' out the anus\nAnd when you need a hit, who you go and get? (who?)\nBet against us? (Not a sure bet)\nWe make hits that'll rearrange your whole set (that's right)\nAnd got a Benz that I ain't even drove yet\n\nDon't push us, 'cause we're close to the, edge\nWe're tryin', not to, lose our heads, a-hah-hah-hah-hah\n[Bridge: Mase & \nPuff\n]\nI get the feeling sometime, it make me wonder\nWhy you wanna take us under\nWhy you wanna take us under?\nI get the feeling sometime, it make me wonder\nWhy you wanna take us under\nWhy you wanna take us under?\n\nCan't nobody take my pride\nUh-uh, uh-uh\nCan't nobody hold me down... ohh no\nI got to keep on movin'\nCan't nobody take my pride\nUh-uh, uh-uh\nCan't nobody hold me down... ohh no\nI got to keep on movin'\nCan't nobody take my pride\nUh-uh, uh-uh\nCan't nobody hold me down... ohh no\nI got to keep on movin'\nCan't nobody take my pride\nUh-uh, uh-uh\nCan't nobody hold me down... ohh no\nI got to keep on movin'",
 "image": "https://images.genius.com/94ea98de7330965cbc2e31cf59dce737.640x640x1.png"
}