{
 "title": "Fish and Bread",
 "album": "Full Metal Jackit Vol. 1",
 "year": "2004-07-01",
 "lyrics": "Yo, ugh, yo man, I lo-, I love writing raps man, spittin' over tracks man, this shit is just, it's too easy man\nYou know what I'm sayin'?\nIt's my bread and butter, you know what I'm sayin'?\nMy fish and bread, you know what I mean?\nIt's hot man I just, feel like this\nUgh, alright let 'em know\n\nYo, yo fish and bread keep the poor man fed\nBut that lobster and shrimp, that's the meal for a pimp\nA sandwich ain't a sandwich without miracle whip\nAnd the track ain't on fire 'til I spit my shit\n\nLay my verse, show my game\nI don't gotta keep sayin' it, you already know my name\nBut, if you don't then hi my name is Fredrick\nI spit rhymes and entertain just like Cedric\nAnd I ain't talkin' 'about no comedy show\nI'm for real, y'all fake like monopoly dough\nMan I'm tryna have that lottery dough\nBut these haters outta Gary, Indiana they don't want me to blow\nI'm bringin' pain to the game and I'm only bein' honest\nGivin' rapper the big hurt like Frank Thomas\nI hit home runs, you don't hit that many\nOnly grand slam you ever had was at Denny's\nI spit so sick I can make you hurl\nI'm so handsome that I can come and take your girl\nGive her somethin' that she used ta\nCause she love the way my cock stay up all night, just like a rooster\nI'm a winner, one in a million like Aaliyah\nI'm not thugged out but I'm jiggin' in a beah\nWho dat? who dat is? it's ya boy Freddie Gibbs\nSpittin' game like a pimp, I'm so cold on a bitch\n\nFish and bread keep the poor man fed\nBut that lobster and shrimp, that's the meal for a pimp\nA sandwich ain't a sandwich without miracle whip\nAnd the track ain't on fire 'til I spit my shit\n\nWell gon' spit yo' shit\nNigga you spit yo' shit\nGon' spit yo' shit\nNigga get off my dick\nGon' spit yo' shit\nNigga you spit yo' shit\nGon' spit that shit\nNigga get off my dick\n\nNow fish and bread keep the poor man fed\nBut I'mma lace the muthafuckin' track wit' some lyrical lead (woah) You better off smokin' on PCP (why?)\nCause I got the recipe ain't no contestin' wit' me\nYou want the drama I'mma bring it to you COD\nBut when it's over wit', said and done, I'm chargin' a fee\nYou ain't , when you spit you like a hoe wit' VD\nAnd your purpose is worthless to the whole hip hop industry\nThink ya tight on the mic with that? I disagree\nYou got ya hair pumped up watchin' AJ and Free\nLike I can do dat, but ya ain't ready for BET\nI'm aggravated, get assassinated like Kennedy\nNow what is it\nHenny done got me ready to grip the semi\nMaybe the Remy gon' tempt me out those slugs like a frisbee\nLook what you done did, you see the MD\nYou shoulda took ya mama's advice and stayed out the street\nBut take it from me, ye ain't got enough skills to compete\nAnotha thing, don't touch the boy I-V-O-E\nI'm through dealin' wit' wack cats, lames collapse from my tool\nSee I'm a big boy in this game, I got more food than a mule\nDude I'm blazin' the booth (what?) I'm hotter than fire\nAnd I'mma keep goin' 'til the world expire\nFreddie Gibbs and Ivoe, ridin' on rivals\nWe got cash wit' lyrics and you grippin' the bible (Jesus)\nKickin' shit like karate and you weaker than Taebo\nLobster and shrimp what a pimp got and that's how it goes\n\nFish and bread keep the poor man fed\nBut that lobster and shrimp, that's the meal for a pimp\nA sandwich ain't a sandwich without miracle whip\nAnd the track ain't on fire 'til I spit my shit\n\nWell gon' spit yo' shit\nNigga you spit yo' shit\nGon' spit yo' shit\nNigga get off my dick\nGon' spit yo' shit\nNigga you spit yo' shit\nGon' spit that shit\nNigga get off my dick\n\nYou have just witnessed, lyrical detonation\nBy Freddie Gibbs and Ivoe\nThat's how it goes in the murder capitol nigga\nTell 'em som' Gibbs\nGet off some dick, sons of bitches\nBitches, you heard what the fuck he said\nThat's how it goes down\nOver another production\nGet off some dick man\nResolve the issue my nizzle\nThat's how we goin' in the mad Midwest\nMy fish and bread right here man, you know what I'm sayin'?\nThis my shit, this shit is real, real easy\nY'all muthafuckas make this shit difficult, you know what I'm sayin'?\nwhat the fuck it is? get yo' shit up dude\nGet off some dick\nFish and bread keep the poor man fed\nFish and bread keep the poor man fed\nLobster and shrimp, that's the meal for pimps\nFish and bread muthafucka\nLobster and shrimp for a pimp",
 "image": "https://images.genius.com/519046615ac8a7991f6b7d43348bdbe7.500x500x1.jpg"
}