{
 "title": "Talkin’ Bout Bank",
 "album": "Whoridin’",
 "year": null,
 "lyrics": "King Saan:\nWho ride with me?\nKing Saan and Mr. T\nOut to clock G\nMajor deep with my folly\nBump the police\nThem fools ain't knowin' me\nThe K the I the N the G\nWith crazy ass Mr. T\nDoin' an Al Pacino over a C Note\nWe smoke we go for broke\nHit then choke smash on the gas\nFaster than Road Rash\nStrippin' rent for the cash\nShoot the shot and lay it off the class (whew)\nCause homey talkin' bullshit but we know\nBut you gotta recollect and respect the Hobo\nWe've been puttin' it down like major ah\nBallers in the town\nHoes get clowned\nBut don't try and stop you'll get dropped during the operation\nCause you're playerhatin'\nCause we makin'\nMajor cash\nMakin' fools major mad\nBut player haters don't really know the half\nHook:  (x4)\nRide with me King Saan and Mr. T\nOut to clock G \t\t\t\t\t\t\t\t(Just\nTalk about bank) (x8)\nMajor deep with my folley\nMr. Taylor:\nMost days I ride cut the B.S. to the side\nNothin' but pay\nEach and every way\nI say to the players and they ask\n\"What's goin' on Mr. Taylor?\"\n\"Paper\"\nBig enough to fill a sky scraper\nSo much you think I pulled a caper no vapors and chase\nSame people I find\nYou have to have a different state of mind\n(Then what?)\nI've never been stuck and          is down to rich real quick\nI stick to the calm the cool collective\nGet back with my folley out blaze up a chom\nNot flambroast but somethin' real close to divide\nShit man we came with a plan to make a grand\nGot      stand with my dice in my hand\nThinkin' I'm shootin' blanks?\nFool I'm talkin' bout bank\nBreak yourself playa. Fat lumps baby\nHook\nKing Saan:\nEverybody know it's all about bank\nPlayas ain't slippin' all day smokin' on dank\nGotta make sure I got security fuck the jury\nSo my fist of fury stay fired up\nEveryday posted drawn blue print with Mr. Tay\nSpend your scratch and let the hit play\nAnd potna you'll see why we called the WhoRidas\nSpittin' like choppers and snakes with venom\nMake you react like gin in your system\nLike adrenaline\nIf you're listenin'\nYou'll recognize that the lik is here uh\nFo life tightest new rhymes\nWhen we come through and life up your life\nLike ? flyin' through the night fool we strike\nYeah that's right\nCause when it really goes down\nFunk mode all through the town\nBitch you gots to stay paid till you go against the grain\nGot barrels to the brain\nJackers doin' they thang\nBallers in the game sellin' cocaine\nWomen yellin' your name with pictures in the frame\nI'm just talkin' bout bank\nHook",
 "image": "https://images.genius.com/585aaee6adb9f7e65aac68c3a695ddb9.350x350x1.jpg"
}