{
 "title": "Clique",
 "album": "Kanye West Presents Good Music Cruel Summer",
 "year": "2012-09-06",
 "lyrics": "[Intro: James Fauntleroy & \nBig Sean\n]\nWhat of the dollar you murdered for?\nIs that the one fighting for your soul?\nOr your brother's the one that you're running from?\nBut if you got money, fuck it, ‘cause I want some\nB-I-G\nWho fuckin' with me?\nOh, God!\nWoah\n\nOkay, ain't nobody fuckin' with my clique\nClique, clique, clique, clique\nAin't nobody fresher than my muhfuckin' clique\nClique, clique, clique, clique\nAs I look around, they don't do it like my clique\nClique, clique, clique, clique\nAnd all these bad bitches, man, they want the-\nThey want the-, they want the-\n (\nB-I-G, oh God\n)\nGo\n\nI tell a bad bitch do whatever I say (Yup)\nMy block behind me, like I'm coming out the driveway (Swerve)\nIt's grind day, from Friday to next Friday (Woah)\nI been up straight for nine days, I need a spa day (Spa day)\nYup, she try and gimme that poon-tang\nI might let my crew bang, my crew deeper than Wu-Tang (Woah)\nI'm rollin' with, ha, fuck I'm saying? Girl, you know my crew name\nYou know 2 Chainz? Skrrt! I'm pullin' up in that Bruce Wayne\nBut I'm the fuckin' villain, man, they kneelin' when I'm walking in the buildin'\nFreaky women I be feelin' from the bank accounts I'm fillin'\nWhat a feelin'! Ah man, they gotta be\nYoung player from the D\n that's killing everything that he see for the dough\n\nOkay, ain't nobody fuckin' with my clique\nClique, clique, clique, clique\nAin't nobody fresher than my ma'fuckin' clique\nClique, clique, clique, clique\nAs I look around, they don't do it like my clique\nClique, clique, clique, clique\nAnd all these bad bitches, man, they want the-\nThey want the-, they want the-\nGo\n\n(Click clack, stick 'em up)\nYeah, I'm talkin' Ye (Clique,) yeah, I'm talkin' Rih (Clique)\nYeah, I'm talkin' B (Clique,) nigga, I'm talkin' me\nYeah, I'm talkin' bossy, I ain't talkin' Kelis\nYour money too short, you can't be talkin' to me\nYeah, I'm talkin' LeBron,\n we ball in our family tree\nG.O.O.D. Music drug-dealing cousin\n, \nain't nothin' fuckin' with we\nMe\n, \nturn that sixty-two to one-twenty-five, one-twenty-five to a two-fifty\nTwo-fifty to a half a, man, ain't nothin' nobody can do with me\nNow, who with me? \n¡Vámonos!\n \nCall me Hov or \nJefe\nTranslation: I'm the shit, 'least that what my neck say\n'Least that what my check say,\n \nlost my homie for a decade\nNigga down for like twelve years, ain't hug his son since the second grade\nUh, he never told—who he gon' tell?\nWe top of the totem pole\nIt's the Dream Team\n \nmeets the Supreme Team\nAnd all our eyes green, it only means one thing\n: you ain't fuckin' with the clique\n\nOkay, ain't nobody fuckin' with my clique\nClique, clique, clique, clique\nAin't nobody fresher than my ma'fuckin' clique\nClique, clique, clique, clique\nAs I look around, they don't do it like my clique\nClique, clique, clique, clique\nAnd all these bad bitches, man, they want the-\nThey want the-, they want the-\n\nBreak records at Louis,\n \nate breakfast at Gucci\nMy girl a superstar all from a home movie\nBow on our arrival, the un-American idols\nWhat niggas did in Paris, got 'em hangin' off the Eiffel\nYeah, I'm talkin' business, we talkin' CIA\nI'm talkin' George Tenet, I seen him the other day\nHe asked me about my Maybach, think he had the same\nExcept mine tinted and his might have been rented\nYou know, white people get money, don't spend it\nOr maybe they get money, buy a business\nI rather buy eighty gold chains and go ign'ant\nI know Spike Lee gon' kill me, but let me finish\nBlame it on the pigment, we livin' no limits\nThem gold Master P ceilings was just a figment\nOf our imagination, MTV cribs\nNow I'm lookin' at a crib right next to where TC lives\nThat's Tom Cruise, whatever she accuse\nHe wasn't really drunk, he just had a frew brews\nPass the refreshments, a cool, cool beverage\nEverything I do need a news crew's presence\nSpeedboat swerve, homie, watch out for the waves\nI'm way too Black to burn from sunrays\nSo I just meditate at the home in Pompeii\nAbout how I could build a new Rome in one day\nEvery time I'm in Vegas they screamin' like, \"He's Elvis\"\nBut I just wanna design hotels and nail it\nShit is real, got me feelin' Israelian\nLike Bar Refaeli, or Gisele—no, that's Brazilian\nWent through, deep depression when my mama passed\nSuicide, what kinda talk is that?\nBut I been talkin' to God for so long\nThat if you look at my life I guess He talkin' back\nFuckin' with my clique\n\nAin't nobody fresher than my ma'fuckin' clique\nAs I look around, they don't do it like my clique\nAnd all these bad bitches, man, they want the-\nThey want the- they want the-\nGo",
 "image": "https://images.genius.com/d85d9b28d5bf3e6abaaf04dbc9802b61.1000x1000x1.png"
}