{
 "title": "Do It Like You",
 "album": "Unexpected Arrival",
 "year": "2011-10-24",
 "lyrics": "Hey, there she go\nThat's the one I've got to know\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\nHow her hair flows when she walk\nLike a Love Jones when she talk\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\n\nIt seems like for a while I’ve known ya\nNostalgic moments, feels like magic don't it?\nGirl you killin' 'em, my condolence\nThat's how you on it? Yeahhh, that’s how you on it\nAnd I'm gonna be with you no matter what it takes\nRunnin' with scissors in the traffic, tryna cut straight to the chase\nWanna be there when you wake, with no make up on your face\nNot even gloss, before you brush, love your dimples when you blush\nIt's the simple things in life we take for granted cause we rush\nI just wanna gain your trust as well as me givin' you mine\nWhat's yo' sign? I'm an Aries, I'm a 90's baby, clearly\nI'll make sure to make time for you though my schedule may vary, oh, oh\nHol' up, hol' up, hol' up,\n I just wanna know ya\nI heard 'em say that beauty's in the eyes of the beholder\nWell girl my vision’s bad so I'm gon' need you to come closer\nCloser, now you right here where you 'pose to\n\nHey, there she go\nThat's the one I've got to know\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\nHow her hair flows when she walk\nLike a Love Jones when she talk\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\n\n'Cuse me Misses, may I spark your interest?\n'Cause you sure got my attention, I just wanna grant yo' wishes. lala\nWhat you want you get it, I don't call it trickin'\nNot just 'cause I got it cause I want to, that makes all the difference\nI'm about my business, and ooh, girl, you the business\nWe should get together soon so we can do some business\nI got some things that I could teach ya, lemme show ya\nIs you ready, what's the hol' up?\nYou ain't 'bout no drama, you remind me of my mama\nSmelling like flower balm and escada, shut it down and you won't even try ta\nYou such a boss but carry yourself like a lady\nThe baddest out ya crew and that is not up for debatin', wait\nHol' up, hol' up, hol' up, I know what they say\nEvery rapper only want that sexual healin' Marvin Gaye\nDon't believe it girl, I promise I'm a treat you like my treasure\nI'm a movement by myself but I know you'll make me better\n\nHey, there she go\nThat's the one I've got to know\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\nHow her hair flows when she walk\nLike a Love Jones when she talk\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\nHey, there she go\nThat's the one I've got to know\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\nHow her hair flows when she walk\nLike a Love Jones when she talk\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like you\n\nNah, they don't do it like you\nHey, hey, love when she walk\nAnd a Love Jones when she talk\nSuch a cutie, right? Her whole crew is tight\nBut they don't do it like, you\nThey don't do it like, you\nPrettiest girl I've ever seen by the way, yeah\nYup",
 "image": "https://images.genius.com/bb336c57f07f6f356d55c9143316da9d.750x750x1.jpg"
}