{
 "title": "I Wish You Would",
 "album": "Kiss the Ring",
 "year": "2012-06-27",
 "lyrics": "DJ Khaled!\nHit-Boy!\nI’m so serious!\n\nOne, two, them boys coming for you\nThree, four, better lock your door\nFive, six, hide your bitch\n(Ayo Yeezy, pop your shit!)\n\nThey said \"thou shall not be ill, thou shall not feel\nThou should not be trill, not be drill, not be real\"\nNiggas selling packs, niggas flipping pills\nThey got heroin and cracks, man these niggas hot for real\nEvery year gon' be our year, every year gon' be my year\nThese niggas really is out here, these niggas really is out here\nThe block is at war, post traumatic stress\nRan up outta pills, rob that CVS\nNiggas getting bust over In God We Trust\nWe believe in God, but do God believe in us?\nIf we believe enough, will we ever get to know him?\nThat lean got us dozing, we forget that we the chosen\n\nI’ve been poppin' shit for too long\nBut still reppin’ where I came from\nI guess it’s how I came up\nI wish you would try to play us\n\nI wish you would nigga, I wish you would nigga\nI wish you would nigga, I wish you would nigga\nAy, I guess it’s how I came up\nI wish you would try to play us\nMaybach Music\n\nHunh! My money on a another level\nIn the streets out here I'm hotter than the fucking devil\nI wonder how I got a hundred in my fucking bezel\nG5, make it rain, I can change the weather\nWe fly, them niggas lame, where your fucking cheddar?\nAim at your brain, AK be the fucking letters\nFuck niggas fall in alphabetical order\nFrank Lucas fur, the cap run more than a quarter\nI’m at the fight, ringside, right next to promoters\nAll my niggas still hustle, consider ‘em roguish\nI remember catching buses just bought me a Lotus\nAll your codes get decoded, know the niggas you quoting\nHunh, my corner will scorch ya, somehow my flow is the coldest\nMoney, power, respect, the only things truly important\nFamily first, Khaled we gotta stay focused\nGod Forgives and I Don’t, pussy niggas on notice\n\nI wish you would nigga, I wish you would nigga\nI wish you would nigga, I wish you would nigga\nAy! I guess it’s how I came up\nI wish you would try to play us\n\nI wish you would nigga, I wish you would nigga\nYou see you got a couple cases, still look good nigga\nYou see these niggas’ll try to play ya, know how ya feel nigga\nEh yup, that’d be the day you wanna kill a nigga\nBut you gon' chill nigga, just for your kids nigga\nCause now there’s kids doing grown man biz nigga\nYou just got home nigga, you tryna live nigga\nYou don’t wanna do another 5 years nigga\nThe boss is testing yo ass, the feds’ll question yo ass\nThey be drug testin’ yo ass and then they pray you don’t pass\nAnd then you look in the sky, you got some questions to ask\nWith no response make you wanna grab the tech and the mac\n\nI’ve been poppin shit for too long\nBut still reppin’ where I came from\nI guess it’s how I came up\nI wish you would try to play us\n\nI wish you would nigga, I wish you would nigga\nI wish you would nigga, I wish you would nigga\nAy! I guess it’s how I came up\nI wish you would try to play us\n\nROZAY!",
 "image": "https://images.genius.com/e477d7a6abe12e1f1b2c680fffba6b61.500x500x1.jpg"
}