{
 "title": "International Love",
 "album": "Planet Pit (Deluxe)",
 "year": "2011-06-17",
 "lyrics": "[Intro: Pitbull & \nChris Brown\n]\nWent from Mr. 305\n, \n(Dade County)\n, \nto Mr. Worldwide\n(All around the world)\nAyy, ayy\nNow we're International, so international, international, so international\nOh, yeah\n (woo!)\n\nYou can't catch me, boy (Can't catch me, boy)\nI'm overseas and about a hundred G's per show\nDon't test me, boy (Don't test me, boy)\n'Cause I rap with the best for sure\n305 'til the death of me, cremate my body and let the ocean have what's left of me\nBut for now, forget about that\nBlow the whistle, baby, you're the referee, dalé\n[Chorus: Chris Brown & \nPitbull\n]\nYou put it down like New York City, I never sleep\n (\nYeah\n)\nWild like Los Angeles, my fantasy\n (\nChris Brown, woo!\n)\nHotter than Miami, I-I-I feel the heat (oh, yeah)\nOh, girl, it's, it's international love, oh, oh, oh, yeah, it's international love\n (\nwoo!\n)\n\nI don’t play football, but I've touched down everywhere\n(Everywhere? Everywhere)\nI don’t play baseball, but I've hit a home run everywhere (Everywhere? Everywhere) (Dale)\nI've been to countries and cities I can’t pronounce and the places on the globe I didn't know existed (Yeah)\nIn Romania, she pulled me to the side and told me, \"Pit, you can have me and my sister\"\nIn Lebanon, yeah, the women are bomb\nAnd in Greece, you've guessed it the women are sweet\nBeen all around the world, but I ain't gon' lie\nThere's nothing like Miami’s heat (Dalé)\n[Chorus: Chris Brown & \nPitbull\n]\nYou put it down like New York City, I never sleep\n (\nYeah\n)\nWild like Los Angeles, my fantasy\n (\nUh-huh, woo!\n)\nHotter than Miami, I-I-I feel the heat (oh, yeah)\n (\nwoo!\n)\nOh, girl, it's, it's international love, oh, oh, oh, yeah, it's international love\n (\nWe're international, let's rise\n)\n\nDown in DR they looking for visas\nI ain't talking credit cards, if you know what I mean\nEn Cuba, la cosa esta dura, but the women get down, if you know what I mean\nIn Colombia the women got everything done, but they some of the most beautiful women I've ever seen\nIn Brazil, they freaky with big ol' boobs and they thongs, blue yellow and green\nEn L.A., tengo la Mexicana\nEn New York, tengo la boricua\nBesitos para todas las mujeres en Venezuela, muah\nY en Miami tengo a cualquiera\n[Chorus: Chris Brown & \nPitbull\n]\nYou put it down like New York City, hey, I never sleep\nWild like Los Angeles (oh, whoa), my fantasy\n (\nWoo!\n)\nHotter than Miami (You're hotter than Miami), I-I-I feel the heat\nOh, it's international love, oh, oh, oh, yeah, it's international love\n (\nAll around the world, international, woo!\n)\n[Bridge: Chris Brown & \nPitbull\n]\nThere’s not a place that your love don’t affect me, baby\nSo don’t ever change\nI crossed the globe when I'm with you, baby\nHey, oh, whoa\nChris Brown, this for the women worldwide, lets ride (woo!)\n[Chorus: Chris Brown & \nPitbull\n]\nYou put it down like New York City, I never sleep\n (Woo)\nWild like Los Angeles, my fantasy\n (Ayy, ayy)\nHotter than Miami (You're hotter than Miami), I-I-I feel the heat\n (\n305\n)\nOh, yeah, it's international love, oh, oh, oh, yeah, it's international love\n (\nWoo! Let's ride\n)\nYou put it down like (Down) New York City, I never sleep\n (Down) (\nwoo!\n)\nWild like Los Angeles (Los Angeles), my fantasy\nHotter than Miami, I-I-I feel the heat, oh, yeah\n (\n305\n)\nOh, oh, it's international love, oh, oh, oh, it's international love\n (\nWoo!\n)\n\nOh, oh, oh\n(You're international, so international)\nOh, oh, oh\n(You're international, so international)\nOh, oh, oh\n(You're international, so international)\nOh, oh, oh\n(You're international, so international)\nWhoa, whoa, whoa, whoa\nInternational love (Surrounded by beautiful girls)\nWhoa, whoa, whoa, whoa\nInternational love",
 "image": "https://images.rapgenius.com/a2a51dac14df3a408535890146e5cb12.1000x1000x1.jpg"
}