{
 "title": "Mirror",
 "album": "Dusk Till Dawn",
 "year": "2012-05-30",
 "lyrics": "She want me, I want her\nI'm looking in the mirror at all her curves like\nOoh oh, in the mirror like\nOoh oh, in the mirror like\nShe on me and I'm on her\nPosin' in the mirror doin' things to her like\nOoh oh, in the mirror like\nOoh oh, in the mirror like\nIn the mirror, in the mirror like\nIn the mirror, in the mirror like\nIn the mirror, in the mirror like\nIn the mirror, in the mirror like\n\nOoh, she got a thing for the nasty\nYeah, she do anything you ask her\nWe all up in my crib, straight from the club\nThere's a mirror on the ceiling, right above my tub\nYeah, shawty downin' me\nLady in the streets, but a freak in the sheets\nI like to look it up, that's when we do our thing\nDo you see what I see?\nTied up, I'm 'bout to take you down\nAnd yes I'm that man in the mirror\nReflection's so sexy\nI guess I gotta make it clearer\nAnd I know that\n\n\nYeah, put your hands on the glass\nThat thang a little big, turn around real fast\nSweatin' up in here, we steamin' up the room\nI can't see your reflection, but I know what to do\nLean like this, swing you like that\nTurn you 'round front, flip you on your back\nDo you see what I see?\nDo you see what I see?\nTied up, I'm 'bout to take you down\nAnd yes I'm that man in the mirror\nReflection's so sexy\nI guess I gotta make it clearer\nAnd I know that\n\n\nYeah, like a mirror, I see you\nUh, mirror mirror on the wall\nI'm lookin' for love, I'm lookin' for love\nAnd if your mirror crack, I'm hooked on your drugs\nBuzz buzz buzz, I'm a love bug, yeah\nPurple rain she look like Apollonia\nShe smell like bath and body and begonias\nAnd me I smell like California\nBecause I smoke marijuana whenever Mary wanna\nI think her name's Stephanie, but call her Steph\nShawty so right I don't know what's left\nWho your daddy? Then I hit it faster\nThe mirror said you are you conceited bastard\n\n\nLike a mirror up in it, I could see me in it\nLike a mirror up in it, I could see me in it\nLike a mirror up in it, I could see me in it\nLike a mirror up in it",
 "image": "https://images.genius.com/f4ce05f9daf8596e38ab317eadd6c183.600x600x1.jpg"
}