{
 "title": "My Moment",
 "album": "Quality Street Music",
 "year": "2012-06-29",
 "lyrics": "You see I been waiting, waiting on that time\nFeel me if you been waiting on yours\nThat moment... is close (Yeah!)\n\nTired of living day to day like everything is alright...\nJust waiting on that moment\nWaiting on my moment\n\nYeah, 2 Chainz!\nOld dude met mom it was on\nThen he named me over a phone, prison term\nLive and learn, sippin' syrup with my vision blurred\nTake this cup of reality, niggas finna err\nWhen you start from the bottom you can see the top\nSo when you get to it, don't let 'em see the spot\nNext thing you know you lookin' for a rent sign\nUpper echelon, bitch we skip line\nI remember reminiscing in the kitchen like\nI wonder when the Braves gon' win it\nI wonder when the Falcons gon' get here; \npyrex vison\nMade more than I ever made with DTP this year\n\nTired of livin' day to day like everything is alright\nLivin like there's one thing on my mind\nJust waiting on that moment\nWaiting on my moment\nYou say you got that oh shit? Hell nah - next time that's mine\nLong as I stay hustling I'm gon' shine\nJust waiting on that moment\nWaiting on my moment\n\nWaitin' on my moment...\nJust waiting on my moment; bad hoes I'm shonin\nTime came and I owned it just like Lebron James and start ballin\nWhen I touched the rock I cracked the block, when I pulled up in that muscle drop\nWith that roof off and my shoes off on you bitch niggas, RuPaul\nReal nigga in my hood, who everybody gon' root for\nCause they see me come from that bottom where everybody get bodied\nThey told me get em, I got em, now I'm here nigga like yeah nigga\nJust Rolls Royce and Bugattis and M4's this year nigga\nIf I don't grind, I don't shine, if I don't shine, then I don't eat\nWon't eat, then I'mma starve, if I'mma starve, I pull heat\nOn all y'all bitch ass niggas, all y'all rich ass niggas\nCause if I dont make no money nigga, I'm gon' take yo money nigga\n\n[Tired of livin' day to day like everything is alright\nLivin like there's one thing on my mind\nJust waiting on that moment\nWaiting on my moment]\n\n\n[Just waiting on that moment\nWaiting on my moment]\n\nSince life ain't promised tomorrow\nLive it up! Live it up! Live it up!\nHere before it come this far\nGive it up! Give it up! Give it up!\nI won't - Give it up! Give it up! Give it up!\nUntil I have it all, yeah!\n\n[Tired of livin' day to day like everything is alright\nLivin like there's one thing on my mind\nJust waiting on that moment\nWaiting on my moment]\n\n\n[Just waiting on that moment\nWaiting on my moment]\n\nDJ Drama!\nY'all like that? We gone",
 "image": "https://images.genius.com/0ff304e9571f9afa2d48d93f08514546.1000x1000x1.jpg"
}