{
 "title": "So Gone (What My Mind Says)",
 "album": "The Light of The Sun",
 "year": "2011-06-21",
 "lyrics": "You're gonna hear the pages turn\nLet me take my Gazelles off\n\nDon't want this thing, but can't let go\nEven though I need it so\nYour arms, they soothe me, but I ain't no game\nI ain't no toy, I ain't just brain, this ain't no movie, man\nI'm a real woman, been down this road before\n(I just need more) I just need more\n\nWhy does my body ignore what my mind says?\nI try to keep it intact, but I'm here in this bed\nI need to... listen, listen\nWhy does my body ignore what my mind says?\nI tried to keep it in tight, but I'm here in this bed\nI need to... listen\n\nEmotions deep down inside of me\nI'm trying to hide, but they keep finding me\nI want to lay low, but continuously you do...\n(Uh, uh, uh!) All the right things (damn)\nSo sweet to me (Eh, eh, eh)\nWhat do I do?\nOh\n\nWhy does my body ignore what my mind says?\nI try to keep it intact, but I'm here in this bed\nI need to... damn\nWhy does my body ignore what my mind says?\nI try to keep it intact but I'm here in this bed\nAgain, I'm scared... again (1, 2)\nOh, oh, oh\n\nYou got that ocean of soul\nBaby, you super thick\nAnd I'm the man of steel with skills\nJust call me Super Dick\nI got that technique that keeps you cummin' back to back\nAnd I know you feel it all in your stomach whenever you arch your back (yeah)\nI'm a pull your hair, I know you love that\nWhen I maneuver this tongue, your eyes roll back\nI work them side angles, I'm a Kama Sutra pro\nKitchen table down to the flo\nAss in the air while you biting that pillow\nGirl, you know how I chop and screw\nThat's what a diamond chip dick do\nThat's what a diamond chip dick do\nOh my mind says and my body says something different\n\nWhy does my body ignore what my mind says?\nI try to keep it intact, but I'm here in this bed\nHe got that thickness, the kind that make you\nGet up bakin' biscuits with breakfast, so gone\nWhy does my body ignore what my mind says?\nI try to keep it intact, but I'm here in this bed\n\nWell. Gone, gone, gone... I'm scared of this love\nHe got that thickness, the kind that make you get up bakin biscuits with\nBreakfast, so gone (background)\nAnd I ain't even thinkin bout the next chick that he mess with... so\nReckless, so gone",
 "image": "https://images.genius.com/48218d3050ddb4547da5f9a6a063425e.953x953x1.jpg"
}