{
 "title": "SupaFreak",
 "album": "TM:103 Hustlerz Ambition",
 "year": "2011-12-14",
 "lyrics": "Last night it was Kush and Ciroc: I was super geeked\nCash flowing, money flowing, yeah that's a super week\nGot em for the 26.5, now that's super-cheap\nCan't you niggas tell? I'm just looking for a super-freak\nSuper-freak, super-freak, yeah you know I want a\nSuper-freak, super-freak, yeah you know I need a\nSuper-freak, super-freak, yeah you know I want a\nSuper-freak, super-freak, yeah you know I need a\n\nWhat it do? What it is? What you working with?\nEverytime you see me I'm grinding, stay on that working shit\nAll I ever wanted: a bad bitch in a Chanel bag\nStreet niggas want her cause they know she got Chanel swag\nStraight like that, yea I fuck with her the long way\nBeen bragging to my partners: I been talking about her all day\nPull up in that Super-coupe: you know them diamonds glistening\nToo much money in the room, guess I hit her in the kitchen then\nGet her to myself man, I ain't hit that girl yet\nNow that I got her to myself man,\n \nyou know I'm trying to get that girl wet\nKeep it one thousand with you: I really think I'm digging her\nCan't hear nothing but the money so she might just think I'm big enough\n\nLast night it was Kush and Ciroc: I was super geeked\nCash flowing, money flowing, yeah that's a super week\nGot em for the 26.5, now that's super-cheap\nCan't you niggas tell? I'm just looking for a super-freak\nSuper-freak, super-freak, yeah you know I want a\nSuper-freak, super-freak, yeah you know I need a\nSuper-freak, super-freak, yeah you know I want a\nSuper-freak, super-freak, yeah you know I need a\n\nRick James, super freak\nShe got that wet-wet: now that's a superleak\nTell your baby daddy that he's super weak\nFucked your girl last night: it only took a wink\n2 Chainz charm Cost 100 stacks\n10,000 with my shirt off that's 100 tats\nOk I'm done with that, you can run with that, I'mma switch it up\nThis bitch I'm with is thick as fuck, I'm rich as fuck\nLaying in the bed and I still got my semi tucked\nGoing online like, \"When they gonna make that Bentley truck??\"\nMy bankroll make em pay attention\nThe white girl like it when I whip it, whip it\n\nLast night it was Kush and Ciroc: I was super geeked\nCash flowing, money flowing, yeah that's a super week\nGot em for the 26.5, now that's super-cheap\nCan't you niggas tell? I'm just looking for a super-freak\nSuper-freak, super-freak, yeah you know I want a\nSuper-freak, super-freak, yeah you know I need a\nSuper-freak, super-freak, yeah you know I want a\nSuper-freak, super-freak, yeah you know I need a\n\nShe with me if I'm wrong or I'm right, yea she my type\nBaby girl go and get the bread, you know what I like\nMeet her at my low-key apartment, never at the house\nEvery time we got pulled over, never ran her mouth\nFuck with real niggas, get money baby, on the chain\nLong as baby stay getting money, how can I complain?\nFavorite girl, guess she got the skills just to pay the bills\nLast nigga she was fucking with was worth a couple mil\nEven when she going for the low, says she's not a ho\nYeah you know that thing is super-wet, talking sloppy joe\nSaid she like it when I whip it fast then I whip it slow\nEven though she got a lot of names, I just call her \"blow\"",
 "image": "https://images.genius.com/08e2d06088a8af47e984f3e82bb14cef.1000x1000x1.jpg"
}