{
 "title": "Best Night of My Life",
 "album": "Best Night of My Life",
 "year": "2010-12-21",
 "lyrics": "I’m feeling good, I’m having fun\nThis is the best night of my life\nGirl can I be real?\nI just wanna feel on your booty, that''s not a big deal\nShawty you drinkin on that Martini\nI wanna see you in a bikini\nOr better yet a thong, baby what’s wrong?\nTryna tell you girl its the purpose of this song\nOoh, I want you closer\nYou look like a model of a poster\nI wanna get ya to the car, to the crib, up the stairs, to the bed\nIn the morning you’ll be cooking us set\nOooh baby, I love the smell of your perfume\nAnd if we were kids I’d be breaking curfew\nTo stay up with you\n\nYou gon need a scarf, wrap your head cause it’s gon get wild\nIf we keep lovin’ like this, we might make a child\nA daughter, a son, whichever one\nGirl your second to none\n\nI’m feeling good, I’m having fun\nThis is the best night of my life\nWith off that Patron and both of us gone\nGirl this could be the best night of my life\nYou could been anywhere in the world\nBut you’re right here with me girl\nAnd if we go home and make love\nThis could be the best night of your life\n\nSo girl let me ask you a question while we’re sipping bud\nAre you going home with me after the club?\nThats a yes or a no, I’m just letting ya know\nWhere this night can go\nAnd girl I’m hoping you see things my way\nCause I just want your love to stay\nTonight, tonight\nTonight, night, night, night\n\nI could be your bartender, tell me what you’re sippin’ on\nGirl, I’m not a travel agent so what you trippin’ on\nYou say I think I could make it happen cause I’m famous\nNah, I’m just tryna get it cracking cause we faded\nGet you to my crib, spend some time alone\nBarely over 21, that mean you kinda grown\nUmmm, and I’m tat, tat, tatted up\nCome on to that bread, I’mma stack it up\nWhere you going? Baby girl back it up\n\nYou gon need a scarf, wrap your head cause it’s gon get wild\nIf we keep lovin’ like this, we might make a child\nA daughter, a son, whichever one\nGirl your second to none\n\nI’m feeling good, I’m having fun\nThis is the best night of my life\nWe off the Patron and both of us grown\nGirl this could be the best night of my life\nYou could been anywhere in the World\nBut you’re right here with me girl\nAnd if we go home and make love\nGirl this could be the best night of your life",
 "image": "https://images.genius.com/a2ae183f76917f5f3198250564ba63ff.600x600x1.jpg"
}