{
 "title": "Bring It Back",
 "album": "Edgewood",
 "year": "2017-12-07",
 "lyrics": "Let do it\nMoney man\nGo get your money man, go get that\nGo for that shit now, go get your money man\nMike Will Made-it, bitch\n\nOunces in my mothafuckin' pantry (Aha)\nDiamonds on a young nigga, dancin', yeah\nJust dropped some bandos on some glasses, yeah\nJust dropped your bitch off, man, that hoe so nasty\nHuh, all about that paper, can't miss a beat, yeah\nI'ma get some cho-cho, one thing 'bout me, yeah\nGossip all that hoe shit, miss me with that (Yeah)\nI could put you frontline, just bring it back\n\nBring it back, bring it back, yeah\nBring it back, bring it back, bring it back, yeah\nDon't wanna have to chase you down 'bout them stack\n'Cause I will blow ya back, bring it back, this ho here throw it back\n\nYeah, tryna show me that she 'bout it\n'Bout it, 'bout it, yeah, shawty 'bout it, 'bout it, yeah\nTake the charges prolly, shawty say she 'bout it\nI gotta come for you, you shot at my lil' partner dem\nThe loud wild off the gate, don't need your molly\nAs a git, I used to get the candy from Mr. Charlie (Mr. Charlie)\nNowadays I ride a foreign by Mr. Charlie (Mr. Charlie)\nI got the candy now, sorry Mr. Charlie\n (Mr. Charlie)\nAye, she say you so mothafuckin' hood\nBut you ain't no mothafuckin' good\nMight be right, gift and a curse, I take it all as blessin'\nKnow you fuckin' with a real one though, no question (No doubt)\nPartna you gon' get spent doin' all that flexin'\nSo many of us shootin' you straight, ain't no pressure (Oh yeah)\nHatin' on that man won't do you no blessin' (I swear)\nTryna teach a young nigga flexin'\nWanna go to war, but you ain't got no money (No money)\nWorry 'bout these hoes and you ain't got no money (No money)\nMike Will Made-It (Will Made-It)\nBig Trouble, baby (Big Trouble, baby)\n\nOunces in my mothafuckin' pantry (Yeah)\nDiamonds on a young nigga, dancin', yeah\nJust dropped some bandos on some glasses, yeah\nJust dropped your bitch off, man, that hoe so nasty\nHuh, all about that paper, can't miss a beat, yeah\nI'ma get some cho-cho, one thing 'bout me, yeah\nGossip all that hoe shit, miss me with that, yeah\nI could put you frontline, just bring it back\n\nBring it back (What), bring it back, yeah\nBring it back, bring it back (Sure), bring it back, yeah\nDon't wanna have to chase you down (I swear) 'bout them stack\n'Cause I will blow ya back, bring it back, it's on here, throw it back, damn\n[Verse 2: Drake & \nTrouble\n]\nYeah, I don't play no games boy, I'm at your head (\nAt your head\n)\nAll about the family, niggas took the pledge (\nTook that shit\n)\nNow you gotta own up to that shit you said\nYou can't push us to the edge, Trouble from the edge\nHit the gas and we outta there\nDo it for the six, because we started there (\nStarted\n)\nI got a girl that used to ride around with 'Pac an' them (\n'Pac\n)\nI gotta get it, you came from my lil' partner then (\nFuck\n)\nYeah, Richard Mille, heavy on the watch (\nBitch\n)\nExtra million just to see the Maybach drop (\nDrop, drop\n)\nCrest white smile on my face\nOnce I get to snappin' ain't nobody safe (\nNobody\n)\nReality gon' hit ya or we gon' hit ya\nEither way if they was with ya, they goin' with ya\nMike WiLL Made-It (\nMike WiLL\n)\nMe and Big Trouble baby (\nDTE\n)\n\nOunces in my mothafuckin' pantry (Yeah)\nDiamonds on a young nigga, dancin', yeah\nJust dropped some bandos on some glasses, yeah\nJust dropped your bitch off, man, that hoe so nasty\nHuh, all about that paper, can't miss a beat, yeah\nI'ma get some cho-cho, one thing 'bout me, yeah\nGossip all that hoe shit, miss me with that, yeah\nI could put you frontline, just bring it back\n\nBring it back, bring it back, yeah\nBring it back, bring it back, bring it back, yeah\nDon't wanna have to chase you down 'bout them stack\n'Cause I will blow ya back, bring it back, it's on here, throw it back",
 "image": "https://images.genius.com/d7b67e3cbd4ac6d13bc124f19278c75e.1000x1000x1.jpg"
}