{
 "title": "Down on Me",
 "album": "All About You (Deluxe Edition)",
 "year": "2010-09-28",
 "lyrics": "She want it, I can tell she want it\nWant me to push up on it 'fore she know when I'm all on it\nWe get the party goin', liquor flowin', this is fire\n50 and Jeremih number one, there's nothing higher (Oh!)\n(Won't you go and) Get it, get it, work it, work it (I see you baby)\nBreak it, break it, down, down (Just put it down on me)\n(Won't you go and) Get it, get it, work it, work it (Put it down on)\nBreak it, break it, down\n\nOkay, she headed to the dance floor and she slowly start to poppin' it\nSomethin' like my wrist piece, everybody got to watchin it\nGirl you got that secret treasure, I'm gon' put a lock on it\nDon't care what they say, I would be stupid to be not on it\nMs. Vicky, heard you got that sticky\nLet's go and take nine shots, we'll just call it 50\nAnd I'm gonna licky licky licky 'til her hicky\nHa-ha-have her river runnin', keep you gunnin' 'til you empty\n(Bang bang bang bang) Oh, you look so sweet\nWhat you work at Bally's? Look at your physique\nGirl you are a beauty, well-well I am a beast\nThey must have been trippin' to have let me off a leash\n\nI like the way you grind with that booty on me\nShorty you a dime, why you lookin' lonely?\nGo buy another round and it's all on me\nAs long as I'm around, put it down on me\nJust put it down on me, put it down on me\nDown-down on me, put it down on me\nDon't throw it off the mound, show me how it's 'gon be\nGirl all I really want is you down on me (Put it down on me)\n\nSystem’s thumpin', party jumpin', shorty, she’s a perfect ten\nShe rock her hips then roll her hips then drop it down like it’s nothin\nShe shaped just like an hourglass, see how fast an hour passed\nTime flies when I’m on that ass but I won’t put your shit on blast\nWork it like a pro-pro-pro, sit and watch it go-go-go\nDo her thing all on the flo', she bounce it fast and shake it slow\nSo sexual, incredible, she beautiful, she edible\nI got her, I won’t let her go, I ain’t seen nothing better yo (Yeah)\nLook at how she twerk it, the way she work it\nMake me wanna hit it, hit it, heaven when I’m in it, in it (Oh, oh, yeah)\nIf I do not fit, I’m gonna make it\nGirl you can take it, don’t stop, get it, get it\n\nI like the way you grind with that booty on me\nShorty you a dime, why you lookin' lonely?\nGo buy another round and it's all on me\nAs long as I'm around, put it down on me\nJust put it down on me, put it down on me\nDown-down on me, put it down on me\nDon't throw it off the mound, show me how it's 'gon be\nGirl all I really want is you down on me (Put it down on me)\n\nSay you independent (Hey) get it from your momma (Hey)\nTell me if you with it (What?) do you really wanna? (Wanna)\nBaby when you see me (Yeah) you know I be on it (Yeah)\nCan you keep it up and (Up and) put it down up on me?\nSay you independent, get it from your momma\nTell me if you with it, do you really wanna?\nBaby when you see me, you know I be on it\nCan you keep it up and, put it down up on me?\nDown with that booty on me (On me)\nShorty you a dime, why you lookin' lonely?\nOh baby, we can go (Go) low (Low)\nLow, yeah\n\nI like the way you grind with that booty on me\nShorty you a dime, why you lookin' lonely?\nGo buy another round and it's all on me\nAs long as I'm around, put it down on me\nJust put it down on me, put it down on me\nDown-down on me, put it down on me\nDon't throw it off the mound, show me how it's 'gon be\nGirl all I really want is you down on me (Put it down on me)",
 "image": "https://images.genius.com/786576116814db69df3b9f6ab371ffeb.600x600x1.png"
}