{
 "title": "Fall for Your Type",
 "album": "Best Night of My Life",
 "year": "2010-11-12",
 "lyrics": "Can I, can I, save you from you?\nCause you know there's somethin' missin'\nAnd the champagne that you been sippin'\nNot supposed to make you different all the time\nStarting to feel, like the wrong thing to do girl\nCause with all that recognition, it gets hard for you to listen\nTo the things that I'mma say to make you mine\nBut live girl, have some fun girl, we'll be fine\nTrying to convince myself I've found one\nMaking the mistake I never learned from\n\nI swear I, al-ways, fall, for your type\nYeah, for your type\nTell me why I, al-ways, fall, for your type?\nFor your type\n\nI just can't explain this shit at all\nFall for your type\nI just can't explain this shit at all\nFall for your type\nI believe in people like you\n\nSo who am I to judge you on the past girl?\nI bet there's a reason for it all\nYou say that you're nothin' like the last girl\nI just pray that you don't let me\nDown right now, it's too late\nI'm already yours\nYou just gotta promise me, hearts won't break\nAnd end up like before\n\nI swear I, al-ways, fall, for your type\nYeah, for your type\nTell me why I, al-ways, fall, for your type?\nFor your type\n\nUh, yeah, uh, look\nDress hangin' off your shoulder, barely sober\nTellin' me how you movin' away and startin' over\nGirl quit playin' you just drunk, you just sayin' shit\nAnd oh you dance? Dance like how? Like ballet and shit?\nOh, wait, no I get it girl, I'm wit it\nI've been down this road before and yeah I skidded but forget it\nDamn, damn, I wonder why I never learned my lesson\nIt's feeling like ya second chance and it's the first impression\nAnd I heard there's nothin' new except for someone new\nBut how you s'posed to find the one when anyone'll come with you?\nTalkin' to myself but I never listened\nCause man it's been a while and I swear that this one's different\nThat's why I'ma take you anyway you wanna go, let you meet my friends\nSo they can lecture me again about how reckless I have been\nAnd I'm slowly runnin' out of all the time that I invested\nMakin' all the same mistakes and I'm just tryin' to correct it\nAnd I fall\n\nI swear I, al-ways, fall, for your type\nYeah, for your type\nTell me why I, al-ways, fall, for your type?\nFor your type\n\nI just can't explain this shit at all\nFall for your type\nI just can't explain this shit at all\nFall for your type\nI believe in people like you",
 "image": "https://images.genius.com/92a09f2678bd2647f3bcd611d6383054.350x350x1.jpg"
}