{
 "title": "Fly Together",
 "album": "Bad Boy: The Preview",
 "year": "2011-09-13",
 "lyrics": "Whatelse!\n\nSo when I fly, you fly, we fly together\nAnd when I shine, you shine we shine forever\nShakedown yeah\n\nI'm a boss so I need a boss chick\nAnd we can boss up like the bosses\nAll about green like Paul Pierce\nMayweather flow, look, zero losses\nDime in the day, diamond at night\nFive star chick 'bout that five star life\nI must admit I'm a fan\nYour shoe game ruthless, girl, god damn\nBeen a few years you're my number 1\nBlood in my veins, breath in my lungs\nWe the ones winning so they want toast\nWe a item, blend like Rum Coke\nLove the way you're doing it, keep doing it now\nFly like a jet blue stewardess\nYou can fly alone but I don't advise it\nI'm inviting you to fly with the pilot\n\nSo when I fly you fly we fly together\nAnd when I shine you shine we shine forever baby\nSo when I fly you fly we fly together\nAnd when I shine you shine we shine forever oh yeah\n\nShe wanna hit me on the iChat\nOn the iPad, flying in the sky caps\nShawty got a nice job but works too hard\nPut that shit... now welcome to the mall\nI need my women mogul, I make the picture mogul\nDouble MG is global , still ride or role for dolo\nI ain't rocking no polo but I'm...\nHer heart beating so fast cause I'm taking my time\nYeah I get it and lick it, I just handle my business\nSchool of the VS1's, national or not difference\nAnd my Bentley just dippin', I keep her by my side\nMy life a runway, and it's time to fly\n\nSo when I fly you fly we fly together\nAnd when I shine you shine we shine forever baby\nSo when I fly you fly we fly together\nAnd when I shine you shine we shine forever oh yeah\n\nYeah! Yeah! I’m a boss so I need a boss chick (HA!)\nAnd we could play house in my fortress (HUH!)\nFeet kicked up corner office (Yeah!)\nRoyalty princess in my crosses\nShe wanna tear the mall down well I let her do\nHear go my credit cards (Yep!) And the debit too (Yep!)\nI like your attitude (Ha!) Guess I’m supposed to\nSee you on Facebook (What’s up?) So I poked you (What Else?!)\nHA! Biggest couple on campus\nStylin on ‘em all ever since prom dances (Damn!)\nMe and my boo, you know how I do\nToss keys to valet on arrival\nHA! We in here like a hostage\nYour my better half in that full length Ostrich\nAny time you fall through it’s a blood bath\nSwag killin’ them hoes now leave your autograph\n\nSo when I fly you fly we fly together\nAnd when I shine you shine we shine forever baby\nSo when I fly you fly we fly together\nAnd when I shine you shine we shine forever oh yeah\n\nThere, ain't, no, stoppin, by your side I will fly\nLet's, go, house, shoppin, and the one you like I will buy\nI'll, be, your, superhero, you'll be my Wonder Woman baby!\nLet's fly together, oh my!!!!!\n\nSo when I fly, you fly, we fly together\nAnd when I shine, you shine, we shine forever, baby\nSo when I fly, you fly, we fly together\nAnd when I shine, you shine, we shine forever\nOh Yeah!!!\n\nI care for how we leavin, until the sky we reachin\nWe can f-fly together baby\nWe'll fly, we'll fly togther baby\nI care for how we leavin, until the sky we reachin\nWe can f-fly together baby\nWe'll fly, we'll fly togther baby\n\nYou are now flyin with the best!\nIf not me then who?\nYour address is now cloud nine\nBelieve that!",
 "image": "https://images.genius.com/ef48914a5177700eb7f03193462ca2c8.475x475x1.jpg"
}