{
 "title": "Ima Boss",
 "album": "Dreamchasers",
 "year": "2011-05-17",
 "lyrics": "Woo! Woo!\nM-M-Maybach Music\n\nLook, I be ridin' through my old hood, but I'm in my new whip (Yes sir)\nSame old attitude, but I'm on that new shit (Yeah)\nThey say they gon' rob me, see me, never do shit (Never)\n'Cause they know that's the reason they gon' end up on a news clip (Murder)\nAudemar on my wrist, bust down (Bling)\nWe poppin' bottles like I scored the winnin' touchdown (Score)\n'Member me dead broke? (Broke) Look at me up now (Up)\nI run my city from South Philly back to Uptown\nThank God, all these bottles I popped\nAll this paper I been gettin', all these models I popped\nI done sold a hundred thousand 'fore my album got dropped\nAnd I'm only 23, I'm the shit, now, look at me\nLook at me, I'm a boss like my nigga Rozay\nShorty asked me for a check, I told that bitch like, no way (No way)\n'Cause I made it from the bottom, it was never no way\nAnd I never had a job, you know I had to sell yay\nBitch, I'm a boss (I'm a boss), I call the shots (Call the shots)\nI'm with the murder team (Murder team), call the cops (Call the cops)\nWe in the building (We in the building), y'all are not (Y'all are not)\nYou short on the paper, you gon' ball or not?\n\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nI plan the shots (Huh!), I call the calls (Huh!)\nWe in this bitch, it's goin' down\nYeah I'm the king, now where my muhfuckin' crown? (Huh!)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nI plan the shots (Huh!), I call the calls (Yeah)\nHey!\n\nGot so many shades, they thought I had a lazy eye (Huh)\nShorty rode me smooth as my Mercedes ride (Huh)\nNo love, cry when only babies die\nAnd when I go, that casket better cost a hundred thou'\nI pray to God I look my killer in his eyes\nSnatch his soul out his shirt, let's take him for that ride (For that ride)\nOG is one who standin' on his own feet\nA boss is one who guarantee we gon' eat (Huh)\nFuck a blog, dawg, 'cause one day we gon' meet (Gon' meet)\nI'ma spaz on yo ass like I'm Monique\nOr a double stack, bet a nigga double that\nJerry Jones money, nigga, you a running back (You a running back)\nHerschel Walker (What?), Bo Jack (Hah)\nRicky Watters, better run that dope back (Dope back)\nBoss, and I put that on my Maybach (Maybach)\nFour hundred thou', bitch, you wish you saved that\n\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nI plan the shots (Huh!), I call the calls (Huh!)\nWe in this bitch, it's goin' down\nYeah I'm the king, now where my muhfuckin' crown? (Huh!)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nI plan the shots (Huh!), I call the calls (Yeah)\nHey!\n\nCouple cars I don't never drive, bikes I don't never ride (Nah)\nCrib I ain't never been (No), pool I don't never swim (Never)\nFool, you ain't better than (Nah), I move like the president (Yeah)\nErry'thang black-on-black, you know I be strappin' that\nRattin' ass niggas walkin' 'round wearin' wires\nFuckin' up the game, got the hood on fire (It's hot)\nBitch I'm a king (King), call me sire\nIf you say I don't run my city, you a muh'fuckin liar\nI'm a boss, you a fraud\nYou cross the line, I get you murdered for a cost (Murder)\nOut in Vegas (Out in Vegas), I took a loss (Took a loss)\nAt the fight we watchin' Floyd, we on the floor (We on the floor)\nYeah, scared money don't make no money\nIf I ever go broke, I'ma take yo money\nI ain't never dropped a dime, you ain't take none from me\nIn the hood err'day, bitch, I'm good, what I say?\n\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nI plan the shots (Huh!), I call the calls (Huh!)\nWe in this bitch, it's goin' down\nYeah I'm the king, now where my muhfuckin' crown? (Huh!)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nBitch, I'm a boss! (I'm a boss) Bitch, I'm a boss! (I'm a boss)\nI plan the shots (Huh!), I call the calls (Yeah)\nHey!\n\nM-M-Maybach Music",
 "image": "https://images.genius.com/e4dcae6de81e3533aff5e2153538dada.316x316x1.jpg"
}