{
 "title": "Life Of The Party",
 "album": "All My Heroes Are Dead",
 "year": "2020-04-17",
 "lyrics": "Yeah baby, it's Phil Cassesse; we're back live on Night Talk\nTalking about dirtbag derelict R.A The Rugged Man\nFor the love of God somebody put a stop to this guy!\n\nFast cash, filthy nights\nThe grimy, grungy ways\nBlowjobs and startin' fights\nThem dirty, crusty days\nIt's all good in paradise\nAwoo woo woo woo!\n\nI was born to be the best to flow ever\nI knew it before I hit puberty \nback when I was bumpin' Go Stetsa\nI was hateful, I'd punch you in the face for sayin' hi to me\nBut today I try to chill out and not react so violently\nPeople ask is it possible to be positive when most your life you was the opposite, could a negative pessimist be an optimist\nKnown for being fat, being crazy and always cursin'\nThat was just my reputation, I was even worse in person\nRobbin' schemin' and scammin' and rootin' and tootin' and shootin'\nPeace to me was an illusion, beefin' was my only solution\nI was banned from performing at mad places\nI was known for leavin' them bleedin'\nAnd breaking bottles on fans' faces\nSelf-depracatin' unsavory, I needed medication majorly\nI was sinkin' in moral degradation and depravity\nAddicted to hookers I was an animal wreckin' shit\nThe amount of pussy I paid for I could have probably fixed the national deficit\nI was fist fightin' fans in mosh pits\nBusy beating people unconscious with speakers\nInstead of makin' pop hits\nMy life!\n\nFast cash, filthy nights\nThe grimy, grungy ways\nBlowjobs and startin' fights\nThem dirty, crusty days\nIt's all good in paradise\nAwoo woo woo woo!\nOver and over the party stay jumpin'\nOver and over the party stay jumpin'\nOver and over the party stay jumpin'\nHands up!\n\nYo\nI make game changin' recordings, never took precautions\nI lost all of my endorsements, always beefin' with law enforcements\nGun totin' grenade holdin', fights that I'm in I'm winnin' them\nBut I'm getting older\nI'm tryin' to keep the ignorance to the minimum\nI still smack up any fan that act up\nBut I don't put them in a hospital\nI just get 'em to behave and back up\nI used to urinate on women now I take 'em to dinners\nDon't mean to disappoint most of my degenerate listeners\nUsed to be in whore houses beggin' for freebies\nBumpin' the Beasties in my \ntighty whitey BVD's\n, throwin' feces\nFans are like \"what did Rugged man go soft?\nWhat they got him pumped up on Prozac or Zoloft?\"\nYeah, I'm mad negative, you want positivity\nNow I'm doing conscious records with Talib Kweli\nMy belly full of hunger, my heart full of hatred\nIt was hard to take it, I could barely make it, hard to escape it\nI had to get my head off of that hate shit\nAlways wanted to go ape shit and break shit\nGettin' groupies and strippers naked that's the life I created\nThe party!\n\nFast cash, filthy nights\nThe grimy, grungy ways\nBlowjobs and startin' fights\nThem dirty, crusty days\nIt's all good in paradise\nAwoo woo woo woo!\nOver and over the party stay jumpin'\nOver and over the party stay jumpin'\nOver and over the party stay jumpin'\nHands up!\n\nI used to curse God, but now I rather say a prayer to him\nMy life was a modern Sodom Gomorrah, livin' in ruin\nOur hearts was ice cold, never thought that we would open ours\nRollin' with coked up stock brokers with broken cigars\nRollin' in stolen cars, we was Hip-Hop's brokest stars\nRoad rage, break your windshield with bats and crowbars\nWe had specially built treadmills for training the pitbulls\nI have 13 knives and four pistols, quick to hit fools\nNow I shake hands sign autographs, I'm friendly\nI used to hate fans, everyone to me was my enemy\nNow when I'm out with some fine females\nI might head to a fancy french restaurant sip wine and eat snails\nUsed to smack chicks in the face with my dick\nAnd make the whore spread\nNow I tuck my girl into bed and kiss her on the forehead\nI'm a chill dude now, at least I try to be\nI calmed down, but don't try me\nThat ignorant kid he's still livin' inside of me\nThe party!\n\nFast cash, filthy nights\nThe grimy, grungy ways\nBlowjobs and startin' fights\nThem dirty, crusty days\nIt's all good in paradise\nAwoo woo woo woo!\nOver and over the party stay jumpin'\nOver and over the party stay jumpin'\nOver and over the party stay jumpin'\nHands up!",
 "image": "https://images.genius.com/a0253fd2371df29715005a4977059770.1000x1000x1.jpg"
}