{
 "title": "My Girl",
 "album": "#1 Girl",
 "year": "2010-08-24",
 "lyrics": "Dang, we text each other a lot\n\nHey, my girl, my girl, she loves me\nShe hit me all the time, she be texting me\nHey, my girl, my girl, she loves me\nShe hit me all the time\n\nYo Prod', let 'em know\n\nWhen I say hey, then you say what's up?\nAnd I'll be like baby, do you miss me?\nWhen you say yes, then I'll say ditto\nThen you hit me back, with the less than symbol number three\n\nI got a clue how you feel for me\n1-4-3 a smiley with a wink\nThat's how you feel baby that's what's up\nA hundred forty characters, is more than enough\n\nHey, my girl, my girl, she loves me\nI know I'm on her mind even when we don't speak\nSay, my girl, my girl, she loves me\nShe hit me all the time my phone be ringing off the hook like, yeaahhh\nShe hit me all the time my phone be ringing off the hook like, yeaahhh\nShe hit me all the time - She text me all the time\n\nWhen you say yo, then I'll say hey love\nYou hit me with a sad face, what I do?\nI hit you with a question mark\nYou send me back a J slash K, said I'm just playing with you\n\nI got a clue how you feel for me\n1-4-3 a smiley with a wink\nThat's how you feel baby thats what's up\nA hundred forty characters is more than enough\n\nHey, my girl, my girl, she loves me\nI know I'm on her mind even when we don't speak\nSay, my girl, my girl, she loves me\nShe hit me all the time my phone be ringing off the hook like, yeaahhh\nShe hit me all the time my phone be ringing off the hook like, yeaahhh\nShe hit me all the time my phone be ringing off the hook like\n\nShe text me after school, she do it like it's homework\nUp in the salon, she do it like it's homework\nMy girl's in love, I think I'm in love\nI wonder what she texted now\n\nOh, oh, let me get it, Prod'\nMe and my girlfriend, we go out every weekend\nWe just two love-birds, that's why we're always tweeting\nI tell her all my secrets, she tell me all of hers\nWhen we get off the phone, she says, \"No you hang up first!\"\nMy girl is my universe, I am so in love with her\nAll the money in the world can't even compare to what my shawty's worth\nThey call me Double R, from Mindless Behavior\nOh, that's my girl calling, I'll holla at you later!\n\nHey, my girl, my girl, she loves me\nI know I'm on her mind even when we don't speak\nSay, my girl, my girl, she loves me\nShe hit me all the time my phone be ringing off the hook like, yeaahhh\nShe hit me all the time my phone be ringing off the hook like, yeaahhh\nShe hit me all the time my phone be ringing off the hook like\n\nDon't forget to text me girl, at (323)-319-6060\nThere's the number, MB y'all",
 "image": "https://images.genius.com/7c431c5eeacee5bec2c44b62d6aa0fa0.592x590x1.jpg"
}