{
 "title": "No Hands",
 "album": "Waka Flocka Myers 2",
 "year": "2010-08-17",
 "lyrics": "Listen to this track, bitch!\n\nGirl, the way you're moving got me in a trance (Yeah)\nDJ, turn me up, ladies, this your jam (Come on)\nI'ma sip Moscato, and you gon' lose them pants (Ooh)\nThen I'ma throw this money while you do it with no hands (L'eggo)\nGirl, drop it to the floor (Yeah)\nI love the way your booty go (Come on)\nAll I wanna do is sit back and watch you move\nWaka, Waka, Waka, Waka, Flocka, yeah!\nAnd I'll proceed to throw this cash (L'eggo)\n\nAll that ass, in your jeans\nCan Wale beat? Can Roscoe skeet?\nLong hair, she don't care, when she walk, she gets stares\nBrown-skin or a yellow bone, DJ, this my favorite song\nSo I'ma make it thunderstorm, flood warning, Flocka, yeah\nBlow it, fuck it, I don't care, Jacksons flying everywhere\nTap my partner Roscoe, like, \"Bruh, I'm drunk as hell, can't you tell?\nThrew me 70 bands, bet 50 stacks, oh fucking well\nI'm tryna hit the hotel with two girls that swallow me\nTake this dick while I swallow, Pink Moscato got her freaky\nHey, you got me in a trance (Damn), please take off your pants\nPussy pop on a handstand, you got me sweating\nPlease pass me a fan, damn\n\nGirl, the way you're moving got me in a trance (Yeah)\nDJ, turn me up, ladies, this your jam (Come on)\nI'ma sip Moscato, and you gon' lose them pants (Ooh)\nThen I'ma throw this money while you do it with no hands (L'eggo)\nGirl, drop it to the floor (Yeah)\nI love the way your booty go (Come on)\nAll I wanna do is sit back and watch you move (Ooh)\nAyy, ayy, Wale\nAnd I'll proceed to throw this cash (L'eggo)\nShe said, \"Look, ma, no hands\"\n\nShe said, \"Look, ma, no hands\", and no, darling, I don't dance\nAnd I'm with Roscoe, I'm with Waka, I think I deserve a chance\nI'm a bad motherfucker, go and ask then motherfuckers\nA young handsome motherfucker\nI sling that wood, I just Nunchuck them\nAnd who you with? And what's your name?\nAnd you not hip? Boo, I'm Wale\nAnd that D.C. shit, I rep all day\nAnd my eyes red cause of all that haze\nDon't blow my high, let me shine\nDrumma on the beat, let me take my time\nNigga want beef? We can take it outside\nFight for what broad? These hoes ain't mine\nIs you out your mind? You out your league\nI sweat no bitches, just sweat out weaves\nWear out tracks, let me do my thing\nI got sixteen for this Roscoe thing\nBut I'm almost done, let me get back to it\nWhole lotta loud and a lil' Backwood\nWhole lotta money, big tip, I would\nI put her on the train, little engine could, bitch\n\nGirl, the way you're moving got me in a trance (Yeah)\nDJ, turn me up, ladies, this your jam (Come on)\nI'ma sip Moscato, and you gon' lose them pants (Ooh)\nThen I'ma throw this money while you do it with no hands (L'eggo)\nGirl, drop it to the floor (Yeah)\nI love the way your booty go (Come on)\nAll I wanna do is sit back and watch you move (Ooh)\nAnd I'll proceed to throw this cash (Roscoe Dash, okay, l'eggo!)\n\nOK, R-O-S-C-O-E (O-E), Mr. Shawty-Put-It-On-Me (Please)\nI be going HAM (HAM), shawty upgrade from baloney (Please)\nThem niggas tipping good, girl, but I can make it flood (I can)\n'Cause I walk around with pockets (Pockets) that are bigger than my bus (Whoa)\n\"Rain, rain, go away\"—that's what all my haters say\nMy pockets stuck on overload (Whoa), my rain never evaporates (No)\nNo need to elaborate (Never), most of these ducks exaggerate (They do)\nBut I'ma get money, nigga, everyday stunting, nigga\nDucks might get a chance after me (Go)\nBitch, I'm balling like I'm coming off of free throws (Yes)\nJust ahead of the game, no cheat codes (No)\nLambo, Roscoe, no street code (Skrt!)\nAnd your booty got me lost like Nemo (Go)\nGo, go, go, g— go'n' and do your dance (Right now)\nAnd I'ma throw this money while you do it with no hands, go (I'm gone!)\n\nGirl, the way you're moving got me in a trance (Yeah)\nDJ, turn me up, ladies, this your jam (Come on)\nI'ma sip Moscato, and you gon' lose them pants (Ooh)\nThen I'ma throw this money while you do it with no hands (L'eggo)\nGirl, drop it to the floor (Yeah)\nI love the way your booty go (Come on)\nAll I wanna do is sit back and watch you move (Ooh)\nAnd I'll proceed to throw this cash (L'eggo!)",
 "image": "https://images.genius.com/3bcbea86d4b059632343d81fbffe5a18.1000x1000x1.png"
}