{
 "title": "That Way",
 "album": "Ambition",
 "year": "2011-11-01",
 "lyrics": "M-M-Maybach Music\n\nI apologize, I don’t recollect your name\n(Oh, baby, I don’t know your name)\nBut lemme tell you that them heels, really complement your frame\n(Look at your body, baby)\nGirl lemme get them \"ooh-ahhs\"\nThen I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl, how could we get that way?\nGirl, how could we get that way?\n\nLook, another day, another dollar\nShe hate me when I leave cause when I leave I never call her\nThat's life, shit, aight, shit, I could call you right quick\nBut if I call, you gon' be like, \"Boo, why we haven't skyped yet?\"\nAnd on Skype, bet you say, \"'Le, where my flight at?\"\nIf I decline then you inquire on where I spend my nights at\nShit this life gets overwhelming and more then hectic\nBut a woman worth some anger is certainly worth some effort\nJust look closer, my life is quite deceptive\nWomen'll sell they soul, just to buy some attention\nI need something to hold, fuck that passive aggression\nAnd when I'm back from off that road, don't ask me no questions\nPlease, fear what you don't know, haha\n\nI apologize, I don’t recollect your name\n(Oh, baby, I don’t know your name)\nBut lemme tell you that them heels, really complement your frame\n(Look at your body, baby)\nGirl lemme get them \"ooh-ahhs\"\nThen I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl, how could we get that way?\nGirl, how could we get that way?\n\nDon't remember how I met her, but I know I won't forget her\nAnd If loving her is wrong then I just know I won't see Heaven\nShe say she from Seattle,\n she 20 and some change\nBefore I get to T.I.A, I'm sure to make her rain\nThen I'm back up on my plane, Chi-town O'Hare\nWe spend some time and get some wine, have some milds from Harold's\nI told her this here's overrated, but I love your city baby\nGotta get back to the D, you know we finally famous\nDriver drop me off at Dulles, I'm headed to some money\nTSA be laughing, all them rubbers in your luggage\nI know I'ma always leave 'em, but I swear I'll always love 'em\nTell her you'll probably find someone but you'll never find another\nWale, oww!\n\nI apologize, I don’t recollect your name\n(Oh, baby, I don’t know your name)\nBut lemme tell you that them heels, really complement your frame\n(Look at your body, baby)\nGirl lemme get them \"ooh-ahhs\"\nThen I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl, how could we get that way?\nGirl, how could we get that way?\n\nGot on my suede shoes, I'm in a great mood\nAir baggage claim, awaiting miss thang out of St. Louis\nKnow she shining bright, got on my Cartier\nShe my Billie Jean, we menage with Mary Jane\nSee we city hop, Vegas to LA\nBrings a lot of joy, Bugatti boy, that's lane to lane\nOur faucets used to drip, I used to ride the bench\nBut it was written in cursive for this king to exist\nPacked her bags now she live amongst entrepreneurs\nMarc Jacob the makeup, she Givenchy consumer\nGianni Versaci connoisseur, a carnivore\nAccountable for a half a million uncounted for, boy\nHahahah (\nM-M-Maybach Music\n)\n\nI apologize, I don’t recollect your name\n(Oh, baby, I don’t know your name)\nBut lemme tell you that them heels, really complement your frame\n(Look at your body, baby)\nGirl lemme get them \"ooh-ahhs\"\nThen I gotta catch my plane\nSay ya miss me and ya wishing for some private time\nGirl, how could we get that way?\nGirl, how could we get that way?\n\nM-M-Maybach Music",
 "image": "https://images.genius.com/c8a525cd49b75dfcb54a6a70406c05fb.1000x1000x1.jpg"
}