{
 "title": "Tupac Back",
 "album": "MMG Presents: Self Made, Vol. 1",
 "year": "2011-05-23",
 "lyrics": "[Intro: 2Pac Shakur & \nRick Ross\n]\nI'm already convicted\nMy whole life has been turned around\nI lost every job, I lost everything, every opportunity I can get\nCan't get, buy cars, can't get rent, can't get none of that\nBut I'm still a survivor, y'know, I'm still coming to court\nStill smiling, still signing autographs, but soon I'ma go crazy!\nYou know what I'm sayin? And it's up to the world, y'know\nAmerica eats its babies, we, I'm\nNo matter what y'all think about me\nI'm still your child, you know what I'm sayin?\nYou can't just turn me off like that\nHuh! Huh! Huh!\nM-M-M-M-Maybach Music\n\n2Pac back, 2Pac back\nThat’s all these bitches screaming that 2Pac back\nAll eyes on me, better picture me rollin’\nBuying brand new rims, but them bitches is stolen\nStranded on Death Row\n, \nBrenda having my baby\nBut I’m stacking my paper, \nI need a brand new Mercedes\nThey screaming \"2Pac back, 2Pac back\"\nThat’s all these bitches screaming that 2Pac back\n\nUgh! 2Pac back, I’m two Glocks strapped\nRolling down in Philly, this the new Iraq (Philly!)\nSoon as I hit the the hood, they screaming, \"Who got whacked?\"\nIt’s a recession on the work, I’m screaming, \"Who got crack?\"\nI’m sipping Hennessy!\nRiding on my muh'fucking enemies!\nSliding in the back, I'm screaming, \"MMG!\" (\nMaybach Music\n)\n10 bitches and they dime so it’s Tennessee\nHail Mary, put my wrist on froze, presidential is gold\nA nigga play with my money, my shooters lifting his soul\nBloh! That kick like it's soccer, bullets hitting the goal\nBitch, I’m like John Wall, 'cause I just give 'em and go\nPlotting on this new 7, I can picture me rolling\nPockets look like they pregnant because them bitches is swollen\nGot a clip I can loan, all them snitches could hold 'em\nLook at them motherfucking wheels! Them bitches is stolen\nThey screamin'\n\n2Pac back, 2Pac back\nThat’s all these bitches screaming that 2Pac back\nAll eyes on me, better picture me rollin’\nBuying brand new rims, but them bitches is stolen\nStranded on Death Row,\n \nBrenda having my baby\nBut I’m stacking my paper, \nI need a brand new Mercedes\nThey screaming, \"2Pac back, 2Pac back\"\nThat’s all these bitches screaming that 2Pac back\n\nMommy a soldier\n, daddy is dead\nWe catch the nigga that did it then we gon’ carry his head\nFuck a 911, tell 'em have him a bed\nTalking Death Row records, tell em have me a chair\nLet it burn, \nI’m screaming: \"Free my nigga Hearn!\"\nHe’s due in, no hestitation, we can’t even get a turn\nGot my Makaveli CD then I listened than I learned\nGrabbed my Mac above the dresser, my OG said, \"Hold it firm\"\nI’m dreaming spitting with Pac (Pac!) and cyphers with B.I.G (B.I.G!)\nTried to send me upstate with the license and bid\nHad me scraping my wax, sleeping, my knife in the bed\nThey got a nigga on point like it's a price on my head\nI'm going max! Got me knocking suckers and they back\nIn these cells, raising hell, tryna get back to the trap\nBut don’t never get it twisted, it’s Meek Mill, we spittin’ facts (Meek Milly!)\nPlus somebody said they seen it and they mean it\nSo they steady screamin'\n\n2Pac back, 2Pac back\nThat’s all these bitches screaming that 2Pac back\nAll eyes on me, better picture me rollin’\nBuying brand new rims, but them bitches is stolen\nStranded on Death Row,\n \nBrenda having my baby\nBut I’m stacking my paper, \nI need a brand new Mercedes\nThey screaming \"2Pac back, 2Pac back\"\nThat’s all these bitches screaming that 2Pac back\n\nM-M-M-Maybach Music",
 "image": "https://images.genius.com/32181ba51dd7d9bc28affe373780c5f4.1000x1000x1.jpg"
}