{
 "title": "Unusual",
 "album": "Passion, Pain & Pleasure",
 "year": "2011-09-14",
 "lyrics": "Now I wouldn't be me if I ain't get a little nasty\nNa na-na na na na na na\nNa na-na na na na na na\nNa na-na na na na na na\nThey say all I talk about is sex\n\nHow 'bout we just move over and do it where we at\nHow 'bout you just lift that skirt up ooh, we can be bad\nThat place that ain’t been touched, I’m feeling on it\nI'll let you sit through, keep spinning on it, girl\nGiddy up, get it up, take me on a ride to ecstasy\nYou don’t wanna bump bump then take a nap\nYou just wanna bump bump bring right back\nWatch me\nI'ma heat it up, beat it up, oooh\n\nKnow you’re tired of the usual, usual, usual\nI can give you more than the usual\nNot your regular, tell you what, let me touch\nYou gon' feel something unusual, unusual, unusual\nI'm not coming with the usual\nNot your regular, tell you what, let me touch\nYou gon' feel something unusual\n\nI wanna do the freaky things you never do\nWhat if we get it while your friends was in the room?\nIs that too hot for ya?\nDon't you feel bad, let 'em feel sexy\nWe can make a sex room wherever we go\nTake it to the restroom, they ain’t gotta know no\nWatch me heat it up, beat it up, wo hey\nDo you hear me girl?\nWatch me heat it up, beat it up, wooh\n\nKnow you’re tired of the usual, usual, usual\nI can give you more than the usual\nNot your regular, tell you what, let me touch\nYou gon' feel something unusual, unusual, unusual\nI'm not coming with the usual\nNot your regular, tell you what, let me touch\nYou gon' feel something unusual\n\nRestaurant, check\nCinema, check\nOn the hood, check\nOf the car\nCounter top, check\nBalcony, check\nIn the jet, check\nOn the beach, leggo\n\nThis that other shit, you know you ask for it\nI might just send you some money to getcha passport\nSo you can come to me city, I’ll take you all over\nAnd hit you on the balcony, just don’t fall over\nSend me a picture baby, you know I’d never leak it\nI know you got somethin' recent, for someone decent\nWhy you laughing out loud? I’m serious\nBring your girl if you a little bi-curious\nPlease, please no storytellin' to others\nI promise you gon' love it, I would never let you down\nFeel like I might of perfected, all the things that you’ve expected\nAnd you gon' know it when you bring your ass around\nMotherfucker, oh\n\nKnow you’re tired of the usual, usual, usual\nI can give you more than the usual\nNot your regular, tell you what, let me touch\nYou gon' feel something unusual, unusual, unusual\nI'm not coming with the usual\nNot your regular, tell you what, let me touch\nYou gon' feel something unusual\n\nGet it all different kind of ways\nAll different places\nLook at the many love faces you making\nBut can you take it, oh",
 "image": "https://images.genius.com/dad612897143026b17069cacf27cf806.1000x1000x1.png"
}