{
 "title": "Words",
 "album": "No Complaints",
 "year": "2012-04-20",
 "lyrics": "Uh, I know I'm on motherfucker\n\nYeah, lemme stir up the pot\nTurn this here, into straight crack rock\nBoy you gotta be hot, or this shit gon' stay\nWon't boil to the top okay you gotta be stopped\n'Cause he spittin' that dope shit\nOh what you mean coke shit?\nNah I mean suicide, hang from the rope shit\nTalk a lot of bullshit but you don't know shit\nSomething is wrong, really is wrong\nWe reading Qurans, reading the Bible\nThink it's all oh so vital\nLike you gotta be our idols\nThen we stand idle\nWe don't make no moves\nBut we still make rivals\nAnd we so spiteful\nStill got tools,yea we still got rifles\nAnd they got bigger\nGo figure, got everybody hands on the trigger\nYou can say \"cracker\" but I can't say \"nigga\"\nSo we get in conflict when we both\nSip liquor\nAnd I don't understand what conflict is\n'Cause these are words and words ain't shit\nBut some thoughts from your head\nThat's into my ear we killing people from over ideas\n\nBoy these are just words\nThese are just words (x4)\n\nLet me stir up the pot\nTurn this here into straight crack rock\nBoy you gotta be hot, or this shit won't sell\nIs you planning to flop? Then you gotta be stopped\n'Cause he spitting the foods\nEvery killer gotta have a tool\nMan fuck a life lesson you ain't never go to school\nAnd you dropped out early 'cause you said it wasn't cool\nAnd these fools in college\nBut they got no degree, got no diploma\nAnd I smoke trees, way too much trees, yeah they call me a stoner\nAnd I got police smelling my aroma\nAin't nobody know me, said I was a loner\nAnd my ex-girlfriend called me a boner\nOr maybe it was a dick\nTruthfully I ain't even hear that bitch\nI was too busy in the backseat\nHad these hoes running through my head like a track meet\nWhy I call them hoes? Shit, 'cause I'm Caskey\nAnd I feel like any other woman I meet harass me\nThe good ones pass me\nSo no I ain't a nice guy\nTold a lie to me, nice try\nSo I had way too much ambition for these white guys\nSome will call them presidents\nI just call them white prime\nAll my own evidence, everybody wanna stay relevant\nAlways gotta fuck, nobody remain celibate\nAll about who white, who black, who was heaven sent\nWho the devil advocate? Well who the fuck intelligent?\n'Cause all I see is dumb ass ho shit\nThey say we all sinners, I say \"no shit\"\nMy momma been broke since like '06\nBut some name brand shit what I'ma go get\nAnd I don't understand what the name brand is\n'Cause these are words and words ain't shit\nBut some thoughts from your head\nThat's into my ear we judging people over ideas\n\n\nLet me stir up the pot\nTurn this here, from conversation into confrontation\nThe devil got some temptation\nThe sins hate us, sincere, in satan, the unsold should\nAnd the so called racists, the basis\nThe crackhouse, the black gals, the black guys\nThe tapouts, the white cops, the white lies, the nice stop\nThey all tie us to one plot, one eyes, one Glock\nSmall fire, I get one shot, and I take that click, pop\nEverybody get dropped or get got\nWhen you cop from a Ziploc when I'm outside at a pit stop\n'Cause I got eyes in the back of my head\nAnd we keeping that lead on us like a wrist watch\nCause these are violent words\nI seen a lot of motherfuckers who can find them words a lot worse\nIt's something we can not explain and wonder why we never want them saying\nI wonder why it's never ever subject to change\nEven if I explain exactly what's on my mind they see the slang\nAnd the never really see what's on my mind and where we at in this point and time\nWhy I be pointing nines\nAnd I don't understand what the whole thing is\nCause these are words and words ain't shit\nBut some thoughts from your head\nThat's into my ear we doing this over ideas",
 "image": "https://images.genius.com/fb8d89e757e4bda0b73bd12ec3865340.500x500x1.jpg"
}