{
 "title": "Certified",
 "album": "Beach Cruiser",
 "year": null,
 "lyrics": "Upfront...\nAkon and Glasses... uh huh\nKonvict Music... (G. Malone)\nAkon and Glasses... uh huh\n\nNiggas spit fairy tale, G issue the facts\nNot Jeezy but I sold my fair issue of crack\nNot Weezy but Malone got dat +Hustler Muzik+\nAnd them hustlers use it, serve customers to it\nWent from 2 to 300, got the Mexicans down\nHundred Crips, hundred Bloods, hundred Mexicans now\nHundred rounds in the clip, man who wanna get dumb?\nWith the New West Pres on these A-Town drums\nWith the New West Pres, daddy callin the plays\nAnd we sackin' wack rappers nigga, call it a day\nDown south call 'em choppers home, call it a K\nEither way ambulances come & haul 'em away\nThis Blu Division bitch, I'm the soul of the crew\nHoneygirls on my heels like the soul of my shoes\nGot Toomp in da kitchen, let it simmer and cook\nNow 'Kon break it on down & deliver the hook (Let's go~!!)\n\nI ain't for all that beefin'\nGot niggas to bust your head for no reason\nAsk around the streets man, I'm certified\nCross seas, all my customers are satisfied\nSee I ain't for all that beefin'\nMatter of fact, I'm trying to chill with the squeezin'\nAsk around the hood man, I'm certified\nAnd I'd hate to have to put a bullet in your mind\n\nGot the Bloods on my team, who gon' fuck with cuz?\nI'm heavy in the streets, nigga fuck the club\nMake G's bounce & wanna buck the snub\nTakin' down everything you spending bucks to plug\nI was just a little pissed I didn't sign with Jay\nA mil' plus couple months feelin' fine today\nMil plus couple blunts, they say he runnin' the hood\nAnd I'm laughin at you rap niggas runnin' from Suge\nTalk greasy on your records, stop pushin me ho\nFace to face, turn bitch, you lil' pussies expose\nYou a mark, I'm a G so when you pop ya check\nYou can buy any car but not the streets respect\nOne of few gangsta rappers that the streets respect\nPlaques & nothin' less is what the streets expect\nGot Toomp in da kitchen let it simmer and cook\nNow 'Kon break it on down & deliver the hook (Let's go~!!)\n\n\nWhat's up lil mama? What's up?\nWhat's up lil mama? What's up?\nWhat's up lil mama? What's up?\nYou won't find another nigga spittin' eastier shit\nI'm hot on the West, hot in the South\nFuck bars nigga, hot for puttin' Glocks in ya mouth\nFuck bars, it's the flow so easy & smooth\nCharismatic on the mic like Easy & Cube\nNo attitude, the fuck stoppin' the grind\nNo whitey in my mix, homie robbing me blind\nGo hyphy in this bitch only problem is time\nCause my Bentley watch broke but got the properest shine\nIn the base model 5 but the brabus in line\nOnce I made back ends, it's the Maybach Benz\nGot Toomp in da kitchen, let it simmer and cook\nNow 'Kon break it on down & deliver the hook (Let's go~!!)\n\n\nAkon and Glasses... uh huh\nKonvict Music...",
 "image": "https://images.genius.com/8068df640db389b165bb27148770b788.620x620x1.jpg"
}