{
 "title": "Energy",
 "album": "In a Perfect World...",
 "year": "2008-05-27",
 "lyrics": "Ooh-ooh\nUh-oh\nOh, yeah\n\nI wish I could rip out a page of my memory\n'Cause I put too much energy in him and me\nCan't wait 'til I get through this phase\n'Cause it's killing me\nToo bad we can't re-write our own history\n\nSuch a mystery when he's here with me\nIt's hard to believe I'm still lonely\nChances fading now, patience running out\nThis ain't how it's supposed to be\n\nI'm having nightmares from sleeping with the enemy (No...)\nHow do we reverse the chemistry? (Chemistry)\nI don't want us to be the end of me (Mmm, yeah)\nThis love is taking all of my energy (Energy)\nEnergy (Energy), my energy (Energy)\nTaking all of my energy (Energy)\nEnergy (Energy), my energy (Energy)\nTaking all of (My energy)\n\nSeems only like yesterday, not even gravity\nCould keep your feet off the ground when you were with me\nHow could two be as one?\nWe've become so divided now\nThere's no use hiding from the misery, no\n\nSuch a mystery when he's here with me\nIt's hard to believe I'm still lonely\nChances fading now, patience running out\nThis ain't how it's supposed to be\n\nI'm having nightmares from sleeping with the enemy (Oh oh oh, whoa)\nHow do we reverse the chemistry? (How do we?)\nI don't want us to be the end of me (Me, yeah)\nThis love is taking all of my energy (All of my energy)\nEnergy (Energy), energy (Energy), my energy (Energy)\nTaking all of my energy (Taking my energy)\nEnergy (Energy), energy (Energy), my energy (Energy, energy)\nTaking all of... (Whoa)\n\nNow I can feel a change in me (Change in me)\nAnd I can't afford to slip much further\nFrom the person I was meant to be, whoa, oh\nI'm not afraid to walk alone\nNot giving up, but moving on\nBefore it gets too deep\n'Cause you're taking all of my energy\n\nI'm having nightmares from sleeping with the enemy (Ooh)\nHow do we reverse the chemistry? (Ooh)\nI don't want us to be the end of me\nThis love is taking all of my energy (All my energy)\nI'm having nightmares from sleeping with the enemy (Oh, oh)\nHow do we reverse the chemistry? (Oh)\nI don't want us to be the end of me\nThis love is taking all of my energy (Energy)\nEnergy (Energy), energy (Energy), my energy (Energy, ooh)\nTaking all of my energy (Ooh)\nEnergy (Energy), energy (Energy), my energy (Taking all of me)\nTaking all of...\n\nYou're killing me\nYou're taking all of me, yeah\nOh-oh, oh-oh\nThis love is taking all of my energy",
 "image": "https://images.genius.com/ba2f99e1d874c6f9d56c6654c6e6b274.750x750x1.jpg"
}