{
 "title": "Get Silly",
 "album": "Beast",
 "year": "2008-02-14",
 "lyrics": "(Soulja Boy tell 'em!)\nThe dance floor silly, the ladies gon' feel me\nThe fellas in the back and they twistin up a Phillie\nGet silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\nGet silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\n[Chorus} * overlap\nThe dance floor silly, the ladies gon' feel me\nThe fellas in the back and they twistin up a Phillie\n* Get silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\nThe dance floor silly, the ladies gon' feel me\nThe fellas in the back and they twistin up a Phillie\n* Get silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\n\nMy chain too silly (okay) my wrists too silly (okay)\nThe girls throw me fish cause my rims Big Willie\nMy ride too silly (okay) I ride too silly (okay)\nWith four fantastic hoes cause I got a deal-ly\nCause now I'm worth a millie (okay) forget a rubberband\nCause you can't put a rubberband around a bill-ion\nI be wildin on a island somewhere just like Gilligan\nDrillin hoes like a dentist then then then I fill her in\nEy back back back, I'm the man girlfriend\nI'm the reason why you wanna lose your man girlfriend (HA HA~!)\nI'm calm like the sea (sea) I'm blowed like the wind (wind)\nAnd now that I'm straight I'm 'bout to act a fool again\nGet silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\nGet silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\n\n\nMy shades too silly cause they made by cavalli\nJays so excited you can't find 'em lil' buddy\nI'm not Nick Cannon but I'm \"Wild'n Out\" clubbin\nWatchin everybody jockin while I'm poppin sum'n bubbly\nPoppin sum'n bubbly, I'm tryin to do it big!\nDa boy from the A, I'm tryin to represent!\nDem haters in my way, I play this game to win!\nWatch me take it to the ally knock 'em all off like some pins\nWhen I drop drop drop I'mma sell like silly\nCause everybody dancin and everybody feel me\nWith stacks in my jeans just like my name was billy\nWhile I'm jockin on you haters just like I pop a wheelie\nGet silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\nGet silly (HEY) get silly (HEY) get silly (HEY) get silly (HEY)\n\n\nThat's all y'all got! (That's all they got)\nY'all ain't even fightin back man\nFirst Hurricane, then Soulja Boy\nThen the African prince of Collipark, V.I.C. yup!\n\n\nIt's all over homey, Collipark homey\nSoulja Boy! You snapped on the beat\nYou and Package Store snapped on the beat boy!\nI'm tired of slappin these punks around\nThey bore me, ha ha\nYo yo yo",
 "image": "https://images.genius.com/2cc1556ff9af9abd15042abef953be34.1000x1000x1.jpg"
}