{
 "title": "Marco Polo",
 "album": "New Jack City II",
 "year": "2008-08-04",
 "lyrics": " + (Bow Wow)\nSoulja Boy Tell 'Em\n(And da boy Bow Wow in da building)\nMy swag too official man\n(Ay, Soulja my swag too) y'all can't catch up\n(Ayo, Bow let em' know how you lookin though)\n(OWWW~!)\n\nNew G Shock (check), yellow Lamborghini (Bow)\nBC shirt with a fresh pair of jeans (Wow)\nBlack cards, spendin' when I hit the mall (stuntin'!)\nCan't catch me, I'm so ahead of y'all\nMarco Polo {*4X*}\nMarco Polo {*8X*}\n\n(Get 'em Bow!)\nAy, took my car to the mall, then I blacked out\nNow my closet's full of J's like a crack house\nCeiling so high! You would think it was Shaq's house\nWhip so big, that it beep when I back out\nLike (BEEP, BEEP) ayo, tell that nigga move\nIt's Bow weezy, Mr. Get 'em wetter than a pool\nI step up in the room, bunch of ice where my chain be\nAll the bad bitches just be screaming like they angry\nSome call me cocky, but how could ya blame me?\nAnd all the hoes like me because my money lengthy!\n(Yeahhhh) and I'm still the first to rock\n(Yeahhhh) first to put ice in a G Shock; she like my...\n\n\nNever been fake cause all the girls love official\nS.O.D. cause girls love initials!\nI'm on another level, I'm in my zone\nBlack car, white rims - can they both get along?\nThis is not The Matrix, but I am the oracle\nDo you wanna get with me? The question is rhetoricle\nSay the same lines but the fans aren't bored of me\n75,000 dollars if you want to order me\nHold on!! Let me change my swag\nMy flow broadband, y'all boys still LAN\nMy whole clique straight, y'all whole click fags\nLast night your girl's forehead was on my abs\n\nGucci Bandana (check), Louie V leather\nKeep on looking, there's no one better\nAir force ones, mix with the new J's (check)\nCan't catch me, I'm too far away!\nMarco Polo {*4X*}\nMarco Polo {*8X*}\n\nBow makes the girls go crazy - they wanna be my lady\nHow many can I fit in my 2-seater Mercedes?\nLime green lambo, no roof, that's a drop top\nStop they hating, cause they girlfriend's on my jock\nI let her lick the rapper, let her lick the actor\nThe next Will Smith and be ballin' like the Raptors\nIf you don't want no drama in the club then don't act up!\nHow can I run out? My money's longer than a tour bus!\n\n\nAy hit me on my celluar now (ay)\nCall me on my celluar now\n614-360-1668, 614-360-1668\nAy call me on my celluar now, Bow Wow\nI say call me on my celluar now",
 "image": "https://images.genius.com/34c2538ac7e17ddded8f995339818677.640x640x1.jpg"
}