{
 "title": "So Fly",
 "album": "Love’s Crazy",
 "year": "2008-06-10",
 "lyrics": " (Slim)\nHey! I'm on my daily baby!\nWhat! What! I know you love me baby\n(I'm so fly, I'm so fly) Yeah Slim, Yung J-O-C\n(I'm so high, Im so fly, I'm so high)\n\nJust stepped out, fresh out the shower\nGotta stay fresh, take about an hour\nGotta get dressed, your boy so clean\nBoth of them on, I got the blue jeans\nFresh pair of shades, ice on my wrist\nSocks to the draws, your boy stay fit\nI'm ready (I'm ready) Can't nobody tell me nothin\n\nI'm so fly (I'm so fly) Feels like I'm takin off\nI'm so high (I'm so high) Lookin for a shorty to break me off\nI'm so fly (I'm so fly) Feels like I'm takin off\nI'm so high (I'm so high) Lookin for a shorty to break me off\nI'm so fly\n\nStop by Q's, pick my toy\nTop drop down let the haters hear the noise\nHit that pad and turn that wheel\nPush that rim make it all disappear\nPhone is ringin hit the bluetooth\nCall me on the phone like hey what it do?\nI'm comin (I'm comin) And we gonna take this over\n\nI'm so fly (I'm so fly) Feels like I'm takin off\nI'm so high (I'm so high) Lookin for a shorty to break me off\nI'm so fly (I'm so fly) Feels like I'm takin off\nI'm so high (I'm so high) Lookin for a shorty to break me off\nI'm so fly\n\nAs were headin to the club, everybody know what's up\nThrough the door, V.I.P\nAll the ladies go with me\nOrder drinks, come on in, everybody it's on me\nShowin love, can't nobody tell me nothin I'm so fly\n\nShe ask me how's the air up there you can catch me on the tree top\nAnd this right here's a classic like a pair of Reeboks\nSwitchin fo' lanes in the old school tee top\nTwenty H chop chop choppin up them streets hot\nLit the club on fire with anything that we drop\nAnd make the juicebox wet make the pussy beatbox\n(*Yung Joc doing the beatbox) She on the hand stand and I love the way she peep out\nYou can tell I'mma G, you can tell I'm a G\nYou can tell I'm a G, she can tell I'm a G\nI got the Gmail, let's play the G code\nI touch the G spot, we in the G4\nHundred dollar bill, that's a C Note\nYou got ten of 'em, then that's a G Note\nI check the time ice blocks on my G shop\nYou know who it is Slim and Yung Jizzoc\n\nI'm so fly (I'm so fly) Feels like I'm takin off\nI'm so high (I'm so high) Lookin for a shorty to break me off\nI'm so fly (I'm so fly) Feels like I'm takin off\nI'm so high (I'm so high) Lookin for a shorty to break me off\n\nI'm so fly, feels like I'm takin off I'm so high\nLookin for a shorty to break me off",
 "image": "https://images.genius.com/7694b22ee916f42bc66e8c005d2ae2df.500x500x1.jpg"
}