{
 "title": "Take You Down",
 "album": "Exclusive",
 "year": "2008-04-06",
 "lyrics": "Yeah\nDo-do-do, do-do-do\nDamn, baby\nI want you\n\nWoah, here we are, all alone in this room, oh\nAnd girl, I know where to start and what we gonna do, yeah\nI'll take my time, we'll be all night, girl\nSo get ready, babe, I got plans for me and you\nWoah, woah, ooh\n\nIt ain't my first time, but baby girl, we can pretend (Hey!)\nLet's bump and grind, and girl, tonight will never end\n\nLet me take you down\nI really wanna take you down and show you what I'm about\nCan I take you down?\nYour body, body, oh, oh, your body, body up and down\nSo don't stop, girl, get it\nQuit playing with it, can't wait no more\nI wanna take you down\nI really wanna take you down, take you down, yeah\n\nPretty girl, let's take it off in this room\nNo time to waste, girl, you know what we came to do, woah-woah-woah\nWe got all night to try to get it right, girl\nI hope you're ready, hope you're ready, hope you're ready\nI hope you're ready, babe, 'cause here we go, you know how we do, oh\n\nIt ain't my first time (No), but baby girl, we can pretend (Hey!)\nLet's bump and grind (Come on), and girl, tonight will never end (Ha)\n\nLet me take you down\nI really wanna take you down and show you what I'm about (I'm about)\nCan I take you down? (Oh yeah)\nYour body, body, oh, oh, your body, body up and down\nSo don't stop, girl, get it\nQuit playing with it, can't wait no more (I can't wait no more)\nI wanna take you down\nI really wanna take you down, I really wanna take you down, yeah\n\n(I want you, ah-ah-ah)\nFreakin', oh, baby, like a pro, baby\nAnd I bet that you\n(I bet you, woah-woah, ah-ah-ah)\nThink ya know, baby, like you're grown, baby\nSo what you wanna do?\nI'm gonna take you down, baby, nice and slow\nSo bring it, let's go, baby\n(Woah-woah-woah, huh)\nYeah, yeah, baby (Woah)\nCome on, baby, come on, baby\nCome on, baby, let me take you down\n\nLet me take you down (Oh)\nI really wanna take you down and show you what I'm about\n(Let me show you, let me do it to you like I wanna do)\nCan I take you down? (Woah)\nYour body, body, oh, oh, your body, body up and down (Yeah, yeah, yeah, yeah)\n(Your body up, your body, body, body up)\nSo don't stop, girl, get it (Oh)\nQuit playing with it (Oh), can't wait no more (I can't wait no more)\nI wanna take you down\nI really wanna take you down, take you down, yeah\n\nTake you down (Ha, woah)\nI said I wanna take you down, yeah, yeah\nLet me take you down, take you down\nTake you down\nAll the way down, all the way down (Woah)\nWe can do some things, going all the way down\nTake you down\nTake you down (Ha, woah)",
 "image": "https://images.rapgenius.com/45457c25e93254a3971a15138c4a9677.953x953x1.jpg"
}