{
 "title": "That’s Gangsta",
 "album": "II Trill",
 "year": "2008-02-18",
 "lyrics": "R.I.P. Pimp C\nUGK for Life, you already know, baby\n{J-J-J-J-J-J-J.R.! J.R.}\n (Yeah, mon..)\nThis for my trill gangstas, let's do it\n\nI'm a full-time hustler, posted on the block\nGotta get it t'how I live, an' I'm never gon' stop\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...\nWhen mi ride t'ru the hood, you can hear the bass knock\nAll de gyaldem love me, me have de city locked\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...HEY!\n\nMayne I'm a gangsta, G-A-N-G-S-T-A mayne\nA gangsta, the best to come up out of PA, mayne\nA gangsta, seldom seen, but always heard\nA REAL gangsta, more than just a seven-letter word (fo' real!)\nA gangsta ain't cha clothes (clothes), a gangsta ain't cha hat (hat)\nYour watch, rang, and chain - naw, a gangsta ain't that! (at all!)\nA gangsta can have that, but he ain't gotta show it (why?)\nCause with or without it he's still a gangsta and you know it\nFrom my head to my toe wit it, it ain't hard to see\nThat I'm a gangsta, ain't too many as hard as me\nYou claimin G, but you ain't gangsta jack\nSo tell all them fake gangstas\nI'm comin to take gangsta back - now that's gangsta!\n\nI'm a full-time hustler, posted on the block\nGotta get it t'how I live, an' I'm never gon' stop\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...\nWhen mi ride t'ru the hood, you can hear the bass knock\nAll de gyaldem love me, me have de city locked\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...HEY!\n\nMayne I'm a gangsta, now let me tell you what that means\nSee I'm a gangsta, always got my mind on my green\nAnd I'm a gangsta, always gon' do what I gotta do (yep!)\nUnless it's givin game to police and sellin out his crew (naw!)\nThat's somethin gangstas don't do, gangstas keep it trill (trill)\nA gangsta do a crime, he do his time on the real (real)\nA gangsta don't squeal and tell on everyone he know\nPut a jacket on ya boy, you ain't a gangsta, youse a ho! (A HOE!)\nA gangsta holds his homeboys down when they gone (gone)\nA gangsta put him back on his feet when they home (home)\nA gangsta is a homeboy that never turn his back\nOn another real homie, that's a well-known fact\nAnd that's gangsta!\n\nI'm a full-time hustler, posted on the block\nGotta get it t'how I live, an' I'm never gon' stop\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...\nWhen mi ride t'ru the hood, you can hear the bass knock\nAll de gyaldem love me, me have de city locked\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...HEY!\n\nMayne I'm a gangsta, call me the hood superstar\nAnd I'm a gangsta, ridin in my candy-painted car\nCause see a gangsta, always down to rep for his hood\nAnd to do a little bad, so I can do a little good\nA gangsta don't forget where he came from, no matter\nWhere he go or where he been, keep it gangsta 'til the end\nCause I'm a gangsta (yep), and I'mma always love my city\nMake money but don't act like I'm above my city (Never!)\nCause gangstas, will always give back to the ghetto\nAnd gangstas, will never turn they back to the ghetto\nThat's a fact in the ghetto, it's never been a lie (lie)\nSo I'mma keep it gangsta 'til the day that I die - now that's gangsta!\n\nI'm a full-time hustler, posted on the block\nGotta get it t'how I live, an' I'm never gon' stop\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...\nWhen mi ride t'ru the hood, you can hear the bass knock\nAll de gyaldem love me, me have de city locked\nNow that's gangstaaaaaaaaaaaa...\nNow that's gangstaaaaaaaaaaaa...HEY!\n\nYeah, it's still UGK for Life, for all you haters out there\nWe gon' ride for the Pimp\nR.I.P. Pimp C, ain't nobody ever gon' stop this music\nUGK befo', UGK now, and UGK until, baby!",
 "image": "https://images.genius.com/99ee5bfae182cb252ebca19214a04961.1000x1000x1.jpg"
}