{
 "title": "Could It Be",
 "album": "Ghetto Love",
 "year": "2000-11-21",
 "lyrics": "Huh, uh yeah\nBout to put it to 'em\nWith some ghetto slick shit, heh\nCheck it out, one time\nFor your motherfucking mind (motherfucking mind)\nYo I'm saying they gon' smell me on this one, nigga\nNo doubt, he-heh\nCheck it out, oh yeah\nListen\n\nOn the cross town with the top down\nSounds banging out the backseats (alright)\nMe and shorty two deep\nShe's flashing me thighs\nWind blowing through her hair\nBaby we can take it there (take it there)\nBut first I gotta make my rounds\nBaby slow down\nMy crib's on the other side of town\nBut from the look in her eyes\nShe was hypnotized\nRubbed her hands on my chest\nAnd started getting undressed\nTell me why\n\nCould it be my chromed out rims? (baby)\nBreak you neck when you see a nigga dip (mmm)\nOr could it be the ice you see? (ice you see me)\nBut you tell me that you're really feeling me\n(That you're feeling me, feeling me, feeling me, baby)\nCould it be the word on the block?\nI know they told you that a nigga got it locked (so tight, so tight)\nTell me why you just can't stop (just can't stop)\nI'm thinking that it's all about me (all about me)\nWhat could it be?\n\nI got the sixty inch flat TV, what?\nSatellite, DVD, whatever you need\nI got the bubbles in the tub with the back rub (bathtub)\nSilk sheets baby to make love\nOh girl I wanna hit it in the worst way\nAfter that you'll be coming back like every day (oh yeah)\nSend you back to your girls with something else to say\nHow I hit it, split it, had you with it 'til the break of day\n\nCould it be my chromed out rims?\nBreak you neck when you see a nigga dip (oh)\nOr could it be the ice you see?\nBut you tell me that you're really feeling me\n(I've gotta know right now)\nCould it be the word on the block? (oohh)\nI know they told you that a nigga got it locked (so tight, so tight)\nTell me why you just can't stop (just can't stop)\nI'm thinking that it's all about me\nWhat could it be? (What it could be?)\n\nCould it be the drop top Benz\nThat got your friends going out on a limb (huh?)\nSliding me numbers when you ain't watching them (watching them)\nPlaying me close but I'm not feeling them (oh no, oh no)\nCould it be the time piece flooded with chips?\nIs it because I flex baguettes around my wrist? (huh)\nOr large amounts up in my bank account (my bank account)\nYou tell me you love me baby but what's that all about (ooohhh)\n\nCould it be my chromed out rims?\nBreak you neck when you see a nigga dip (baby)\nOr could it be the ice you see? (shining so bright)\nBut you tell me that you're really feeling me\n(That you're feeling me, feeling me)\nCould it be the word on the block? (I know)\nI know they told you that a nigga got it locked  (so tight)\nTell me why you just can't stop (ah yeah)\nI'm thinking that it's all about me (alright, alright)\nWhat could it be?\nCould it be my chromed out rims?\n(Could it be my chromed out rims?)\nBreak you neck when you see a nigga dip (ooohhh yeah)\nOr could it be the ice you see?\nBut you tell me that you're really feeling me (ooohhh, baby)\nCould it be the word on the block? (tell me)\nI know they told you that a nigga got it locked (so tight, so tight)\nTell me why you just can't stop (no, no)\nI'm thinking that it's all about me (all about me)\nWhat could it be? (What it could be?)",
 "image": "https://images.genius.com/91fbde6fd51ed2d57e0b5519594d2fae.1000x1000x1.jpg"
}