{
 "title": "Fill Me In",
 "album": "Born to Do It",
 "year": "2000-04-03",
 "lyrics": "I got something to say, something to say\nAlright (Can you feel me?)\nCome on\nCan you fill me in?\nWhat you want? What you want me to do, baby?\nCan you fill me in?\nLet's talk about it\n\nI was checking this girl next door when her parents went out\nShe phoned said, \"Hey boy, come on right around\"\nSo I knock at the door\nYou was standin' with a bottle of red wine, ready to pour\nDressed in long black satin and lace to the floor\nSo I went in, then we sat down start kissing, caressing\nTold me about Jacuzzi, sounded interesting\nSo we jumped right in\nAll calls diverted to answer phone\nPlease leave a message after the tone\nI mean me and her parents were kind of cool\nBut they were the fine line between me and you\nWe were just doing things young people in love do\nParents tryna find out what we were up to\n\nSaying, \"Why were you creeping 'round late last night?\nWhy did I see two shadows moving in your bedroom light?\nNow you're dressed in black\nWhen I left, you were dressed in white\nCan you fill me in?\"\nCalls diverted to answer phone\nRed wine bottle, half the contents gone\nMidnight return, Jacuzzi turned on\nCan you fill me in? (It's another one, it's another one)\n\nWhenever the coast was clear and she'd ask me to come out\nI'd say, \"Hey girl, come on right around\"\nSo she knocked at the door\nI was standing with the keys in my hand to the four by four\nJumped in my ride, checkin' that nobody saw\nThe club we went in\nWe got down bounced- bounced to the rhythm\nSaw it was early morning\nThought we'd better be leavin'\nSo I gave you my jacket for you to hold\nTold you to wear it 'cause you felt cold\nI mean me and her didn't mean to break the rules\nI weren't trying to play your mum and dad for fools\nWe were just doing things young people in love do\nParents tryna find out what we were up to\n\nSaying, \"Why can't you keep your promises no more?\nSay you'll be home by twelve, come strolling in at four?\nOut went the girls, but leaving with the boy next door\nCan you fill me in?\nWearing a jacket, who's property\nSaid you'd been queuing for a taxi\nBut you left all your money on the TV (Can you tell me?)\nCan you fill me in? (Can you fill me in?)\"\n\nAll they seem to do is be checking up on you, baby\nWatchin' our every move\nThink some day they might approve, baby\n\n\"Why were you creeping 'round late last night?\nWhy did I see two shadows moving in your bedroom light?\nNow you're dressed in black\nWhen I left, you were dressed in white\nCan you fill me in? (Can you fill me in?)\"\nCalls diverted to answer phone\nRed wine bottle, half the contents gone\nMidnight return, Jacuzzi turned on\nCan you fill me in? (Can you fill me in?)",
 "image": "https://images.genius.com/33eb43c5cdc0ee9ebb4663d1e52c9954.450x450x1.jpg"
}