{
 "title": "Maybe I Deserve",
 "album": "Force of Nature",
 "year": "2001-02-10",
 "lyrics": "Do you mind if I tell the truth for a second, yall?\n\nMaybe I deserve..\nTo wonder who's calling so damn late\nFor you to say I'm tripping, just a homie from upstate\n(said it's just a homie)\nDon't he know its one o' clock in the mornin'\nYou say baby its cool (baby its cool)\nMaybe I deserve..\nFor you to say he's comin' into town (later on this evenin')\nYou was just wondering if you and him can hang out\nI don't like it, but I know I gotta trust you\nIt ain't cool cause I know it's true\n\nMaybe I deserve..\nFor you to go out and find some other guy\nMaybe I deserve..\nFor you to stay out with him all night\nMaybe I deserve..\nFor you to do all the things I did to you\nMaybe I deserve..\nOh yeah, oh yeah\nMaybe I deserve..\n\nMaybe I deserve..\nFor you to put on a sexy dress\nFor me to ask you \"who the hell you tryna impress?\"\n(\"Who the hell you tryna impress?\")\nFor you to laugh it off like it ain't nothin'\nI know its somethin'\n(maybe, just maybe)\nMaybe I deserve..\nTo sit at home and wonder where you are\nIs he kissin' you, touchin' you, holdin' you, what?\nTo take a drink to help ease my mind\nI wanna be mad (wanna be)\nAfter all those times (after all those times)\n\nMaybe I deserve..\nFor you to go out and find some other guy\nMaybe I deserve..\nFor you to stay out with him all night\nMaybe I deserve..\nFor you to do all the things I did to you\nMaybe I deserve..\nOh yeah, oh yeah\nMaybe I deserve..\n\nMaybe I deserve..\nFor me to ask you \"where you've been?\"\n(\"Where the hell you've been?\")\nMaybe I deserve..\nFor you to say \"I better stop trippin'\"\nMaybe I deserve..\nTo grab your neck until you let me know\nMaybe I deserve..\nFor you to run cryin', cryin' out the door\nMaybe I deserve..\nTo grab my coat, and chase you down the street\nMaybe I deserve..\nTo say its not you, it's my own insecurities\nMaybe I deserve..\nFor you to say \"yes I cheated on you\"\n(\"Yes I cheated on you\")\nMaybe I deserve..\nAnd I won't care cause after all I put you through\n\nMaybe I deserve-serve...yeah\nTo be mistreated sometimes\nMaybe I deserve..\nTo even be, lied to sometimes..\nMaybe, maybe you should go cheat on me too",
 "image": "https://images.genius.com/470fd7847c7543ea4eb387e9c2f5ba0f.400x397x1.jpg"
}