{
 "title": "My Baby",
 "album": "Lil’ Romeo",
 "year": "2001-04-13",
 "lyrics": " Hotline\n Can I request a song?\n Yeah\n \"My Baby\" by Lil' Romeo {*giggling*}\n You got that\n\nG: Oh Romeo give me a chance\nR: Uh uhh too young I don't need a girlfriend\nG: Walk me home from school anyway\nR: (Heheh) O-kay\nG: Oh Romeo the cutest boy I know\nR: I know, I know\nG: So let me be your.. girlfriend\n\nThey call me Lil' P I represent the CP3\nCalliope ya heard me? Straight from New Orleans\nI got an uncle named Silkk and an uncle named C\nI been dribblin the ball since the age of 3\nI got game like Kobe dunkin like Poppa P\nCause I'm in the zone, ain't no stoppin me\nCause you can jump a baby hummer, girls be jockin me\nP. Miller wear No Limit Gear from head to feet\nIt's like that Whodi? (You got me crazy)\nIt's like that Whodi? (I want to be your lady)\nIt's like that Whodi? (Why won't you be my baby)\nIt's like that Whodi? (Can't no girl fade me)\nMeet me at the skatin rink\n\nG: Oh Romeo give me a chance\nR: Uh uhh too young I don't need a girlfriend\nG: Walk me home from school anyway\nR: (Heheh) O-kay\nG: Oh Romeo the cutest boy I know\nR: I know, I know\nG: So let me be your.. girlfriend\n\nEleven years old, makin A's and B's\nAnd these little mami's can't keep they hands off me\nWhen you see me in the street, holla \"What's up Doc?\"\nI got a Bugs Bunny chain with a matchin watch\nI make ya'll jump like Kris Kross, bounce like Bow\nI'm the next generation I came to lock it down\nI'm a little boy but I live a big man's life\nGot girls passin notes tryin to be my wife\nGot grown women, wantin to be in my life\nBy the time I'm 18 I'm not gon' be nothin nice\nI'm that R-O, M-E-O\nAfter high school, I'm goin' straight to the pros (bounce, bounce)\n\nG: Oh Romeo give me a chance\nR: Uh uhh too young I don't need a girlfriend\nG: Walk me home from school anyway\nR: (Heheh) O-kay\nG: Oh Romeo the cutest boy I know\nR: I know, I know\nG: So let me be your.. girlfriend\n\nSoldier boy I want you to myself, I don't want them girls around\nYou're the flyest thing up in here boy and that's why it's goin down\nI heard they call you Romeo, well I'm you're Juliet\nYou must be good at hide and seek, cause boy your hard to get\n\nG: Oh Romeo give me a chance\nR: Uh uhh too young I don't need a girlfriend\nG: Walk me home from school anyway\nR: (Heheh) O-kay\nG: Oh Romeo the cutest boy I know\nR: I know, I know\nG: So let me be your.. girlfriend\n\nRomeo! (fire boys make them elbows swing)\nRomeo! (fire boys make them elbows swing\nFire girls make them elbows swing)\nFire boys make them elbows swing, Fire girls make them elbows swing\nFire boys make them elbows swing, Fire girls make them elbows swing\nFire boys make them elbows swing, Fire girls make them elbows swing\nRomeo boy do that thing, Romeo boy do that thing\nRomeo boy do that thing, Romeo boy do that thing\nThis is for the fire girls that ???\nThis is for the fire boys that ??? (break it down)\nThis is for the fire girls that bout it bout it\nThis is for the fire boys that bout it bout it\n(haha)\nThat's all folks!",
 "image": "https://images.genius.com/d45e44c183aa883e87486b1c16365eb0.300x300x1.jpg"
}