{
 "title": "My Projects",
 "album": "Disturbed",
 "year": null,
 "lyrics": "Cal why is you so lazy?\nYou was supposed to went and gone and picked it up for me two hours ago!\nDamn you don't do nothing for me!\n\nIn my project (5x)\n\nDawg my project is sweetin\nBut if you ain't from where I'm from, like some dawg\nDon't come or you gettin beatin\nYeah we cheatin dog that's automatic\nWe greedy, \nplus we try'n feed the needy dawg wit all the cabbage\nSteal from the rich and give to the poor\nWe sell a few drugs, bust a few slugs, and pimp a few hoes\nDon't let us find a bit in higgity\nDawg we turn them into stiggidies\nWith shorties off in riggidies\nSo if you ain't from here or wit my guys\nDon't even roll thru playa cuz all the traffic gettin minimized\nCries for help cuz you got carjacked\nNiggas roll for a minute then pass it to the hypes to sell the car back\nAnd once she get it, it be stripped down\nThugs, they got your system and your dubs and want your crib now\nYa'll betta give the hood respect\nCuz it pay to play for a day up in my projects\n\nIn my projects, my project thick\nIn my projects, everybody cooks bricks\nIn my projects, my projects thick\nDon't come to my projects if you ain't with this clique\nIn my projects, my project thick\nIn my projects, everybody cooks bricks\nIn my projects, my projects thick\nDon't come to my projects if you ain't with this clique\n\nNow let me tell you bout them kingpins\nDroppin Y2K Benz on them rims, bringin 15 in\nThey dishin it out, they keep it in circulation\nThey dodgin the Fedz, and suckas is playa hatin\nThey got the whole hood stacked up\nAnd now the po's walkin on the showroom floor buyin 'Lac Trucks\nThey stuck in the ghetto by choice\nBut if they go, it's jacuzzis and condos, with a Rolls Royce\nNow voice your opinion\nYou heard about the 'War On Drugs'\nNow won't you tell me who you think winnin\nSpendin money by the piles throwin dubs\nOn the 'burbans with the subs\nAnd they twerkin bumpin Coo Coo Cal\nAnd the hood love hoodrats\nOn the bus-stop shakin it like it's hot with some good cat\nYa'll betta give the hood respect\nCuz it pay to play for a day up in my projects\n\nIn my projects, my project thick\nIn my projects, everybody cooks bricks\nIn my projects, my projects thick\nDon't come to my projects if you ain't wit dis clique\nIn my projects, my project thick\nIn my projects, everybody cooks bricks\nIn my projects, my projects thick\nDon't come to my projects if you ain't wit dis clique\n\nDawg, go on and sum it up between the grind with dimes\nCrimes and rhymes, ya'll we comin up\nFrom sundown to sun-up, ha\nThe block watch, peekin out the attic in case you run up\nWit diamonds and furs, he's and her's\nShoppin sprees with ease to fill up a 2000 Suburb, ha\nDawg my projects got taste\nAlthough the rent ain't nuthin but two-fifty\nWe sportin five thousand dollar drapes\nMakin it happen, wit snappin to avoid that - anchor\nHook me up with plenty tracks to keep a playa rappin\nSo put my city on the map\nHook me up wit million dollar vocal cords\nI can afford a million on a track\nYou do the addin and subtractin\nWastin time just to figure out, without a doubt, that we stackin\nYa'll betta give the hood respect\nCuz it pay to play for a day up in my projects\n\nIn my projects, my project thick\nIn my projects, everybody cooks bricks\nIn my projects, my projects thick\nDon't come to my projects if you ain't wit dis clique\nIn my projects, my project thick\nIn my projects, everybody cooks bricks\nIn my projects, my projects thick\nDon't come to my projects if you ain't wit dis clique\nIn my projects (*repeat 5x until end of song*)\n\nCOCO WHERE YOU BEEN THIS TIME OF LATE\nITS MORNING!",
 "image": "https://images.genius.com/df78a265eccf3ab27c92bf03f8390072.600x600x1.jpg"
}