{
 "title": "Please Don’t Mind",
 "album": "Get Down or Lay Down",
 "year": "2001-08-07",
 "lyrics": "You could turn the mic down a lil' bit\nC'mon\n\nM-R Dot M-A-N B Double O B-O-N-I-C (*4X*)\n\nExcuse me bitch what's your name\nCouple dollars ain't it so what's your game\nKnown fact cause I'm gettin' the cash\nDon't dance face to face, bitch gimme the ass\nI'll help you out if you had a long day\nDick like, good advice, it could go a long way\nFront, cause I knocked cha'll down\nI could remodel homes, I knock walls down\nI'm wit all, that shit y'all\nTalk about, oh what I don't hit raw\nNaw, hit the floor like a bank hold up\nHave I ever loved a chick lemme think, hold up\nNo, I'm all about the dough\nHe shouldn't give a fuck if it's not your ho\nOh, that hatin' shit you did, ain't done us\nPlayas and we get more head then new hundreds\n\nPlease don't mind, how I pursue\nDon't take it personal girl that's how thugs do\nLet's get high, sit for a few\nAnd after that let's go I'm fuckin you\n\nYo, let me tell you how I pursue\nSpit game in they ear, and it's proper too\nSay we stayin' at the Fount with Blue\nI'mma ball every day, spend a grand or two (psyche)\nHit the beach, forget the sheets\nGet it down right there, chick touch your feet\nLoc roll, that's so much game\nY'all think y'all know my aim\nThat's a joke like Marlon Wayans, lame\nAnd it ain't got no change\nChick listen up, want dick or what?\nTake that, that's the only thing I'm givin' up\nOnly sent, it's the dream that your 'gone get\nHit for free, then Boo 'gone hit\nNo they not like M-O dot\nI hit, touch base, and ball like White Sox\n\n\nLook around dawg, what you see nigga\nWhole lotta model bitches then me nigga\nMe and Don in a drop and this pearl\nWith jewels so sick make niggas wanna hurl\nDo it look like I care that's your girl?\nShe diggin' me, and love that I'm all the way thorough\nYou talkin' shit, don't concern her\nAs far as fuckin' go, \nhit more bitches than Ike Turner\n\nI send 'em home in the cab to tell\nI play 'em more high notes than Patti LaBelle (plus)\nYou gel, heavywear at (and)\nGot ice in your bezie wher it at?\nY'all dudes is strictly losers\nWe 'gone blow like lightbulbs and fuses\nTell your man he better slow his role\nOur guns'll make James Brown lose his soul",
 "image": "https://images.genius.com/d27b240708a8aa214bd1d2f79af64878.600x600x1.jpg"
}