{
 "title": "Promise",
 "album": "J.E. Heartbreak",
 "year": null,
 "lyrics": "Nothing is promised to me and you\nSo why will we let this thing go?\nBaby, I promise that I'll stay true\nDon't let nobody say it ain't so\nAnd, baby, I promise\nThat I will never leave\nAnd everything will be alright\nI, I promise these things to you\nGirl, just believe\nI promise\n\nSaid I know that things just ain't been right\nForever's such a very long time\nWe never even had a fight\nDon't let no one change your mind\n'Cause they don't know how much I care\nThey don't know the things we share unless they're here, babe\nBut since they're not\nHow can they say that I'm not true?\nOh, oh, oh\n\nIf you need a love, I got the love that you need (Said I got the love)\nAin't no way they can take that from me (They can't take that from me)\nAnd I pray to God that one day they will see\nThey'll see that I'm all that you need\nOh, oh, oh, woah\n\nNothing is promised to me and you (Oh, woah, oh)\nSo why will we let this thing go? (Oh, baby)\nBaby, I promise that I'll stay true (I'll stay true)\nDon't let nobody say it ain't so (Don't let nobody say it ain't so)\nAnd, baby, I promise\nThat I will never leave\nAnd everything will be alright (Alright)\nI, I promise these things to you\nGirl, just believe\nI promise\n\nWhen I think of all the times I said\nThat I will see you another day\nBaby, nothing's gonna change, yes, it is\nSaid you mean the world to me\nAnd, baby girl, I'll keep you first, yeah\n'Cause that's the kind of love you deserve\nAnd you know I got a love if you need a love, yeah (Yeah)\n\nIf you need a love, I got the love that you need (Oh, yeah)\nAin't no way they can take that from me (Ain't no way I'm gonna let them take it)\nAnd I pray to God that one day they will see\nAnd I swear to you, you 'cause I promise, oh, girl (Oh)\n\nNothing is promised to me and you\nSo why will we let this thing go? (Woah, yeah)\nBaby, I promise that I'll stay true\nDon't let nobody say it ain't so\nAnd, baby, I promise (Yeah)\nThat I will never leave (I will never leave you)\nAnd everything will be alright (Girl, it's gonna be alright)\nI, I promise these things to you (Yeah)\nGirl, just believe (Girl, believe in me)\nI promise\n\nYou're the only I want in my life ('Cause you're the only one I want in my life)\nAnd I promise everything is alright, girl (Promise everything will be alright, yeah)\nYou're the only I want in my life\nI promise, promise, promise, promise you, baby (And, baby, I need you, yeah)\nYou're the only I want in my life (I love you)\nAnd I promise everything is alright, girl (And, oh, babe)\nYou're the only I want in my life (Woah, yeah)\nI promise, promise, promise, promise you, baby (Yeah)\nYou're the only I want in my life (Yeah)\nAnd I promise everything is alright, girl (Yeah)\nYou're the only I want in my life (And, baby, you)\nI promise, promise, promise, promise you, baby\nYou're the only I want in my life",
 "image": "https://images.genius.com/214691bca89b8ee0ac7113740af69162.1000x1000x1.png"
}