{
 "title": "We Need a Resolution",
 "album": "Aaliyah",
 "year": "2001-04-13",
 "lyrics": "Ah, ah, I'm tired of arguin', girl\nI'm tired, I'm tired, I'm tired\nHuh, I'm tired of arguin', girl\nHuh, I'm tired, I'm tired, I'm tired\nHuh, I'm tired of arguin', girl\nFreaky-freaky-freaky-freaky, baby girl, huh\n\nDid you sleep on the wrong side, I'm catching a bad vibe\nAnd it's contagious, what's the latest?\nSpeak your heart, don't bite your tongue\nDon't get it twisted (Yeah), don't misuse it\nWhat's your problem, let's resolve it\nWe can solve it, what's the causes?\nIt's official, you got issues\nI got issues (Um, well you got issues), but I know I miss you\n\n(Am I supposed to change, are you supposed to change?)\nYeah, who should be hurt, who should be blamed?\n(Am I supposed to change, are you supposed to change?)\nWho should be hurt, who should be ashamed?\n(Am I supposed to change, are you supposed to change?)\nWho should be hurt, will we remain? Oh, I\nWe need a resolution, we need a resolution\nWe need a resolution, we have so much confusion\n\nI wanna know, where were you last night?\nI fell asleep on the couch, I thought we were going out\nI wanna know, were your fingers broke?\nIf you had let me know I wouldn't have put on my clothes\n(I wanna know) Where'd you go instead?\nIt was four in the morning when you crept back in the bed\nI wanna know, what was in your head?\nOr what was in my head, am I supposed to change?\n\n(Am I supposed to change, are you supposed to change?)\nOh, who should be hurt, who should be blamed?\n(Am I supposed to change, are you supposed to change?)\nWho should be hurt, who should be ashamed?\n(Am I supposed to change, are you supposed to change?)\nOh, who should be hurt and will we remain?\nWe need a resolution, we need a resolution\nWe need a resolution, we have so much confusion\n(Am I supposed to change, are you supposed to change?)\nWho should be hurt and who should be blamed?\n(Am I supposed to change, are you supposed to change?)\nWho should be hurt, who should be ashamed?\n(Am I supposed to change, are you supposed to change?)\nWho should be hurt, will we remain?\nWe need a resolution, we need a resolution\nWe need a resolution, we have so much confusion\n\nBaby, let me know, you'll let me know (I will)\nYou'll let me know, you'll let me know (I will)\nYou'll let me know, you'll let me know (I will)\nYou'll let me know, you'll let me know\n\nGirl, holla\nYou give me bits and pieces\nYou tryna blame me when I don't even know the reason\nI think it's just the season\nMaybe the month, maybe you're bleeding\nNow tell me what's the reason?\nSnoop video? Looks are deceiving\nSo, cut the crying, cut the coughing, cut the wheezing, girl\nQuit the blaming, cut the naming, cut the sneaking, girl\nI think you need some prayer, better call a deacon, girl\nSo get your act right or else we won't be speaking, girl\nSo what's it gonna be?\nFreaky-freaky, me and you?\nOr is it gonna be, who blames who?\nI'm tired of these things, I'm tired of these scars\nI think I'm gonna get me a drink, I'll call you tomorrow, ooh",
 "image": "https://images.genius.com/5020bd70fac345f7dff334a126311b2a.1000x1000x1.jpg"
}