{
 "title": "2 Way Street (Remix)",
 "album": null,
 "year": null,
 "lyrics": "Yeah right, here we go again\n2 way street, what part 2?\nThe --- to continue?\n\nHoney you heard wrong, I ain't tryin to get my swerve on\nAll I want is you with your panties and your shirt on\nWord is bond that's enough, I don't need another cat to crush\nAs long as you got the fattest ass to munch\nWord is bond say it one more time\nYou the only one getting tongue where the sun don't shine\nBut Pun don't mind as long as you lovin me\nAnd if you ever catch me cheatin, girl it wasn't me\nVerse One: missjones\nHow did I  think u were just seeing me\nWhen u always, get all those late night beeps\nYou didn't think that I'd pick up your phone\nAnd i know that was wrong, but now I know for sure\nYou said I was...\nChorus: missjones\nYou said I was your number one lady\nBut how many more like me?\nMaybe two or maybe three...\nTell me\nYou said I was your number one lady\nBut how many more like me?\nWhy don't you look\nThen you'll see\nVerse Two: missjones\nIf I ask you, who's callin you this late\nYou don't answer, and that's why I doubt your faith\nYou don't want me... popping up where you're at\nYou better sound crazy someplace else\nCause I know there's someone else\n*chorus*\n(You lied to me, it's hard to believe you decieved me)\n(Oh number one, Big Pun, Big Pun)\n\nHold lemme explain, I know that I'm in trouble Boo\nYeah I crushed that chick, but I made love to you\nStop flippin gurl, actin like you kept it real\nI followed you and your two sisters\nYou went from there straight to Chippendales\nIt was real I know he told me\nI was home and lonely, you gotta trust me\nShe was ugly, I was really horny, you don't hold me no more\nCall me at all, 'cept to go to the store\nFix a whole in the wall, that ain't even fair\nDidn't I give you cheddar to weave your hair?\nPeople stare thought you was a model or a millionare\nBut now it's over and you ain't crying for this thug\nFairwell love, keep the diamonds and the love letters\nBIG PUN: \tand that's the truth the whole truth\n\t\tand nothing but the truth\nMISS JONES: \tboy u can't handle the truth\nBIG PUN: \twhat u got to say for youself?\nMISS JONES: \tnigga I got a whole lot to say for my self\n\t\tu better watch your mouth\nBIG PUN: \twha? wha? wha? wha? wha?\n\nLove letters and chedders, I see frames it's all the same\nTried to control the game with your ball and chain\nNow you're callin my name with your balls in pain\nAnd it's a shame, I'm in the baller's Hall of Fame\nComin late at night and leave me hurt with my back bent\nCall me up and try to gas me with your accent\nBut that's it PUN, so watcha wanna do?\nRemember \"Punish Me\" now I will punish you\nYou're my #1 lady, you're my number one girl (4x)\nChorus to fade",
 "image": "https://images.genius.com/3ba6628b6b1ecbc43696a31bce9e59a7.649x649x1.jpg"
}