{
 "title": "Cheapskate (Remix)",
 "album": null,
 "year": null,
 "lyrics": "[Intro: Marlon Brando & \nMocha\n]\nTake two, uh oh\n1, 2, 1, 1, 2\n1, 2, 1, 1, 2\nI want it!\nThey got it\n\"You ain't gettin nada..\"\n\nYo I'ma a cheap cat, you peeps, I keep stacks\nI don't care if you that, sweet rap, petite black\nI'm tryin to shine yo, ?? stakes the dime yo ??\nWhich means cheap, when you speak espanol\nCome on, y'all know - if not, ask Mo'\nThinkin you gettin cash flow, then you'se a gassed ho\nI just let your ass go, you know, spend my dough\nGet shiesty hoes that pose in centerfolds\nClothes, uh oh, now your man done bought Timb's\nMake you Phillip Hartman, Spartan jonnin\n\nUh yo, uh ballin, it don't cost in flossin\nAnd the same to these cats, forget who's boss and\nStallin, on low,  and I'ma leave ya crawlin\nMocha talkin all, off the wall and, what?\n\nWhat, all into my dough, involved in\nSwim in my jacuz' then, like a dolphin\nWell if I die, would you jump in my coffin?\nSell my law, then put all my cars in auction\nAiyyo, why I can't score without trickin no dough\nActin like I don't know how this trickin shit go\nWith these golddiggin, low-pro Moe squigglin hoes (chill!)\nMy Paul you right, I mean fuck for the amounts (now)\n\nWho dat dime honey who got her eyes buggy\nMy style lovely, but you won't get a dime from me\nNone of my money, you must be sick\nI'm the one who tips and leave her some crisp\nBet I eat cake and known to peep snakes\nBy the Cheapskatez, looking for a cheap date\nThinkin he gon' feed me fries and cheesesteaks\nYou gon see me escape, check the release date\n\nI want it, uh huh uh huh\nAin't got it, uh uh, uh uh\nI want it, uh huh uh huh\nAin't got it, uh uh, uh uh\nI want it, uh huh uh huh\nAin't got it, uh uh, uh uh\nI want it, uh huh uh huh\n\"You ain't gettin nada..\"\n\nIt all starts in the club, with a sip of somethin\nNow she wanna fill the glass to the tip or somethin\nThen a nigga dead wrong when he flip or somethin\nLike huh, you want what!  You better strip or somethin\nDo it Player's Club style, work a hip or somethin\nGet a ski mask, dump a clip in or somethin\nMe, I'm more rich then poor, I just refuse to trick\nQuick to holla (WHAT!) you ain't gettin nada damn dolla\n\nKFC is good, but girls can't be chickens\nMan listen, but what they can be is pigeons\nPigeons, the worst bird, that's my word\nEatin on curbs in herds lookin for herb\nChicks, they be frontin nice, but they whores really\nKnew shorty was greedy when she pumped the 450\nMack on her titty like she fucked the whole city\nPush an 850 and she leave ya cock spitty\nI pulled up knockin Biggie, here kitty kitty (Who that?)\nI'm lookin pretty jiggy, sweater all knitty (uh-huh)\nWhat the deally?  She said, \"You sound Willie\"\nNext Chilly, I said you sound silly\n\nYou's a little nigga, found a real illy\nNiggas like lead only fuck with big billies, you feel me?\nGot a big house on the hilly, first style half a milli'\nTake me shoppin, and illin\nDrop-boxes, chef blowin up my lafa's\nHe threw all the pots, didn't even bill me the lobsters\nGame tight, might throw you on my rocks y'all\nBut ain't gettin Cheapskate, nigga I got you\n\nI want it, uh huh uh huh\nAin't got it, uh uh, uh uh\nI want it, uh huh uh huh\nAin't got it, uh uh, uh uh\nI want it, uh huh uh huh\nAin't got it, uh uh, uh uh\nI want it, uh huh uh huh\n\"You ain't gettin nada..\"",
 "image": "https://images.genius.com/0da1ebebc0f9586b82fa24bcace875f6.480x360x1.jpg"
}