{
 "title": "Deja Vu (Uptown Baby)",
 "album": "Make It Reign",
 "year": "1998-06-02",
 "lyrics": "New York to the heart, but got love for all\nLie and die in the fire, where I learned to ball\nUptown is the place where I lay my dome\nOn the streets of the Bronx where my family roam\nHo damn it, we home, Peter got a nine millimeter\nPlaya haters can feel the flame from my heater\nI never really liked to play a fool like that\nBut I love to succeed and see foes fall flat\nSplat, like deja vu\nAnd I got another clip that'll daze y'all crew\nI sip Cristal,\n \nDom P, Mo'\n with pist-al\nJust cause I'm pissy, don't mean you should misdoubt\nKeep em near da fifties and, hundreds all arranged\nAnything less than that, you keep the change\nNot filthy rich, but bitch I'm barely broke\nBlessed with flows that keep you hooked like dope\nFriends call me Gunz, sons call me trife\nCause I'm quick to slide off and slide this dick up in your wife\nAnd that's life, you should learn how to treat her\nI guarantee Peter, knows how to eat her\nAnd beat her,\n niggas in the Bronx call me Lex\nCause I push a Lex\n, and \nI rock a Rolex\nAnd \nI lounge on Lex\n, and I love sex\nAnd \nI wave techs on sets that be tryin to flex\nLike Dex, nigga God rest your soul\nBut when you're playin cards for Gunz, it ain't no time to fold\n\nNew York niggas got crazy game\nBut outta town niggas is all the same\nBrooklyn niggas get crazy loot\nThat's because when it's beef they ain't scared to shoot\nHarlem niggas know how to play\nMack the 600, getting crazy pay\nNiggas outta Queens got shit on lock\nStrapped with the Glock, running up in your spot\n\nBut if it wasn't for the Bronx\nThis rap shit probably never would be going on\nSo tell me where you from\n(Uptown baby, uptown baby\nWe gets down baby, up for the crown baby)\nNow if it wasn't for the Bronx\nThis rap shit probably never would be going on\nSo tell me where you from\n(Uptown baby, uptown baby\nWe gets down baby, up for the crown baby)\n\nYo the \nRM-80\n, is parked in the lot\nRight next to the Mercedes, keep the heat cocked\nFor these blocks that are shady, \nyou're crazy if you walk around\nThinking shit's gravy\n; stop me? Maybe\nI'm livin life lawless, makin big investments\nOn them 8-class flawless, and hoes call us\nI'm comfortable like Recaro\n, two quarters of my life\nWalkin roads type narrow, deep thoughts which I abide by\nPuffin high, got my mind's eye, points sharper\nThan an arrow gettin high, \nkeep your eye on the sparrow\nRiches like the pharaoh\n, bought a new five\nWith the snitches for these hoes, trunk full of ammo\nKeep my toast closer than most niggas keep they own shadow\nAnd I strap for my foes like a saddle\nI rock stones, other niggas rock gravel\nTalk shit? Whatever have you, I'm from Soundview\nBronx most wanted, front get confronted\nPlaya, we rollin deep in the one point five hundreds\nLike Big I., red eyed, mad blunted\nYou step outside and get blooded have your whole block flooded\nWith the Bronx it's a warnin, stormin guns out\nFrom dusk 'til dawn and it's on, no doubt\nKeep a eye on yo' bitch when I'm roamin about\nAnd put a eye on yo' lip nigga, watch yo' mouth\nI'm from the Bronx, wipe yo' feet when you step in my house\nCause you's a small-time nigga, bout a half an ounce now\n\nNew York niggas got crazy game\nBut outta town niggas is all the same\nBrooklyn niggas get crazy loot\nThat's because when it's beef they ain't scared to shoot\nHarlem niggas know how to play\nMack the 600, getting crazy pay\nNiggas outta Queens got shit on lock\nStrapped with the Glock, running up in your spot\n\nBut if it wasn't for the Bronx\nThis rap shit probably never would be going on\nSo tell me where you from\n(Uptown baby, uptown baby\nWe gets down baby, up for the crown baby)\nNow if it wasn't for the Bronx\nThis rap shit probably never would be going on\nSo tell me where you from\n(Uptown baby, uptown baby\nWe gets down baby, up for the crown baby)\n\nUh, Peter Gunz like what\nUh, The Lord Tariq is like what\nUh, Soundview like what\nUh, one-seventy-fourth like what\nUh, Money Boss like what\nUh, The Gun Runners like what\nUh, and KNS like what\nUh, and Uptown like what\nShao-lin, play, play on\nStrong Isle, play play on and a\nMt. Vern, play play on\nAnd Yonkers, play play on and a\nPuttin' it down for N.Y. ya know what I mean\nN.Y. and world wide",
 "image": "https://images.rapgenius.com/be99f2ee41abdc408be0f85030a2b7b4.600x600x1.jpg"
}