{
 "title": "Find a Way",
 "album": "The Love Movement",
 "year": "1998-08-25",
 "lyrics": "Now you caught my heart for the evening\nKissed my cheek, moved in, you confuse things\nShould I just sit out or come harder?\nHelp me find my way\n\nMessing me up, my whole head\nTeasing me, just like Tisha did Martin\nNow look at what you're starting\nSchoolboy's crush and it ain't on the hush\nThe whole world sees it but you can't (uh)\nMy peoples they complain, sit and rave and rant (come on)\nYour name is out my mouth like an ancient chant (say what?)\nGot me like a dog as I pause and pant\n*heavy breathing*\n\nSpeaking of which\nGot a leash and I wish just to rock you miss (C'mon)\nMake a militant move, peep my strategy (What?)\nEnd of the day you're not mad at me (Ugh)\nNot dealing with nobody, now that's what you told me (What?)\nI said, \"Hey yo, it's cool, we can just be friendly\" (C'mon)\n'Cause yo, picture me messing it up\nHer mind not corrupt, with the ill C-cups\nShit, I'm on my J.O. (C'mon)\nBullshitting, hoping that the day goes slow (what?)\nGot me like a friend, what confuses me though\nIs kisses when we breeze, tell me what's the deal, yo?\n(Deal yo, yo, yo...)\n\nNow you caught my heart for the evening\nKissed my cheek, moved in, you confuse things\nShould I just sit out or come harder?\nHelp me find my way (ha-ha!)\nNow you caught my heart for the evening\nKissed my cheek, moved in, you confuse things (come on)\nShould I just sit out or come harder? (huh?)\nHelp me find my way\n\nNow why you wanna go and do that, love, huh?\nMaking things for me towards you harder\nKilling me, just when I think we're there\nYou douse the whole vibe and the flows in the air\nTelling me 'bout next man\nBut next man ain't the nigga with the plan\nWho got your heart in mind?\nIt's about time that you just unwind (C'mon)\n\nAnd let it just happen, make it front-free (uh)\nJust sweat me like Moneypenny (uh)\nDigging you, getting inside of your stee (what?)\nIt's the Quest cat keeping you company (ha)\nForever, or however you want it\n\nWord, word\nNow wait a minute, ma, before you jet into the curb (Yeah, yeah)\nStart to make affections, which is goo,d not the herb\nBut it, it ain't me, and I, I ain't blurred (Ugh)\nI'ma still just chill with you\nMaybe things could change if you change your view (C'mon)\nIf not, then, I guess it is cool (Yeah)\nJust to keep to yourself and abide by the rules, right\n\nLike that y'all\nCheck it out now...\nCheck it out now...\nLike that now...\nCheck it out now...\nWha wha now...\nCheck it out now...\nYeah yeah now...\nCheck it out now...\nCheck it out now...\nIt's like that now...\nCheck it out now...\nYeah yeah now...\nCheck it out now... (Ahem)\nWhat you say, what? what?\n\nNow you caught my heart for the evening (Talk it out now)\nKissed my cheek, moved in, you confuse things\nShould I just sit out or come harder?\nHelp me find my way (Now sing it)\nNow you caught my heart for the evening (Sing it out)\nKissed my cheek, moved in, you confuse things (Take your time)\nShould I just sit out or come harder?\nHelp me find my way\n (Now talk it out)\nNow you caught my heart for the evening (Talk it out now)\nKissed my cheek, moved in, you confuse things\nShould I just sit out or come harder?\nHelp me find my way (Now sing it)\nNow you caught my heart for the evening (Sing it out)\nKissed my cheek, moved in, you confuse things (Take your time)\nShould I just sit out or come harder?\nHelp me find my way (Now talk it out)",
 "image": "https://images.genius.com/3859a174d857409a1be069c917280953.600x600x1.jpg"
}