{
 "title": "Get At Me Dog",
 "album": "It’s Dark and Hell is Hot",
 "year": "1998-02-10",
 "lyrics": "Yeah, I'm right here, dog\nWhere my dogs at?\nWe right here, dog\nWhere my dogs at?\nI'm right here, dog\n\nWhat must I go through to show you shit is real?\nAnd I ain't really never gave a fuck how niggas feel\nRob and I steal, not 'cause I want to, 'cause I have to\nAnd don't make me show you what the MAC do\nIf you don't know by now, then you slippin'\nI'm on some bullshit that's got me jackin', niggas flippin'\nLet my man and them stay pretty, but I'ma stay shitty\nCruddy, it's all for the money, is you with me?\nGet the bitches and I'll commit the crime\nWhen it's on, we transform like Optimus Prime\nI'll form the head, roll out, let's make it happen\nIf we ain't gonna get it with them, we'll take your cap\nBustin' off, dustin' off the softest niggas\nMoney with the biggest mouth, yo, let's off this nigga\nUp north, this nigga never made a sound\nBreathe too fuckin' hard and you're gettin' bust down\n\nYo, yo, y'all niggas wanna be killers? (Get at me, dog)\nY'all niggas wanna feel us? (Get at me, dog)\nY'all niggas want the real (Get at me, dog)\nWhat, yeah (What the deal?)\nY'all niggas wanna be killers? (Get at me, dog)\nY'all niggas wanna feel us? (Get at me, dog)\nY'all niggas want the real (Get at me, dog)\nWhat, yeah (What the deal?)\n\nNowadays, it ain't lookin' too good for certain niggas\nI'm hurtin' niggas (What you doin'?)\nRobbin' niggas, jerkin' niggas, stickin' niggas\n'Cause they deserve it; when money got murdered\nThey know he died slow 'cause they heard it\nThe nigga ain't blew up the spot a while\nAnd the motherfucker ain't got shot in a while (You know)\nIt just takes a light up to fuck the night up (Yeah)\nBlow everything in sight up (Boom)\nFuck around and I'll have your ass right up (haha)\nHe makes up some shit, he wasn't able to stand\nI got shit that'll disable a man with the wave of a hand\nThe days are longer and it seems like I'm facin' time\nI've got a lot of dreams, but I'm not really chasin' mine\nI soak it all up like a sittin' fly 'cause nowadays, gettin' by\nIs nothin' more than an occasional meal and gettin' high\nI live to die, that's where I'm headed\nLet your man hold somethin', now it's all about you can get it\n\nY'all niggas wanna be killers? (Get at me, dog)\nY'all niggas wanna feel us? (Get at me, dog)\nY'all niggas want the real (Get at me, dog)\nWhat, yeah, yeah, come on (What the deal?)\n\nOne in the back left your faggot ass face down\nLucky that you breathin', but you dead from the waist-down\nThe fuck is on your mind? Talkin' that shit that you be talkin'\nAnd I bet you wish you never got hit 'cause you'd be walkin'\nBut shit happens and fuck it, you done did your dirt\nNiggas is wonderin' how the fuck you hid your skirt\nRight under their eyes like a surprise to the guys\nThat one of their mans was a bitch in disguise\nI'm fuckin' with cats that order more hits and slaughter more kids\nLet me holla at you, youngin', Baltimore shit (Oh)\nNah'mean? I'm just robbin' to eat\nAnd there's at least a thousand of us like me mobbin' the street\nWhen we starvin', we eat whatever's there\nCome on, you know the code in the street; whatever's fair\nBlood stains and chalk, means your man couldn't walk\nAfter the talk about him not bein' on 11-33 to New York\nTransformin'-ass niggas'll get it quick\nAnd yo, for real, that nigga K can suck my dick\nAnd it's gon' take all these niggas in the rap game to barely move me\n'Cause when I blow shit up, I have niggas fallin' like white bitches in a scary movie\nAh! You know I don't know how to act\nGet too close to niggas, it's like, \"Protected by Viper, stand back\"\nWhat's this? I thought you niggas was killers, demented\nThe fuck you want me to do with this coward?\nFinish him, it's ended\n\nYo, you holdin'? (No doubt, man)\nI'm holdin', you holdin'\nYo, let's ride, nigga, yo\nCome on, yo, we goin' to the mess hall with this shit\nFuck that, hold up, hold up, hold up, man, I gotta\nYo, man, shut the fuck up man, you ain't sayin' shit, bitch\nYou ain't hold—, you holdin'? (I got the aux, son)\nYo, 'cause I'm seein' this cat\nI'm seein' this cat up in here, man (Yo)\nThe nigga, the nigga, the nigga just came in\nTalkin' all this hardcore shit what he was doin' at the other jail\nYou know what I'm sayin'? (Fuck all that, man)\nYo, check it, I don't give a fuck (I ain't with all that problems, man)\nYo, listen, man, 'cause you, you just be talkin' shit, man\nHold up, ayo, why, why you always wanna suspect everybody, man?\nYou suspect, man, you supect, yo, just chill (You know what I mean?)\nYo, y'all niggas ridin'? (Aw man)\nYo, we gon' take this nigga on a ride (Yeah, straight up)\nStraight, rough ride\nYo, let's go, let's get the fuck up out of here\nYo, man, shut the fuck up, dog\nYo, come on, yo\nYo, what's up, nigga? (What up)\nWhat you mean \"what's up, nigga,\" you don't know me\nYo, hold up",
 "image": "https://images.genius.com/aa4292fcbc78c40a1fbb190198451006.220x218x1.jpg"
}