{
 "title": "How’s It Goin’ Down (Album Version)",
 "album": "It’s Dark and Hell is Hot",
 "year": "1998-05-12",
 "lyrics": "(*Dial tone*)\nI don't believe it\n(*Dial tone*)\nHello?\nWhose dick you sucking?\nDon't call me with that bullshit, alright?\nYou lying, you lying to me, B\nYeah, exactly\nWhose dick you sucking? Come on B, I just heard some shit about you, some foul shit, fuck is the deal?\nSuck my fucking dick, you bitch-ass nigga, I don't—\nNo, you explain it to me, bitch, you know what I'm talking about\nI don't know nobody up here, y'all don't fuck with nobody up here, and I ain't been fucking with nobody here, I don't know nobody in fucking Yonkers\nLying-ass bitch, you ain't shit\nDo I got to holler his name too?\nWho the fuck is he?\nBitch, you fuckin' him\n\nAll I want is you, all I want (Uh, uh)\nAll I want is you, all I want\n\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me, or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt, what? (All I want)\n\nI'm politicin' with this chicken, wonderin' if I'ma creep her\nLittle hoodrat bitch from 25th named Tenika\nComin' through, like I do, you know, gettin' my bark on\nKnew she was a thug, 'cause, when I met her, she had a scarf on\n54-11, size 7 in girls\nBaby face, would look like she was eleven with curls\nGirlfriend (What?)\nRemember me from way back?\nI'm the same cat with the wave cap\nThat motherfucker that TNT used to blaze at (Woo)\nStill here, so it's all good\nOh, you know my niggas Rich and them doin' they thing on 35th? Damn, it's a small hood\nAnd it's all wood, so let me get that number, I get up (Aight)\nHit you on the jack later on, see what's up\nTalkin' to shorty make me wanna do somethin' nice (What?)\nLookin' at that ass make me wanna do somethin' tonight (Uh)\nAnd I know right when I see right, shorty lookin' like she tight\nAnd she bite, better give a nigga the green light, we might\n\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me, or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt (All I want)\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me, or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt, what? (All I want)\n\nI'm gettin' at shorty like, \"What you need? What you want?\" (Huh?)\nWant for nothin', 'cause I got you, but you front (True)\nI see you with your baby father, but it don't matter\nSince you gave me the pussy, that ass is gettin' fatter (Woah)\nLet that nigga play daddy, make moves with me\nI've done kept it more than real, boo, can't lose with me (True)\nHeard he smacked you 'cause you said my name while y'all was sexin' (Woah)\nRan up on this cat he thought was me and started flexin' (Uh)\nYou know I ain't even with that, so he gon' have to get that just on GP\nTry to creep me (What?), leave that nigga sleepy\nOn the strength of you, well, that's your kid's daddy\nI ain't gon' send him on his way, put him up in that big Caddy\nBut let him know, never mind, yo, I need you to go\nTake this snow up to 1-5-0, see Joe\nGet that, come back with that, and we can split that, sit back\nFuck, puff a L, forget that, you with that?\n\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me, or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt (All I want)\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt, what? (All I want)\n\nAyy, yo, this chicken got me diggin' her moves 'cause she's smooth\nWin or lose, whoever she choose, gets the dues (Aight)\nRespect is not expected, but it's given 'cause it's real (Uh)\nBeing neglected's the norm, expected, the deal (True)\nLie, cheat, and steal for me\nPuttin' somethin' in a nigga's wig if he squeal for me\nKill for me, you're still with me?\n'Cause we get down, like, \"What?\"\nTold you's from the door, it ain't all about a nut\nI'm gon' be fair, tryin' to be there, we gon' see then\nHit me with the question, boo, that answer gon' be \"Yeah\"\nSee there, somethin' can go wrong, it does\nLoved it, let it go, and it came back, that's how strong it was\nBut she belonged to cuz, couldn't belong to me (Uh-uh)\nShe had two kids by this nigga, it was wrong for me (Uh-uh)\nBut we gon' always be best of friends (Ha-ha)\nMad love, boo, 'til the end (Ha-ha)\n\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me, or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt (All I want)\nWhat type of games are bein' played? How's it goin' down? (All I want is you)\nIt's on 'til it's gone, then I gots to know now (All I want)\nIs you with me, or what? Think I'm trying to get me a nut (All I want is you)\nJust 'cause honeys wanna give me the butt (All I want)\nWhat type of games are bein' played? How's it goin' down?\nIt's on 'til it's gone, then I gots to know now\nIs you with me, or what? Think I'm trying to get me a nut\nJust 'cause honeys wanna give me the butt\nWhat type of games are bein' played? How's it goin' down?\nIt's on 'til it's gone, then I gots to know now\nIs you with me or what? Think I'm trying to get me a nut\nJust 'cause honeys wanna give me the butt, what?\n\nUh",
 "image": "https://images.genius.com/cac665211a75317d7488233d8f519b0b.1000x1000x1.jpg"
}