{
 "title": "Lookin’ At Me",
 "album": "Harlem World",
 "year": "1997-10-28",
 "lyrics": "Hey yo Mase, you know what I don't like?\n(Why you over there lookin' at me)\nI don't like when, you know, I'm in a club\n(Why you over there lookin' at me)\nAnd I'm with my honey\n(Why you over there lookin' at me)\nYou got, you know, the haters\nThey wanna be tough guys all of a sudden\n\nWhy you over there lookin' at me\nWhile my girl standin' here?\nWhy you over there lookin' at me\nWhile my girl standin' here?\n\nHit you with the ice grill, you know\nHaha, 'cause your boys ain't with you\nLittle do they know, the girl roll harder than\nSome of yo' niggas\nYou dig?\n\nNow what the hell is you lookin' for?\nCan't a young man get money anymore?\nLet my pants sag down to the floor\nReally do it matter as long as I score?\nCan't my car look better than yours?\nCan I have a bad bitch without no flaws\nCome to see me without no drawers\nIn a stretch Lex with about ten doors?\nI was Murda, P. Diddy made me pretty\nDid it for the money, now can you get with me?\nPeople wanna know who is he, he get busy\nSpray so much izzy, girls get dizzy\nNiggas on the block know Mase motto\nOne thing about Harlem World, we all got dough\n'98 Tahoe, Tommy and a Roscoe\nCase I'm ever chased by Donnie Brasco\n\nWhy you over there lookin' at me\nWhile my girl standin' here?\nWhy you over there lookin' at me\nWhile my girl standin' here?\n\nYo, I can't get mad 'cause you look at me\n'Cause on the real, look at me\nYo, it always be the haters that be sittin' in the rear\nDissin' every year, but they better listen here\nYou cats keepin' it real, you cats is on your own\n'Cause bein' broke and alone is something I can't condone\nPlus it won't be long 'til they send me the dome\nSit gently, while I'm on the Bentley phone\nWhy you don't like me? 'Cause I'm mad fly and icy?\nAnd why you can't satisfy your wifey\nAnd if it wasn't for this Bad Boy exposure\nCD, TV's, really would I know ya?\nNow me and Blink float in a gold Rover\nSo it's only right you get the cold shoulder\nAnd if you got a girl, don't be real committed\n'Cause Mase will hit it, you got to deal with it\n\nWhy you over there lookin' at me\nWhile my girl standin' here?\nWhy you over there lookin' at me\nWhile my girl standin' here?\n\nMake it hot baby, make it hot (Come on)\nMake it hot baby, make it hot (Come on)\nMake it hot baby, make it hot (Come on)\nMake it hot baby, make it hot (Come on)\n(We don't stop)\n\nWe was all at the Greek Fest, it's hot and sandy\nI rent scooters, I'm with my family\nTank top, flip flop, really nothing fancy\nBut get approached by a girl named Tammy\nWho look good enough to be Miss Miami\nBut say since some her peeps call her Candy\nThan she starts to ask about Aaliyah and Brandy\nTellin' me how she met Puff down at the Grammy's\n\"He ain't tell you I was the one with no panties?\"\nBoo, you know how many he meet with no panties?\nPlease, tell me something that I don't know\nLike if we have sex, you don't want dough\nAnd if it's not a problem you can meet me at 10\nI'll be in room 112 and bring four friends\nAnd if you gon' hit me, it gotta be a quickie\nAnd please no hickies, 'cause wifey's with me\n\nWhy you over there lookin' at me\nWhile my girl standin' here?\nWhy you over there lookin' at me\nWhile my girl standin' here?\n(Repeat until fade)",
 "image": "https://images.genius.com/9965e864219990f90a06ad656e3fe998.1000x1000x1.png"
}