{
 "title": "Money, Power & Respect",
 "album": "Money, Power, & Respect",
 "year": "1998-03-17",
 "lyrics": "See, I believe in money, power and respect\nFirst you get the money, then you get the motherfuckin' power\nAfter you get the fuckin' power, motherfuckers will respect you (What's the key to life?)\n\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, you can sleep at night\nYou'll see the light, what's the key to life?\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, money, power and respect\nMoney, power and respect\n\nAyo, my whole clique 'bout it, 'bout it\nWe take yours while you pout about it\nTruck, step out, the whores wanna crowd around it\nYou could see me on Optimum TV\nGo in your bathroom turn the light out\nScream, \"Bloody Mary, 1, 2, 3\"\nSheek ain't your usual friend\nBut I could set you up like Keyser and walk straight at the end\nI'm done with ice and charms\nI'm tryna ice my whole casket when I'm gone\nPull up with class on the don, once I meet 'em I greet 'em\nKiss his feet for freedom, tell em' thank you Lord\n'Cause on Earth I was gettin' bored\nNow resurrect me back to this cat called Sheek\nSo I can make this album and get back the cats that's weak\nTwo-thirty, six two\nMe budge for you? That's like a cat vers' a pitbull\nGun, know clip full, keep hunger\nAnd plan for the future, 'cause you figure you gon' be older\nWay longer than you gon' be younger (What's the key to life?)\n\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, you can sleep at night\nYou'll see the light, what's the key to life?\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, money, power and respect\nMoney, power and respect, it's the key to life\n\nOnly time could tell how the clock tick\nI'm really loved here, but I'm still a hostage\nTwo personalities, check the posture\nSmoke out the mouth clear out the nostrils\nThink of death, then life seem scary\nI'm passin' graveyards seein' people Hail Mary\nI ain't chillin' 'til I'm out parachutin'\nRace my man in mountain climbin' for about ten diamonds\nTwenty five thousand a piece, fuck streets\nTryin' to own the island, forget about wildin'\nTry ridin' in the car that be glidin'\nIf I showed you where I lived, you would think I was hidin'\nSling dick to chicks that don't speak English\nWake up in Trinidad like, \"Fuck it, I'm rich\"\nCome back, private jet, live on set\nIf you can shit gold, then I can spit baguettes (What's the key to life?)\n\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, you can sleep at night\nYou'll see the light, what's the key to life?\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, money, power and respect\nMoney, power and respect\n\nNothin' but the hotness whenever we drop this\nMonotonous for y'all to keep hatin' 'cause y'all never gon' stop us\nI keep my rocks spotless and my hoes topless\nTake time, try to figure out who The Lox is\nFear no one, kick rhymes like shoguns\nYou scared to blow one, get robbed with your own gun\nIf I don't respect you I'ma check you\nAnd if I don't kiss you I'ma peck you\nRight before I wet you I sneeze on tracks and bless you\nI'm special and if you like workin' out then I'm gon' stretch you\nHustlin' is dead, but we still get red\nTurn the spots into bakeries to get back bread\nAnd y'all said my money's spent, but it's in the Bent'\nSo when the Feds come, the dogs can't get a scent\nAnd my story, self-explanatory\nThat I'm the hottest thing on the street\nAnd y'all ain't got nothin' for me (What's the key to life?), yeah\n\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, you can sleep at night\nYou'll see the light, what's the key to life?\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, money, power and respect\nMoney, power and respect\n\nThis is a beat that I can freak to, just drop the reels\nBless a nigga with the ill, y'all niggas know my skills\nX in their grills, hit 'em up, split 'em up\nWet 'em up and watch 'em come get 'em up\nSet em' up, when you do dirt, you get dirt\nBitch, I'll make your shit hurt, step back like, \"I did work\"\nThis ain't no fuckin' game, what, you think I'm playin'?\n'Til you layin' somewhere in the junkyard decayin'\nMoms at home prayin' that you comin' home, but you not\n'Cause you sittin' up in the trunk, startin' to rot\nAnd hell is hot, I know because I'm here now, baby\nIt's goin' down, baby, get the four pound, baby\nAnd let off up in a nigga\nEspecially if he think he bigger than my motherfuckin' trigger\nDead eye, can I get mine? Is he gone?\nDMX representin' one time, put us on (What's the key to life?)\n\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, you can sleep at night\nYou'll see the light, what's the key to life?\nMoney, power and respect what you need in life\nMoney, power and respect, you'll be eatin' right\nMoney, power and respect, money, power and respect\nMoney, power and respect",
 "image": "https://images.genius.com/d6af7bb13f698c7aceff0457a27ded89.500x487x1.jpg"
}