{
 "title": "Still Po Pimpin’",
 "album": "Headz or Tailz",
 "year": "1998-03-10",
 "lyrics": "Do you wanna ride with me (yeah, ooooooh)\nDo you wanna smoke my B (ooooooh)\nNever can't you take my G's\nMyyyyyyyy.. (ooooooh)\n\nI ain't trippin got the split up the front\nApproach you with a limp while I hit on the blunt\nYour pager goin off? (awe, that ain't nuthin)\nMeet me at the crib bout 2, stop frontin\nBlow even though that the clique's on somethin\nTryin to cut me up, yeah the trick's on somethin\nThe corner of the parlor with them niggas they bumming\nReachin for the gin and the Hen in my stomach\nI'm lookin at the do' females still comin\nLookin to my left and the B's still comin\nLookin to my right and the drinks still comin\nTryin to shake the dice but the girl lookin cunnin\nCirclin the do' where the money start runnin\nTook a pause, hey y'all wassup\nHead hunters in the double-R, is it a double car\nPulled over to the car\nSo I, ashed Proceeds, to pass the B's, low cash\nChorus: Johnny P (repeat 4X)\nDo you wanna ride with me?\nDo you wanna smoke my B's?\nNever could you take my G's\nI'm a Po P-I-M-P\n\nWhat it be like?\nP-I, M-P, hoes - plenty\nComin straight from the Windy\nChoppin up tens and twenties, MMMM!\nLean back in the corner with the Dobb hat\nNominated just to ball like a Democrat\nIn the cut with hoes, and I suppose\nThat I've been chose, to mingle with the hoodrats\nMmm, mmm, mmm, mmm - got it down packed\nYou call it what you want I'm keepin all that\nI been taught by the best, so put it to rest\nAnd I confess, I'm living just to ball black\nGettin paid in the game made me roam free\nFlip a penny to a dime I'm like an O-G\nGo to the mall, with all of y'all\nShow you some cash, now, tell me what you want B\nYou can ride or just smoke in the Cadillac\nA/C, windows down, with the top back\nFrom a Caddy to Lex' to Rolex\nI'm a put it in a roll, tell me could you top that?\nEver though I'm making money you the wrong freak\nNickel dime or a twenty don't approach me\nIf you do, we could have sex, in the Caddy or a Lex\nBut keep on the low-key\nChorus\n\nWell a motherfucker used to say I might be broke\nBut now I'm stackin C-notes, still dope\nDifferent strokes, same folks; hangin from a rope\nMe and Do or Die just try to cope\nSit back I might come let ya take a toke\nTake a stroll through the hood\nIt's some haters but it's still all good\nRoll up another blackwood, playa pimpin to the groove\nIn the place to be to see who I can choose\nNow it's time for me to make a move\nShawty what's the deal?\n\nI done seen your sexy walk on the Pharcyde\nSo don't be \"Passin' Me By\"\nI'm a nigga with P's and I ain't stingy with the trees\nWe could be some freaks and both of our ass could be high\nFe's drips at us full of octane\nWith pimp status and a hot name, we don't gotta pop thangs\nThey was serving the rock 'caine, then I came\nFlippin flows like hoes when Twista drop game\nIt's like, awww suki suki now, lookie here\nSing a phrase while I trace on my hog road\nDevine words form the pimp scroll\nGet the bitch if I'm walkin and she peepin that my limp's cold\nSee a playa po' trippin, deep as the Mediterranean\nTrying to play me in slow-vision\nPicture how I'm mackin cold women\nBendin and grinnin my head spinnin\nWhile we smokin on hemp, we still po' pimpin'\nRefrain: Johnny P (repeat 2X)\nDo you wanna ride, slip inside of your thighs\nOooh-oh, oooh-oh, oooh-ohhhhh\nChorus\n\nWooooh-ooahahhhohhhh!\nDo you wanna riiiiiiiiide with JP\nDo or Die, whoahhhh-oahhhh..",
 "image": "https://images.genius.com/14f8d496a0d9091728fd44f0d2326397.1000x1000x1.jpg"
}