{
 "title": "The First Night",
 "album": "The Boy Is Mine",
 "year": "1998-07-07",
 "lyrics": "Come on\nBaby, baby, tell me what's up?\nCan you hear me or do I, do I need to turn it up?\nHuh? Huh?\nBaby, baby, tell me what's up?\nCan you hear me or do I, do I need to turn it up?\nHuh? What?\nBaby, baby, tell me what's up?\nCan you hear me or do I, do I need to turn it up?\nHuh? Huh?\nBaby, baby, tell me what's up?\nCan you hear me or do I, do I need to turn it up?\nHuh? Huh? What?\n\nBoy, this evening, was it only me?\nFeeling completely down to be open\nDown to be open for some satisfaction\nDidn't wanna say yes, afraid of your reaction\nI knew it was wrong for feelin' this way\nEspecially the thought of gettin' in on the first date\nCouldn't let go, it stayed on my mind\nAt the end of the night, I had to decide\nI was thinkin'\n\nI should make a move but I won't (I should, I should)\nI know you're probably thinking something is wrong\nKnowin' if I do that it won't be right\nI don't get down on the first night\nI should make a move, but I won't\nI know you're probably thinking something is wrong\nKnowin' if I do that it won't be right\nI wanna get down, but not the first night\n\nWe were chillin', watching your TV\nI thought you was coming close as you got to me\nWanted to touch you, wanted to kiss you\nAnd somehow, in one night, discover I love you\nFelt so right, but it felt so wrong\nAnd look how we are carryin' on\nTryin' to say things to get me to stay\nBut my watch tells me it's gettin' too late\nI'm thinkin'\n\nI should make a move, but I won't (I should, I should)\nI know you're probably thinkin' something is wrong (No way)\nKnowin' if I do that it won't be right\nI don't get down on the first night (I don't, I don't get down, baby)\nI should make a move, but I won't\nI know you're probably thinkin' something is wrong\n(You're probably thinkin' something is wrong)\nKnowin' if I do that it won't be right\nI wanna get down, but not the first night\n\n(If) If you want me\nYou got to know me (You got to know me)\nAnd if you want my love (My love)\nYou gotta win my love\n\nHey, baby\nThat's the way it's got to be, yeah\nGet to know me (Get to know me)\nSo we can do this\n\nI should make a move\nI know you're probably thinkin' (I won't, I won't, babe)\nKnowin' if I do (I won't, I won't, baby, yeah, yeah)\nI don't get down on the first night\nI should make a move, but I won't (No, no, no)\nI know you're probably thinkin' something is wrong (No, no, no)\nKnowing if I do that it won't be right\nI wanna get down, but not the first night\nI should make a move, but I won't (I should make a move)\nI know you're probably thinkin' something is wrong\n(Probably thinkin' something's wrong)\nKnowing if I do that it won't be right (No, no, no, yeah, yeah, yeah)\nI don't get down on the first night (The first night)\nI should make a move, but I won't (I should, baby)\nI know you're probably thinkin' something is wrong (I should baby, yeah, yeah)\nKnowing if I do that it won't be right\nI wanna get down, but not the first night (No, no, no, no, no)\n\nI should make a move, but I won't (Oh yeah, yeah, yeah)\nI know you're probably thinkin' something is wrong\n(You're probably thinkin' something is wrong)\nKnowing if I do that it won't be right (No, no, no, no)\nI don't get down on the first night\nI should make a move, but I won't\nI know you're probably thinkin' something is wrong\nKnowing if I do that it won't be right\nI wanna get down, but not the first night",
 "image": "https://images.genius.com/a449cce1da2765a8589a7b6c5b11ece9.600x605x1.jpg"
}