{
 "title": "What About Us (Remix)",
 "album": "Kima Keisha and Pam",
 "year": "1998-10-27",
 "lyrics": "Yeah, uh\nYeah, uh\nYeah yeah yeah\nYeah, come on\nI like the way it's goin' down\nI ain't done a remix in a long time\nI like to make it hot\nI like to make it real hot\nBlack Rob, come on\n\nAye yo, who dat, comin' through my block like that\nOh, nobody but that Bad Boy cat\nWhat's his name?, Black Rob\nYa'll heard duke was famous\nMoney-soft, Puffy joints, Total house the ladies\nIt's bangin' in the clubs, oh my good\nYa'll be wishin' that those brothers came through my hood\nTake a diffrent approach, just play respect the coach\nThat's Black, since I'm rollin' wit' Total\nThat's that\n\nBaby, seen you lookin' at other ladies\nJust finished having your baby\nWhy'd you have to go, go and leave me\nBaby, you know I'm about to be swazy\nCan't stop my lover from being shady\nWhy'd you have to go, go and leave me\n\nWhat about you?\nWhat about me?\nWhat about us?\nWhat you gon' do?\nTotal help me sing\nWhat about you?\nWhat about me?\nWhat about us?\nWhat you gon' do?\nWhat we gonna do\nWhat we gonna do (yeah)\n\nBaby, I know that you've been pimpin'\nMr. Baller, trickin'\nWhy'd you have to go, go and leave me\nBaby, I always been your baby\nLove makin' this girl go crazy\nI can't understand, why you left me... uh-hmm\n\n\nI remember we used to spend\nCountless nights, you were my best of friends\nOur love, could be one that never ends\nWhatever happened to yours\n\nAye yo, what about you, what about me\nI'm tryin' to get dough, nothin' come for free\nAnd I know you like the way, Black flava parlay\nI slide like a man, with gators on Parcae\nFloors, it's me who hordes the door like Prince\nNavigator Doo Doo Brown, the quint wit' light tint\nMe and Mruder, gotta be the cheddar we seein' first\nOh I ain't gonna spit one verse (one verse)\nSometimes I feel cursed, ya'll dson't want me to rise\nDough in the purse\nRather see me faze down, in the back of a hursh\nBut I reufse to lose, don't batter the bruised\nThrow mine's, to get my grill on the 6 o'clock news\nWe be smoke, pretty E wit' D in E-class\nSpittin' flase information, I know gone need back-up\nTill you can't, Black Rob heavyweight champ\nWhen I strike, I'm gonna leave Bad Boy stamp, come on (what about us!)",
 "image": "https://images.genius.com/cdbdd8f9f4ce0503df8795f19944db1e.594x594x1.jpg"
}