{
 "title": "Who Am I? (Sim Simma)",
 "album": "Many Moods of Moses",
 "year": "1997-12-09",
 "lyrics": "Yes nyah!\nCool nuh, Iyah\nHahaha\nWho am I?\nIt's the girls dem sugar\nAlright\nHear yah nuh\n\nSim Simma, who got the keys to my Beamer?\nWho am I, the girls dem sugar\nHow can I, make love to a fellow?\nIn a rush, pass mi the keys to my truck\nWho am I, the girls dem luck\nAnd I and I will make love to precious\n\nYou ever buck a gal weh deep like a bucket?\nDraw fi your needle, and your needle can't stitch it\nDraw fi your axe, and like a cow, you all a chop it\nDraw fi your pick axe, and like a ground, you all a dig it\nIt's like a riverside, upon di banking you take it\nIt's like a bicycle, so you hold it, and dash it\nNow you wash it, so you crash it, she a tell you say, \"Your crabbit!\"\nGyal, she a beg you and a bawl say fi, \"stop it\"\nBadman plug in and mi a move off a electric\nIt's like a basketball, she take time-out fi vomit\nUnuh listen to mi style, and unuh fi listen to mi lyrics\nA Beenie Man deh yah, me a drop it (a say!)\n\nSim Simma, who got the keys to my Beamer?\nWho am I, the girls dem sugar\nHow can I, make love to a fellow?\nIn a rush, pass mi the keys to my truck\nWho am I, the girls dem luck\nAnd I and I will make love to precious\n\nBut anything she wants, I will give it unto she\nI can't believe the day my friend dem tell me that she flee\nI don't believe it's angry, and I don't believe it's grief\nI don't believe it's Susan, or the other girls I breed\nThe love for me she have, that is the only thing I need\nI don't think den right now, just to lose my main squeeze\nOh Guantanamera, you a killer!\nGyal, the way you hot, you have mi body under pressure\nMan see your body, all a kill mosquito\nWoman your body right, just fi know you got di power\nBut..\n\nSim Simma, who got the keys to my Beamer?\nWho am I, the girls dem sugar\nHow can I, make love to a fellow?\nIn a rush, pass mi the keys to my truck\nWho am I, the girls dem luck\nAnd I and I will make love to precious\n\nBecause!\nI tell myself I don't want nobody else to ever love me\nYou are my guiding star, my shining light, I love you baby\nBut that day you leave and gone\nI know that girls they're going crazy\nI know the girls lump some, all of dem run\n'Ccause di whole a dem want this baby\nI told you once and I told yuh twice\nThat I am the girls dem sugar\nNow the girls dem attack me\nAnd di girls dem a rush mi\nBecause dem a drive in a bimmer\nA di girls dem flavour\nI am no slaver I am the helper\nNo paper an a girl just watch\nYah a want unuh hear yah an listen weh di DJ seh\n\nSim Simma, who got the keys to my Beamer?\nWho am I, the girls dem sugar\nHow can I, make love to a fellow?\nIn a rush, pass mi the keys to my truck\nWho am I, the girls dem luck\nAnd I and I will make love to precious",
 "image": "https://images.genius.com/464fa6a453ca19bccc9d83bdb4ff17d7.953x953x1.jpg"
}