{
 "title": "Get Money",
 "album": "Conspiracy",
 "year": "1995-08-29",
 "lyrics": "Fuck bitches, get money (What?)\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money (Uh, check it out, uh)\n\nYou wanna sip Mo' on my livin' room flo'\nPlay Nintendo with Cease and Nino\nPick up my phone say, \"Poppa not home\"\nSex all night, mad head in the morn'\nSpin my V, smoke all my weed\nTattoo on titties sayin' \"B.I.G.\", now check it:\nYou wanna be my main squeeze, baby\nDon'tcha? You want to give me what I need, baby\nWon'tcha picture life as my wife? Just think\nFull-length mink, fat X and O links\nBracelets to match, conversation was all that\nShowed you the safe combinations and all that\nGuess you could say you'se the one I trusted\nWho would ever think that you would spread like mustard?\nShit got hot: you sent Feds to my spot\nTook me to court, tried to take all I got\n'Nother intricate plot, the bitch said I raped her\n\"Damn, why she wanna stick me for my paper?\"\nMy Moschino hoe, my Versace hottie\nCome to find out you was fuckin' everybody\nYou knew about me, the fake ID\nCases in Virginia, body in D.C\nWoe! Oh is me - that's what I get for trickin'\nCame out on bail, commence the ass-kickin'\nKick in the door, wavin' the .44\nAll you heard was \"Poppa don't hit me no more!\"\nDisrespect my clique, my shit's imperial\nFuck around and made her milk box material\nYou feel me? Suckin' dick, runnin' your lips\n'Cause of you, I'm on some real \"fuck-a-bitch\" shit, uhh\n\nFuck bitches, get money (What? Ain't seen none of these girls)\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money (Uh)\nFuck bitches, get money (Whoo, look at me)\nFuck niggas, get money (Whoo, I told you niggas)\n\nNiggas, better grab a seat\nGrab on your dick as this bitch gets deep\nDeeper than the pussy of a bitch 6 feet\nStiff dicks feel sweet in this little petite\nYoung bitch from the street, guaranteed to stay down\nUsed to bring work outta town on Greyhound\nNow I'm Billboard bound, niggas press to hit it\nPlay me like a chicken, thinkin' I'm pressed to get it\nRather do the killin' than the stick-up juxs\nRather count a million while you eat my pussy\nPush me to the limit, get my feelings in it\nGet me open while I'm cummin' down your throat\nThen, you wanna be my main squeeze, nigga\nDon'tcha? You wanna lick between my knees, nigga\nDon'tcha want to see me whippin' your 3 down the Ave?\nBlow up spots on bitches because I'm mad\nBreak up affairs, lick shots in the air\nYou get vexed and start swinging everywhere\nMe shifty? Now you wanna pistol whip me\nPull out your 9 while I cock on mine\nYeah, what nigga? I ain't got time for this\nSo what, nigga? I'm not tryin' to hear that shit\nNow you wanna buy me diamonds and Armani suits\nAdrienne Vittadini and Chanel 9 boots\nThings that make up for all the games and the lies\nHallmark cards sayin' \"I apologize\"\nIs you with me? How could you ever deceive me?\nBut payback's a bitch, motherfucker, believe me\nNah, I ain't gay, this ain't no lesbo flow\nJust a lil' somethin' to let you motherfuckers know\n\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money\nFuck bitches, get money\nFuck niggas, get money",
 "image": "https://images.genius.com/ef731b6d54b33afcae6b55c0feb75e3f.1000x979x1.jpg"
}