{
 "title": "Po Pimp",
 "album": "Picture This",
 "year": "1996-09-03",
 "lyrics": "Do you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\n\nIt was seven double-oh P.M\nFly low to them hoes in the B-M\nSipping Seagram, chewing on a weed stem\nTouching on my fo' fif\nMove it to the back so I can see who beeping this Po Pimp\nSpring to the phone with a slow limp\nIn a trip that shitted with 3-1-2-7-6-2-10\nThree-line connection\nAs the rest of them wanted affection\nJust bring the weed, we got the drinks you need\nAnd, plus, we strapped with two protections\nI put the phone in the hook, then I pause for a minute\n'Cause I forgot where I met the ho\nAnd the feeling I've forgotten if the hoes wanna snap\nI straight up check the ho, really doe\nTo the crib\n\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\n\nSeven deuce five, I ride the point to spot the live hoes\nThree miles per hour\nLike we running up on some rivals\nNever to deny though, these bitches look fly, 'Lo\nIntroduce myself\nA-to-the-motherfucking-K, better recognize\nThen I loose myself, juice myself\nAs you take one pull, uh, pass it to the left and um\nSelf-centered niggas'll take two pulls cause they thinking about self and um\nP-I, M-P, -ology, but logically\nWe learning these hoes biology, and obviously, well\nMmm, ain't this some shit, pull up in the C-A\nD-I, double-L, pumping A-C, A see hoes\nThey peep those, P-I, M-P, and they think that automatically\n'Cause he's a pimp, he gotta be full of that\nM-O, N-E, but why?\nCause nigga be sporting nice cars and fancy clothes\nFresh jewels, Girbaud, flexing one five oh\nChop up that paper, ho, chop up that paper, ho\nWatch where your lips go, caress my tip slow\nTo the tempo, instrumental\nReal simple when you fucking with a pimp, doe\nGet involved in the backseat\nThat's how it be in the Cad when you messing with them young lads\nSmoking on that finest grass\nNever miss what you never had, at last\nP-I, M-P, -ology, but logically\nWe learning these hoes biology, and obviously, well\n\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\n\nWell, a motherfucker might be broke and shit\nAnd then collecting no dough from tips\nBut I be spitting mo' game than a mouthful of poker chips\nTo get them hoes with the open lips and the provoking hips\nAnd never gotta tell her many lies\nHave them looking in the city skies, get up in the kitty's thighs\n'Cause I'm blessed with a look of innocence, good sex\nPeanut butter complex and some pretty eyes\nPity cries on my strategy side, yo anatomy gotta be right\nThat'd be to flatter me, right\nBut if the head the bomb, c'mon, suck a nigga dick\nMembers of my clique wanna see what that'd be like\nI know you wanna try that, to the rhythm of a hi-hat\nDon't be bogus and deny that\nI done got a ho to let my fellas run a train\nWhile she lie back, now motherfucker can you buy that?\nWhere your ride at?\nOn the passenger side of your ho\nTrying to come up on another G\nThe broad all up under me, trying to smother me\nLooking lovely while I roll another B, suddenly\nShe learned that I don't deal with emotions\nBut when we in the room, she rubbing me with lotion\nComing like an ocean, coasting, have her sick\nThinking me and Do or Die dig drinking love potion\nThe word no was never said\nTwista be giving women dick in the bed, until they sick in the head\nAnd if I ever leave whoever dead\nThey ain't tricking the feds or spitting game, but it's chicken and bread\nKicking them legs in the air like a playa do\nThen belittle in a day or two\nAfter words I'mma slay a crew\nNow that's some pimp-type shit that Belo and AK'll do\nWearing gray and blue\nIf a ho wanna holler, then you a playa if you hit them ends\nAnd get the dividends\nBut you a pimp if you can get the same ho to wanna freak your friends\n'Cause I studied P-I, M-P, -ology, but logically\nBe learning these hoes biology, obviously, well\n\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die\nDo you wanna ride\nIn the backseat of a Caddy?\nChop it up with Do or Die",
 "image": "https://images.genius.com/87d8edf302b3729ad5a206e2e54cb9a9.400x390x1.jpg"
}