{
 "title": "Tres Delinquentes",
 "album": "Delinquent Habits",
 "year": "1996-06-04",
 "lyrics": "I flex my brazos hardcore down for the clicka'\nWho's that eminating funk through the speaka'\nBass gets to thumpin' \nrucas\n get to pumpin'\nWho's that rockin' got the party start jumpin'\nBlastin' through hah no need for the booyaa\nRight hammer with the one knuckle eye-shot through ya\nStep to the crowd, I feel the strain'\nThrow chingazos\n in the mosh pit, feel the pain\nSo don't get in my way baby\nBecause the Guero loco came in here to play baby\nMy shit will pump up this jam hot damn it's the baddest\nTres Delinquentes step into the madness\n\nGet funky, get funky, get funky\nGet funky, get funky, get funky\n\n¿Qué ondas, muchacho?\n \nAhí vienes, te miro\nSi me traes bronca me a loco de a tiro\nMe paro, te tumbo, no es tu rumbo\nY con el lingo, tal vez te confundo\nOh shit, it's the attack of the five foot ten\nThe Blaxican once again with the cocked hair pin\nAs I emerge from the depths of the realm my son\nI got the black gat fat track coke and rum\nOtra vez ya lo vez\n and the crew somos tres\nOne Blaxican on the squad you don't test\nHittin' hard like an Aztec, swift like a Zulu\nThat's what it's like with a palm shot through you\nMy mannerism mild still the punks get piled\nMy number one assassin flips the mad funk styles\nMe I play the back role but I'm delinquente\nThis is how I freak it when I'm speaking to the gente\n\nGet funky, get funky, get funky\nGet funky, get funky, get funky\n\nWhatcha\n trucha, calmate escucha\nSomos delinquentes tu no quieres lucha\nBut we freak it this way seguí sendo rey\nO.G. freaks the beat the mariachis play\n\nFade it in with snare from ASR-10\nProducer mas mejor it's O.G. Style again\nFreak it, bump it, bass out the carro\nO.G. he's got more BOOM BOOM than Charo\nThird of tres brings cuts to your face bro\nHold down the needle with a penny or a peso\nSee all our style used to create\nWith one turntable and a broken 808\n\nGet funky, get funky, get funky\nGet funky, get funky, get funky",
 "image": "https://images.genius.com/5aeff7d40b01b415fbad4bac852dfe60.459x459x1.jpg"
}