{
 "title": "Who Do U Love",
 "album": "Deborah Cox",
 "year": null,
 "lyrics": "Hmm...\nOh, oh...\nOoh, ooh...\nOh, yeah...\nOh, oh...\nLast night, I slept alone - I stayed at home\nFor the first time since you've been gone, baby...\nNo friends to understand, to lend a helping hand\nTo ease the greatest pain I've ever known...\nHow you walked away so easily still remains a mystery to me;\nDon't you remember that you promised me? Yes, you promised me that you'd never leave, boy...\nBut you went away, baby, and it's such a shame;\nHow could you turn your back on me? Oh...\n(If you really don't want me,) If you don't want me... (if you really don't need me,) If you don't need me...\n(If you really don't love me, then who do you love?) Tell me who do you love, boy?\n(If you really don't want me,) If you don't want me... (if you really don't need me,) If you don't need me...\n(If you really don't love me, then who do you love?)\nI gave, gave everything a man could ever need;\nI was there whenever you would call me, baby...\nBut somehow, your feelings changed, you don't act the same;\nI guess you're not the man that I once knew at all...\nHow you walked away so easily still remains a mystery to me;\nDon't you remember that you promised me? Yes, you promised me that you'd never leave, boy...\nNow the love is gone, baby - tell me what went wrong?\nHow could you leave me hanging on? Oh, baby...\n(If you really don't want me,) If you don't want me... (if you really don't need me,) Oh, oh, oh...\n(If you really don't love me, then who do you love?) Tell me who do you love? Yeah...\n(If you really don't want me,) If you don't want me... (if you really don't need me,) If you don't need me...\n(If you really don't love me,) Tell me, yeah... (then who do you love?) Ooh, oh!\n(If you really don't want me,) If you don't want me... (if you really don't need me,) If you don't need me...\n(If you really don't love me, then who do you love?) Tell me who do... who do you love, boy?\n(If you really don't want me,) If you don't want me... (f you really don't need me,) Oh, no...\n(If you really don't love me, then who do you love?) Tell me who do you love?\nI once was blind but, baby, now I see, yeah, (Now I see...)\nThat I'm not the one who can fill your every need... (Fill your need...)\nI painted a picture so clear, it's reality; (Reality...)\nNow I know, yes, I know, that you're not the one for me...\nOh, baby!\n(If you really don't want me, if you really don't need me,) Oh, yeah!\n(If you really don't love me, then who do u love?) Who do you love, baby?\n(If you really don't want me,) If you don't want me... (if you really don't need me,) If you don't need me...\n(If you really don't love me, then who do you love?)\nHow could you walk away from me? Baby, you promised you'd never leave!\nSlept alone since you've been gone - the greatest pain I've ever known... (Who do you love?)\n(If you really don't want me...) Oh, baby, oh, baby, oh, yeah...\n(If you really don't love me, then who do you love?) Oh, oh, baby!\n(If you really don't want me, if you really don't need me,) If you don't love me...\n(If you really don't love me, then who do you love?) Tell me, tell me, who do you love, boy?\n(If you really don't want me,) Oh, baby... (If you really don't need me,) If you don't need me...\n(If you really don't love me, then who do you love?)",
 "image": "https://images.genius.com/f83989f000933712a9c56848e27a8428.450x480x1.jpg"
}