{
 "title": "Crickets",
 "album": "Crickets EP",
 "year": "2013-04-30",
 "lyrics": "So, I told her like oh darlin'\nI feel like I am fallin’\nI think I’m in whatever, it is they call it\nI’m talkin’ bout love\nMy friends say I’m trippin but baby I don’t really give a fuck\nOh, oh. Pardon my french girl I just wanna know what’s up\nI told her we should kick it\nBut all I heard was crickets\n\nI’m like “Girl whatcha doin for today?”\nIm thinking maybe me and you should go and run away\nAnd now I don’t believe in love at first sight\nBut after seein’ you baby maybe I might\n'Cause when you walked by. I knew you we’re my type\nThe apple of my eye. You’re flyer than a kite\nOkay alright, I know that was kinda corny\nBut (but) I’m just warmin’ up\nLook at you, look at you, all dolled up\nLook at me, Look at me, gettin’ caught up\nGoin’ down, goin’ down, yeah I’m shot up\nBut hopefully, you got a number I can call up\nAnd if you do girl, that be super\nThese chicks hot, but you’re so much cooler\nAnd I was hoping she would give me a chance\nShe walked by and didn’t gimme a glance. Damn\n\nSo, I told her like oh darlin'\nI feel like I am fallin’\nI think I’m in whatever, it is they call it\nI’m talkin’ bout love\nMy friends say I’m trippin but baby I don’t really give a fuck\nOh, oh. Pardon my french girl I just wanna know what’s up\nI told her we should kick it\nBut all I heard was crickets\n\nYeah, yeah, I said “Girl whatcha doin’ on the weekend”\nAnd she said “I don’t even know depends”\nBut you’re the one that I’ve been seein’ in my dreams and\nMaybe we can get together in the evening\nI know we just met but fate I believe in\nI know a spot where the stars just peek in\nIf love is deep, I’ll put both feet in\nShow me where the sea is, I’ll be in the deep end\nHa, your beauty got me sinkin’\nGot me sayin’ “all this shit” without thinkin’\nI probably sound like I spent the night drinking\nOr these are lines that I’m always repeatin’\nBut it’s the heart on my sleeve\nThat wanna know if your might have a spare key\nBut if you’re a heartbreaker then please spare me\nDamn, she was apparently\n\nSo, I told her like oh darlin'\nI feel like I am fallin’\nI think I’m in whatever, it is they call it\nI’m talkin’ bout love\nMy friends say I’m trippin but baby I don’t really give a fuck\nOh, oh. Pardon my french girl I just wanna know what’s up\nI told her we should kick it\nBut all I heard was crickets\n\nIn this light, you’re lookin’ like you’re inflight\nPretty voice, put a ribbon on you’re wind pipe\nSilly girl, you’ve been playin’ with me all night\nBut we can work it out, I been on my gym hype\nYeah, I heard you had a boyfriend and stuff and\nI was just calling to tell you that its cool cause\nMy other girlfriend got one too haha\nSo I told her like\n\nSo, I told her like oh darlin'\nI feel like I am fallin’\nI think I’m in whatever, it is they call it\nI’m talkin’ bout love\nMy friends say I’m trippin but baby I don’t really give a fuck\nOh, oh. Pardon my french girl I just wanna know what’s up\nI told her we should kick it\nBut all I heard was crickets",
 "image": "https://images.genius.com/61eed3cddb2c6381dfa862250b85fd96.600x600x1.jpg"
}