{
 "title": "Love More",
 "album": "X",
 "year": "2013-07-16",
 "lyrics": "'Til we get it\nI'ma get it\n'Til we get it\n'Til we get it\nI'ma get it\n'Til we get it\n\nYou say all you need is consistent love\nWhen I try, I swear it's never enough, I messed up\nMaybe this thing here just ain't meant for us\nBaby, you let go and I pull you back\nI let go, you ain't havin' that\n\nWe do it like rock stars (Oh)\nSexin' in my hotel room and we so loud\nHigher than a smoke cloud (Oh)\nShades on, doin' 95 with the top down\nI might sound crazy (Oh)\n'Cause we be goin' back and forth\nOne minute I hate you, then I love you\nThat's how it is\n\n‘Til we get it right we gon' fuck some more\n'Til we get it, I'ma get it\nI'ma get it, 'til we get it, 'til we get it\n‘Til we get it right we gon' fuck some more\nI'ma get it, I'ma get it\n'Til we get it, 'til we get it, I'ma get it (Turn up)\n\nWhy is it all so complicated?\nBaby, this should be simple, it's drivin' me mental\nBut when you back it up, it really drives me crazy\nAnd you know what I'm into\nMake me forget what we arguin' about, ayy\n\nWe do it like rock stars (Oh)\nSexin' in my hotel room and we so loud\nHigher than a smoke cloud (Oh)\nShades on, doin' 95 with the top down\nI might sound crazy (Oh)\n'Cause we be goin' back and forth\nOne minute I hate you, then I love you\nThat's how it is\n[Chorus: Chris Brown & \nNicki Minaj\n]\n‘Til we get it right we gon' fuck some more (Oh no)\n'Til we get it, I'ma get it\nI'ma get it (Ayy), 'til we get it, 'til we get it (We get it right)\n‘Til we get it right we gon' fuck some more (More)\nI'ma get it, I'ma get it\n'Til we get it (Yeah), 'til we get it, I'ma get it (\nYo\n, turn up)\n[Verse 3: Nicki Minaj & \nChris Brown\n]\nHe don't know me but he settin' up to blow me, uh\nSaid my Twitter picture 'mind him of Naomi, uh\nOn the low, I used to holla at his homie, uh\nFuck it, now I'm 'bout to ride him like a pony, yeah\nOkay, thug prolly, yo, come polly\nHe wanna fuck a bad Dolly and pop Molly\nI hope your pockets got a motherfuckin' pot belly\nOr is it that you never ball? John Salley\nHe had the Rolls in the Royce, the tone in his voice\nDon't want a good girl, naw, hoes is his choice\nD-D-Dick on H, p-p-p-pussy on W\nMouth on open, a-a-ass on smother you\nA-A-Ass on the cover too, Elle Magazine\nVroom, vroom, vroom, get gasoline\nCould I be your wife? Naw, we could bang though\nI got these niggas whipped, call me Django\n (\nIf we\n)\n\n‘Til we get it right we gon' fuck some more (Oh-oh)\n'Til we get it, I'ma get it\nI'ma get it (I'ma get it), 'til we get it, 'til we get it\n‘Til we get it right we gon' fuck some more (Some more)\nI'ma get it, I'ma get it\n'Til we get it (Yeah, yeah, yeah), 'til we get it, I'ma get it",
 "image": "https://images.genius.com/77288cfa3b3492b6d0fc6cdc45d01fde.1000x1000x1.jpg"
}