{
 "title": "We Own It (Fast & Furious)",
 "album": "Fast & Furious 6 (Original Motion Picture Soundtrack)  ",
 "year": "2013-05-23",
 "lyrics": "It's Young Khalifa, man\n2 Chainz!\n\nMoney's the motivation, money's the conversation\nYou on vacation, we gettin' paid, so\nWe on paycation, I did it for the fam\nIt's whatever we had to do, it's just who I am\nYeah, it's the life I chose\nGunshots in the dark, one eye closed\nAnd we got it cookin' like a one-eyed stove\nYou can catch me kissin' my girl with both eyes closed, yeah\nPerfectin' my passion, thanks for askin'\nCouldn't slow down, so we had to crash it\nYou used plastic, we 'bout cash\nI see some people ahead that we gon' pass, yeah!\n\nI never feared death or dyin' (Woo)\nI only fear never tryin' (Woo)\nI am whatever I am\nOnly God can judge me now\n\nOne shot, everything rides on tonight\nEven if I've got three strikes, I'ma go for it\nThis moment, we own it\nAnd I'm not to be played with\nBecause it can get dangerous\nSee these people I ride with?\nThis moment (Uh), we own it\n\nAnd the same ones that I ride with\nBe the same ones that I die with\nPut it all out on the line with\nIf you lookin' for me, you can find Wiz\nIn a new car or the crowd with\nMy new broad, that's a fine chick\nAin't no other squad I'm down with\nAin't no way around it\nWhat you say? Tell me what you say\nWorkin' hard, reppin' for my dogs, do this every day\nTakin' off, lookin' out for all, makin' sure we ball\nLike the mob, all you do is call\nCatch you if you fall, Young Khalifa\n\nI never feared death or dyin' (Woo)\nI only fear never tryin' (Woo) (Uh)\nI am whatever I am\nOnly God can judge me now\n\nOne shot, everything rides on tonight\nEven if I've got three strikes, I'ma go for it\nThis moment, we own it\nAnd I'm not to be played with (I ride or die for mine)\nBecause it can get dangerous\nSee these people I ride with? (I ride or die for love)\nThis moment, we own it\n\nThis the biggest day of my life\nWe got big guns, been graduated from knives\nIt's the day in the life and I'm ready to ride\nGot the spirit, I'm feelin' like a killer inside, uh\nFinancial outbreak, I'm free but I ain't out yet\nRidin' with the plug, so I'm close to the outlet\nAt the red light, rims sittin' offset\nI look better on your girl than her outfit (Uh)\n\nStuck to the plan, always think that we would stand up, never ran\nWe the fam and loyalty never change up\nBeen down since day one, look at where we came from\nJumpin' out on anybody who try to say some\nOne thing about it: got a problem? I got the same one\nMoney rolls, we fold\nPlenty clubs we closed\nFollow the same code\nNever turn our backs, our cars don't even lose control\n\nOne shot, everything rides on tonight\nEven if I've got three strikes, I'ma go for it\nThis moment, we own it\nAnd I'm not to be played with (I ride or die for mine)\nBecause it can get dangerous\nSee these people I ride with? (I ride or die for love)\nThis moment, we own it\n\nHahaha\nUh\nThis moment, we own it\nI ride or die for mine\nI'm ride or die material\nOne life to live, so here we go\nThis moment, we own it",
 "image": "https://images.genius.com/c8bc8cdd6176cc5626af0b40e9e45ba7.1000x1000x1.jpg"
}