{
 "title": "We own it",
 "album": null,
 "year": null,
 "lyrics": "It's Young Khalifa man\n2 Chainz!\nMoney's the motivation\nMoney's the conversation\nYou on vacation, we gettin' paid so\nWe on paid-cation, I did it for the fam\nIt's whatever we had to do, it's just who I am\nYeah, it's the life I chose\nGunshots in the dark, one eye closed\nAnd we got it cookin' like a one-eyed stove\nYou can catch me kissin' my girl with both eye' closed\nPerfectin' my passion, thanks for askin'\nCouldn't slow down, so we had to crash it\nYou use plastic, we 'bout cash\nI see some people ahead that we gon' pass, yeah!\nI never fear death or dyin'\nI only fear never tryin'\nI am whatever I am\nOnly God can judge me now\nOne shot, everything rides on tonight\nEven if I got three strikes, I'ma go for it\nThis moment, we own it\nAyy, I'm not to be played with\nBecause it could get dangerous\nSee these people I ride with\nThis moment, we own it\nAnd the same ones that I ride with, be the same ones that I die with\nPut it all out on the line with, if you're looking for me\nYou could find Wiz in the new car or the crowd\nWith my new broad, that's a fine chick\nAnd no other squad I'm down with, ain't (no way around it)\nWhat you say? Tell me what you say\nWorkin' hard, reppin' for my dogs, do this everyday\nTakin' off, lookin' out for all, makin' sure we ball\nLike the mob, all you do is call\nCatch you if you fall, Young Khalifa\nI never fear death or dyin'\nI only fear never tryin'\nI am whatever I am\nOnly God can judge me now\nOne shot, everything rides on tonight\nEven if I got three strikes, I'ma go for it\nThis moment, we own it\nAyy, I'm not to be played with (I ride or die for mine)\nBecause it could get dangerous\nSee these people I ride with (I ride or die for life)\nThis moment, we own it\nThis the biggest day of my life\nWe got big guns, been graduated from knives\nIt's the day in the life, and I'm ready to ride\nGot the spirit, I'm feeling like a killer inside\nOh, financial outbreak, I'm free, but I ain't out yet\nRidin' with the plugs, so I'm close to the outlet\nAt the red light, rims sittin' offset\nI look better on your girl (than her outfit)\nStuck to the plan, always said that we would stand up, never ran\nWe the fam, and loyalty never change up\nBeen down since day one, look at where we came from\nJumpin' out on anybody who tryin' to say somethin'\nOne thing about it, got a problem? I got the same one\nMoney rose, we fold\nPlayin' in clubs we closed\nFollow the same code\nNever turn our backs\nOur cars don't even lose control\nOne shot, everything rides on tonight\nEven if I got three strikes, I'ma go for it\nThis moment, we own it\nAyy, I'm not to be played with (I ride or die for mine)\nBecause it could get dangerous\nSee these people I ride with (I ride or die for life)\nThis moment, we own it\nThis moment, we own it\nI ride or die for mine\nI'm ride or die material\nOne life to live, so here we go\nThis moment, we own it",
 "image": "https://s3.amazonaws.com/rapgenius/filepicker%2FGkWGGU3RLg3qdguyY5pQ_2_chainz_and_wiz.jpg"
}