{
 "title": "Work",
 "album": "Lord$ Never Worry",
 "year": "2012-08-20",
 "lyrics": "Yeah, straight off the plane\nDroppin' the flame\nHoo! Hoo! Hoo! Hoo!\n\nA lot of niggas die, due to these streets\nA lot of mamas cry, due to this beef\nPurple kush got me high, don't wanna leave\nSee my daddy in heaven, he be the realest G\nAnd your bitch I got her, she like my Tommy boxers\nNigga I ain't no boxer, I let that Tommy box 'em\nMake 'em say ugh, Silkk the Shocker\nVery rare Vesace, I bet my silk will shock her\n\nPut in work, put 'em in the dirt\nSemi gon' squirt, damn he got murked\nWho got that work? He got that work\nShe pop that pussy, she make it twerk\nA couple model bitches, thought I balled for the Lakers\nAll they know is suck and fuck and speak a different language\nShe like that cocaina, she sniff it off my banger\nShe like to blow my nine, I think she's going brainless\nPut in work, put 'em in the dirt\nSemi gon' squirt, damn he got murked\nWho got that work? He got that work\nShe pop that pussy, she make it twerk\nA couple model bitches, thought I balled for the Lakers\nAll they know is suck and fuck and speak a different language\nShe like that cocaina, she sniff it off my banger\nShe like to blow my nine, I think she's going brainless\n\nAll my Dominican niggas, got me speaking Spanglish\nNow that I'm rapping, I'm fucking different singers\nCeline Dion, Mariah Carey\nI got them Nick Cannons, if you coming at me\nCouple of them skinny niggas, that be trigger happy\nFeel them candy girls, make them do the Laffy Taffy\nThey pop a pill, then they pop a bullet\nMan, fucking with this nigga like playing Russian Roulette\nI ain't wanna pull it, but I had to do it\nI be out tomorrow, my lawyer's Jewish\nHe work hard, he put in work\nHe put in work, got these niggas going bezerk\nRiding music, I see you riding to it\nBang 'em over the head, nigga that for talking foolish\nNigga, work hard, put in work\nPut in work, got these niggas going berserk",
 "image": "https://images.rapgenius.com/1c9bf54ddaa4d9b97927238c05bc9fe0.1000x1000x1.jpg"
}