{
 "title": "Come to Me",
 "album": "Press Play",
 "year": "2006-09-12",
 "lyrics": "Come to me, I can be, what you need, ooh baby\nIt's Bad Boy, bitch\nDo it, do it, do it, do it, do it, do it, do it\n(It feels good to be back, I missed ya)\nDo it, do it, do it, do it, do it, do it, do it\nRelax your mind, let your conscious be free\nAnd I roll with the sounds of the BBE\nJust do it, do it, do it, do it\nDo it, do it, do it, do it\n(You know what time it is)\n(Report to the dance floor)\nIt's Bad Boy, bitch\n(Talk to 'em)\n\nSee you out the corner of my eye\nLeanin' on the wall lookin' fly\nI want you to come be with me\nYou're the only one I wanna talk to, but I don't wanna rush\n\nI'm here, when will you make your move?\nI see you eyein' me, I want cha, why don't cha?\nCome to me, I can be, what you need, ooh baby\nI'm standin', been waitin', I'm yearnin', ooh, I'm burnin'\nCome to know me, come and get to know me\nCome show me, that you wanna know me\n\nYou know what it is, I'm back in the building\nSecurity strapped, still stackin' a million\nStunt with a stallion, somethin' Italian\nOr maybe Puerto Rican, you can catch me in Paris\nI'm in it to win it, I'm willin' to carry\nThe game, if you think I'm not, look at the carats (Look at me, man)\nHop up clean up outta the Phantom\nThe people go screamin' like an opera anthem (Let's go)\nI did it before, do it again (Do it again)\nI got it to blow, got it to spend (Got it to spend)\nFly as befo', cool as the wind\nGot hits go back like Juice and Gin, yeah\nShine the best and diamond necklace (c'mon)\nMy extravagant taste, the style perplexes\nThey know I'm the shit, they wanna get next\nThat's why she havin' a fit cause she wanted to get next to him\n\n(You know my name, you know my motherfucking name)\nI'm here, when will you make your move? (I know your name)\nI see you eyein' me, I want cha, why don't cha?\nCome to me, I can be, what you need, ooh baby\nI'm standin', been waitin', I'm yearnin', ooh, I'm burnin'\nCome to know me, come and get to know me\nCome show me, that you wanna know me\n\nAnywhere I appear, they all stop and stare\nAdmire your body language speakin' loud and clear like\n(I want you to come be with me)\nShe be waitin' anticipatin' for oh so long\nFantasizing wild thoughts of me comin' on like\n(I'm here, when will you make your move?)\nShe diggin' my style, my swag, my suede, my swerve\nMy way with words, the boy's absurd for sure\nYou can't fall 'til my aura call her\nI make miracles like I walk on water\nWhat you want mama order, it's on my tab\nI'm so bad with the cash, I dropped a whole bag\nWhere you at, girl?\n\nI'm here, when will you make your move?\nI see you eyein' me, I want cha, why don't cha?\nCome to me, I can be, what you need, uh baby\nI'm standin', been waitin', I'm yearnin', ooh I'm burnin'\nCome to know me, come and get to know me\nCome show me, that you wanna know me\n\nI'm here, my love can't wait no longer\nYou were the one who stole my heart (You were the one)\nCan't you see the wait is over\n(I knew it from the very start)\nI need you to come closer\nThis feeling is getting strong\n(Oh, boy) You really got me hot\n\nI see you eyein' me, I want cha, why don't cha?\nCome to me, I can be, what you need, uh baby (Whatever you need)\nI'm standin', been waitin', I'm yearnin', ooh I'm burnin'\nCome to know me, come and get to know me\nCome show me, that you wanna know me\n\nDo it, do it, do it, do it, do it, do it, do it\nDo it, do it, do it, do it, do it, do it, do it\nWhy don't cha come to me?\nI can be, what you need uh baby\nI'm here, you're here, let's make it happen\nDo it, do it, do it, do it, do it, do it, do it\nDo it, do it, do it, do it, do it, do it, do it\nDo it, do it, do it, do it, do it, do it, do it\n(I like the way this one feel)\nRelax your mind, let your conscious be free\nAnd I roll with the sounds of BBE\nDo it, do it\nYou know what this is\nIt's Bad Boy bitch\nPress Play!",
 "image": "https://images.genius.com/b112b43ae277d7925b898ff74f0e2566.320x320x1.jpg"
}