{
 "title": "Get It Big",
 "album": null,
 "year": null,
 "lyrics": "She got a face like Trina leg and thighs like Mya (Mya)\nBig Apple Bottoms plus she walk like a model\n\n(Get Big), (Get Big), (Get Big), (Get Big), Gone Work\nShe got a face like Mya (Mya)\nBody like Trina (Trina)\nHair and Nails Did, you would know her if you seen her\n\n(Get Big), (Get Big), (Get Big), (Get Big), Gone Work (Yeah)\nDrop it to the floor (Yeah)\nPick it back up (Big)\nVibrate your body, make a playa want to cut.(Yeah)\nChilling at the club with cha hair and nails did\nGot me in the club, hollerin out GET BIG!\nDo your damn thang, drop it let me see it\nShake your back real strange cause you know a playa need it\nShe drop it like a model make a playa wanna follow\nShaped like a coke bottle, damn it's hard for me to swallow\nSay, Ro this girl fine, I'm looking at her thighs\nYeah she know that she the baddest out here dancing from behind\nShe's standing 5-5 with them sexy brown eyes\nShe got me hypnotized by the way way she shake her spine\nSo drop it to the floor, drop, drop it to the floor. (Drop it to the floor.)\nDrop it to the floor, drop, drop it to the floor. (Drop it to the floor.)\nDrop it to the floor, drop, drop it to the floor. (Drop it to the floor.)\nDrop it to the floor, drop, drop it to the floor\nShe got a face like Trina leg and thighs like Mya (Mya)\nBig Apple Bottoms plus she walk like a model\n\n(Get Big), (Get Big), (Get Big), (Get Big), Gone Work\nShe got a face like Mya (Mya)\nBody like Trina (Trina)\nHair and Nails Did, you would know her if you seen her\n\n(Get Big), (Get Big), (Get Big), (Get Big), Gone Work (Yeah)\nAll the girls up in the club hit the scene and see what's poppin it\nAll us searching for the baddest Bitch and see who droppin it\n(Inaudible Lyric) I found a thick yellow rockin it\nThe way she moving those hips it like a clock she tick-tocking it\nGirl you better stop, (yeah) before I get on top of it\nThe way she moving that back so fast that my eyes is hypnotized and sh–\nStraight from Texas Baby BLT yessir that is the click\nMe and my bros on the floor find a yellow-bone talkin bout yo GET IT BIG\nShe was more fly than a G-Force plane\nThey caught me with that GIT DOWN, Mimi was her name\nWas the way she move it dropping it was so insane\nJust call me Pops cause I wanna BANG-BANG\nNow in the back and in the front and make it seem like we running train\nI'm throwin to her hips like a roll my woodgrain\nShe turned and replied did you want any requests\nI said drop it low and do whatever you do the best. (Drop it low)\nGet Big, Drop it low\nGet Big, Drop it low\nGet Big, Drop it low\nGet Big, Drop it low\nGet Big, Drop it low\nGet Big, Drop it low\nGet Big, Drop it low\nGet Big, Drop it low\nShe got a face like Trina leg and thighs like Mya (Mya)\nBig Apple Bottoms plus she walk like a model\n\n(Get Big), (Get Big), (Get Big), (Get Big), Gone Work\nShe got a face like Mya (Mya)\nBody like Trina (Trina)\nHair and Nails Did, you would know her if you seen her\n\n(Get Big), (Get Big), (Get Big), (Get Big), Gone Work (Yeah)",
 "image": "https://assets.genius.com/images/default_cover_image.png?1620675870"
}