{
 "title": "Go Getta",
 "album": "The Inspiration",
 "year": "2006-12-12",
 "lyrics": "Young Jeezy, CT\nAnd ya boy Kells\nYeah, \n8732\n, what it do, nigga?\nHaha. That's right keep clapping ya'll. DJ you playing with us, turn it up\n(Kiki, I got you homie, Let's get it)\nLet's go get 'em Jeezy...oh, oh, oh\n\nYou know we trap all day (oh) we play all night (oh)\nThis is the life of a, the life of a (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\nAnd in the club, you see a bad bitch, point her out (oh)\nYeah ya damn right I'mma (ay) ya damn right I'mma (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\n\nEnemy of the state, they callin' me Will Smith\n (whoa)\nThing on my side, you can call that Jada\n (damn)\nThem boys talking down, yeah we call them haters\nI'm balling right now so we'll get to that later (oh oh oh oh)\nI be the first to admit I'm such an alcoholic (oh oh oh oh)\nOnly blow the good shit, yeah that wuchumacallit (haha)\nCatch me posted on the block, \nin somethin exotic (whoa)\n0-7 year, the same color Hypnotiq\n (yeeeeeah)\nOn the outside lookin, and I want in (ay)\nMy homie did the same thing and he got ten (damn)\nJust took a loss, still tryin to win (yeah)\nAin't tryin to give back, so what you tryin to spend?\n (Let's get it)\n\nYou know we trap all day (oh) we play all night (oh)\nThis is the life of a, the life of a (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\nAnd in the club, you see a bad bitch, point her out (oh)\nYeah ya damn right I'mma (ay) ya damn right I'mma (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\n\nWe live life on the edge like there's no tommorrow (damn)\nAnd grind hard like there's no today\nAnd do the same shit like it's yesterday\nThe game never stop, so who's next to play? (oh oh oh oh)\nAgainst all odds, you can place ya bets (oh oh oh oh)\nYeah I'm just getting started so I ain't done yet (nah)\nRisk it all, you can lose ya life\nWhat else can I say? That's a helluva price (damn)\nI don't under cause I overstand\nNo time for mistakes so I overplan (ay)\nI'm in the club like what? 4-5 with me (yeah)\nAnd I'mma stay thuggin till the feds come get me (yeeeeeeah)\n\nYou know we trap all day (oh) we play all night (oh)\nThis is the life of a, the life of a (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\nAnd in the club, you see a bad bitch, point her out (oh)\nYeah ya damn right I'mma (ay) ya damn right I'mma (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\n\nHey, hey, this is how we play\nWhen we roll up to the club high sittin on twenty-tre's\nHop out like we fabolous\nTop models grabbin us\nThey love them Go Getta's only in America\nPut the D on, chicks like Wallace\nTurn 'em forward now, they can have all of this\nCan't deny it when you see the wheels spinnin\nBoy Kells out the coupe in Miami white linen\nChips big spending\n, walk up out the club with a shitload of women\nSoon as I see what I like I'mma get it\nI'mma get it, oh I'mma get it, cause I'mma Go Getta\n\nYou know we trap all day (oh) we play all night (oh)\nThis is the life of a, the life of a (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)\nAnd in the club, you see a bad bitch, point her out (oh)\nYeah ya damn right I'mma (ay) ya damn right I'mma (ay)\nGo Getta (ay) Go Getta (ay) Go Getta (yeeeah)",
 "image": "https://images.genius.com/2053ad8225fddfdf7a3b14840b227196.300x300x1.jpg"
}