{
 "title": "Good Things",
 "album": "Rich Boy",
 "year": "2007-03-13",
 "lyrics": "Good Things Don't Last Forever Baby\nSomething 'Bout You Girl That Drives Me Crazy\nAin't No If's And But's Or Maybe's\nYou'll Always Be My Friend\nYou Will Always Be\nYou Will Always Be\nSay You'll Always Be\nMy Friend\nShe Want To Know What The Reason\nI'm Saying She Can Be My Friend\nBut Baby I'm a Player Ain't No Reason To Pretend\nMight've seen me in M.I.A. riding phantom of the Benz\nWith a beautiful bitch her hair blowin' in the wind\n(see I'm true to this shit)\nHope that you can comprehend\nWhat I'm spitting is pimping and the rules don't bend\nYup, you lookin' good\nBut ya mind ain't right\nSome niggas been tellin' ya\nShe's quite alright\nBy  you need to let me put this \"I\" in your life\nNot the booze from behind from the side how you like\nI don't wanna spend forever with you baby just tonight\nIf you can hop in my backseat that'll be a delight\nFrom the looks of that ass you and nigga type\nIf you can bring me some cash, baby you're Mrs. Right\nYou say you gotta man and you don't know if this is right\n(Thats why I need you to be like polow da don!)\n\nYou're The Only Girl I Wanna See Daily\nNot A lot Save Me But You Could Be My Lady\nLet's Take It To Another Level You Remember\nThe First Day I Got you What You Want And\nIt Wasn't Even Your Birthday Nah Now\nWe Kick It To Hard You Went To Deep\nSay You Feel It In Your Heart So\nI'm Be Real Cause You Give Me What I Want\nAnd I Ain't Gonna Tell You I Love You If I Don't\nI Understand That You Got A Man At Your Crib\nBut He Can't Even Understand How You Feel\nBut If You Stop Coming Around\nAnd I Don't See You Again I Guess We Can\nJust Be... Woooo\n\nNow Ladies You All Know What I'm Talking About\nSee I Don't Want A Man That Just Be Dipping\nIn And Out Of My Life I Want A Friend That'll Be\nThere Thick And Thin You Know What I'm Saying\nSomeone To Take It Back to the Isley's\nI Want Somebody To Always Run Back To Me\nAnd Trust I'll Always Be Here With *That Good Thang*\nIf I Couldn't Walk Again Would You\nStill Be There For Me If I Lost It All Today\nWould You Care For Me? Yeah Would You Write Me in the pen?\nKinda Of Friend That Will Be There Without The Benz?\nLike An Angel From Above God Sent Me You Never Ask About The Money That You\nLent Me Nah You Look Good With Your\nBody You're The Type Of Girl That Money\nCan't Buy Me",
 "image": "https://images.genius.com/44836909bd62528d8f95efedc817667b.250x250x1.png"
}