{
 "title": "I Get Money",
 "album": "Curtis",
 "year": "2007-06-30",
 "lyrics": "I get money\nI— I get money\nI— I get— I get— (Fifty!)\nI get— I get—\n\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (Yeah)\nMoney— Money, I got; money— money, I got (I run New York!)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (Yeah, yeah)\nMoney— Money, I got; money— money, I got (I run New York!)\n\nI took quarter waters, sold it in bottles for two bucks\nThen, Coca-Cola came and bought it for billions—what the fuck?\nHave a baby by me, baby—be a millionaire\nI write the check before the baby comes—who the fuck cares? (Ow!)\nI'm stanky-rich, I'ma die tryna spend this shit\nSouthside's up in this bitch\nYeah, I smell like the vault, I used to sell dope\nI did play the block, now I play on boats (Yeah)\nIn the south of France, baby, Saint-Tropez\nGet a tan, I'm already Black; rich, I'm already that\nGangsta, get a gat, hit a head in a hat\nCall that a riddle, rat, shit, fuck the chitter-chat (Ooh, ooh!)\nI'm the baker, I bake the bread; the barber, I cut your head\nThe marksman, I spray the lead, I bloodclaat-chop your leg\nDo not fuck with the kid\nI get biz with the Sig, I come where you live—you dig? (Oh!)\n\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (Yeah)\nMoney— Money, I got; money— money, I got (I run New York!)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (Yeah, yeah)\nMoney— Money, I got; money— money, I got (I run New York!)\n\nYou can call this my new shit, but it ain't new, though\nI got rid of my old bitch; now, I got new hoes (Woo!)\nFirst, it was the Benzo; now, I'm in the Enzo\nFerrari—I'm sorry, I keep blowing up (Oh!)\nThey call me the cake man, the strawberry-shake man\nI spray the AR, make your whole clique breakdance (Yeah)\nBackspin, head-spin, flatline, you're dead, then\nNine shells, Mac-10—who wan' get it cracking?\nI was young, I couldn't do good; now, I can't do bad\nI ride, wreck the new Jag? I just buy the new Jag\nNow, nigga, why you mad?\nOh, you can't do that? I'm so forgetful\nThey calling me cocky\nI come up out the jeweler, they calling me Rocky\nIt's the ice on my neck, man, the wrist and my left hand\nBling like \"Blaow!, you like my style\nHa, ha! I'm heading to the bank right now\n\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (Yeah)\nMoney— Money, I got; money— money, I got (I run New York!)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (I, I get it)\nI— I get money; money, I got (Yeah, yeah)\nMoney— Money, I got; money— money, I got (I run New York!)\n\nYeah, I talk the talk, and I walk the walk\nLike a Teflon Don, boy, I run New York\nWhen I come out ofcourt, yeah, I pop the cork\nI keep it gangsta, I have you outlined in chalk (I, I get it)\nIn the hood if you ask about me\nThey'll tell ya I'm about my bread (I, I get it)\nRound the world if ya ask about me\nThey'll tell you they love the kid (I, I get it)\n\nHo, hey (I, I get it)\nHo, hey (I, I get it)\nHo, hey (Yeah)\nHo, hey (I run New York)\nHo, hey (I, I get it)\nHo, hey (I, I get it)\nHo, hey (Yeah, yeah)\nHo, hey (I run New York)\n\nI— I get money; money, I got (I'm back on the streets, man)\nI— I get money; money, I got (I'm bringing the heat, man)\nI— I get money; money, I got (I'm on my grind)\nMoney— Money, I got; money— money, I got (Like all the time)\nI— I get money; money, I got (Tryna stop my shine?)\nI— I get money; money, I got (I'll cock my nine)\nI— I get money; money, I got (Don't get out of line)\nMoney— Money, I got; money— money, I got (I said, \"Don't get out of line\")\n\nI, I get it\nI, I get it\nYeah, yeah",
 "image": "https://images.rapgenius.com/2af05736416168c4afae4dbe684f0fbe.600x614x1.jpg"
}