{
 "title": "Last Night",
 "album": "Press Play",
 "year": "2007-02-27",
 "lyrics": "Last night, I couldn't even get an answer\nI tried to call, but my pride wouldn't let me dial\nAnd I'm sitting here with this blank expression\nAnd the way I feel, I wanna curl up like a child\n\nI know you can hear me\nI know you can feel me\nI can't live without you\nGirl, please make me better\nI wish I wasn't the way I am\n\nIf I told you once, I told you twice\nYou can see it in my eyes\nI'm all cried out, with nothing to say\nYou're everything I wanted to be\nIf you could only see, it all belongs to me\nI love you so much, I'm yearning for your touch\nCome and set me free, forever yours, I'll be\nBaby, won't you come and take this pain away?\n\nLast night, I couldn't even get an answer\n(You said you couldn't get an answer, baby)\nI tried to call, but my pride wouldn't let me dial\n(That should never stop you)\nAnd I'm sitting here (Sitting there) with this blank expression\n(I can't read your mind, baby)\nAnd the way I feel (The way I feel), I wanna curl up like a child\n(Ooh baby)\n\nI need you and you need me\nThis is so plain to see\nAnd I would never let you go\nAnd I will always love you so, I will\nIf you could only see, your heart belongs to me\nI love you so much, I'm yearning for your touch\nCome and set me free, forever yours, I'll be\nBaby, won't you come and take this pain away\n\nLast night (Oh, last night), I couldn't even get an answer\n(Oh baby, what you wanna do to me?)\nI tried to call (Alright), but my pride wouldn't let me dial\n(Why would you just hurt me, baby? Oh)\nAnd I'm sitting here with this blank expression\n(Don't save me baby, don't, no)\nAnd the way I feel, I wanna curl up like a child\n(I'm so alone, I'm so lonely, baby, oh)\n\nTell me what words to say to make you come back\nDon't break me like that (Ooh)\nAnd if it matters, I'd rather stay home (Baby)\nWith you, I'm never alone\nDon't wanna wait 'til you're gone\nWhatever you do, just don't leave me\n\nLast night (Yeah), I couldn't even get an answer (Didn't get an answer, baby)\n(Oh) I tried to call (Call me, baby), but my pride wouldn't let me dial\n(Oh, couldn't you just dial me, baby, baby, baby, baby, baby, baby?)\nAnd I'm sitting here with this blank expression (Don't sit there, no)\nAnd the way I feel (Alright, yeah), I wanna curl up like a child\n(I'm so alone, I'm so lonely, baby, oh)\n\nI need you and you need me (I need you)\nThis is so plain to see\nAnd I would never let you go\nAnd I will always love you so, I will\nIf you could only see, your heart belongs to me (Belongs to me)\nI love you so much (So, so), I'm yearning for your touch\nCome and set me free, forever yours, I'll be\nBaby, won't you come and take my pain away?\n\nLast night, I couldn't even get an answer (I couldn't get you, baby, yeah, oh)\nI tried to call (Call me, baby), but my pride wouldn't let me dial\n(Why couldn't you just dial me, baby, baby, baby, baby, baby, baby?)\nAnd I'm sitting here with this blank expression (Don't sit there, no)\nAnd the way I feel (Alright, yeah), I wanna curl up like a child\n(I'm so alone, I'm so lonely, baby)\n\nWhy don't you pick up the phone and dial up my number?\nAnd call me up, baby, I'm waiting on you\nWhy don't you pick up the phone and dial up my number?\nJust call me up, baby, I'm waiting on you\n\n{Phone dialing and ringing}\n\"Hello\nHey what's-up\nI've been tryin' to reach you all night\nThat shit ain't funny not picking up the motherfucking phone\nBetter stop fucking playing with a nigga's feelings like that\nYou know how much I love you, right?\nBut for them couple of seconds though\nWhen I couldn't get in touch with you\nI'm ready to come over your house and shoot that motherfucker up\nYou better fucking not be there when I get over that house\n{Laughing}\nThat's really how it goes down, right?\"",
 "image": "https://images.genius.com/9838b615ada8bf1cb8ebde2f834f419e.1000x1000x1.jpg"
}