{
 "title": "Money in the Bank",
 "album": "One Man Band Man",
 "year": "2007-05-29",
 "lyrics": " It's showtime!\n\nShe ain't got no money in the bank\nShe be walkin round actin all stank\nNow she at the party lookin at me\nHopin she could get saved by me\nI'm lookin at her like I ain't tryin to save that girl (NO SIR!!!!)\nI ain't tryin to save that girl (NO SIR!!!)\nI ain't tryin to save that girl\nShe got her hand open like I'm finna pay that girl\n\nNow... what y'all wanna do?\nWanna be ballers? Shot-callers? Brawlers?\nGive me your number I bet she 'gon call ya\nCome on dog she want you to spoil her\nChristian Dior or them new Fendi bags\nAnything is good ccause it's better than she had\nShe sittin at the bar and she's lookin so sad\nTalkin about, uh, I wanna ride in your jag\nUh uh uh, I wanna ride to your house\nI said easy chick I fly to my house\nI, live so far think I live down south\nWhy don't you pull it out my pants or put it in your mouth!!!\n\nShe ain't got no money in the bank\nShe be walkin round actin all stank\nNow she at the party lookin at me\nHopin she could get saved by me\nI'm lookin at her like I ain't tryin to save that girl (NO SIR!!!!)\nI ain't tryin to save that girl (NO SIR!!!)\nI ain't tryin to save that girl\nShe got her hand open like I'm finna pay that girl\n\nI see ya, you got the good shoes on\nAnd your good dress on I mean you got your best on\nI'm sittin at the back drinkin Vive and Clico\nThe Roselito, you know how we do\nBefore them bottles came you wasn't fuckin with my niggas\nMy homey say what's up you sayin nothin to my nigga\nCome on girlfriend why you frontin for my niggas\nIt comes to the paper it's nothin to you niggas\nDon't you know we got that (Money in the bank)... (I repeat)\nD-D-D-Don't you know we got that (Money in the bank)\nMan you ain't gettin nothin from me or my (Bank)\nBetter get you own, g-g-g-get out my face\n\nShe ain't got no money in the bank\nShe be walkin round actin all stank\nNow she at the party lookin at me\nHopin she could get saved by me\nI'm lookin at her like I ain't tryin to save that girl (NO SIR!!!!)\nI ain't tryin to save that girl (NO SIR!!!)\nI ain't tryin to save that girl\nShe got her hand open like I'm finna pay that girl\n\nIt's started out soft and warm\nDon't get excited I've been invited to the quiet storm\nAnd, now it's out of hand cause she told me she hate me\nAnd then she said what the hell I done lately\nFirst she said all she need is love and affection\nLet me be your angel, and I'll be your protection\nTook her out bought her all kinds of things\nBut it wasn't enough, so this the song I sing cause she broke\n\nShe ain't got no money in the bank\nShe be walkin round actin all stank\nNow she at the party lookin at me\nHopin she could get saved by me\nI'm lookin at her like I ain't tryin to save that girl (NO SIR!!!!)\nI ain't tryin to save that girl (NO SIR!!!)\nI ain't tryin to save that girl\nShe got her hand open like I'm finna pay that girl",
 "image": "https://images.genius.com/1d56b442a1586a25c9a2a89f323b8076.630x630x1.jpg"
}