{
 "title": "Not a Criminal",
 "album": "Venom",
 "year": "2007-02-13",
 "lyrics": "Uh! Looks like another win for me\nIt's an ultimate victory, Chamillitary mayne!\n\nEverybody get low, it's a stick-up, everybody get low (everybody get lower!)\nEverybody get low, it's a stick-up, everybody get low (everybody get lower!)\nEverybody get low, it's a stick-up, everybody get low (everybody get.. low!)\nEverybody get low, it's a stick-up, everybody get low (Chamillitary!)\n\nEverywhere that I go-ooo-oooh\n[Everywhere I go, they look at me like a criminal)\nBut I'mma C.E.O-ooo-oooh\n[I'ma C.E.O., I'mma self-employed C.E.O.)\nI'm not a criminal!\n\nLet 'em stay local while I'm 'bout to hit Japan\nThat G4 get me out when I get in a jam\nYou gotta go international to get with Cham\nRoamin on ya phone? (oh!) I betcha switch ya minute plan\nLet these other rappers beef, while they arguin\nWe be runnin in with the bags to get all the grams (grams)\nTake it outcha hands (hands), take it outcha hands (oh!)\nMoney talks, only language that I understand\nI heard that Puff and Jay was worth over three hundred mill (yeah)\nThat mean this year I gotta put it in three hundred gear (yeah)\nYou on a treadmill homey, you just runnin still\nYou sense the rapper all the other rappers love to feel\nI got the plaque but now I'm back for the reload\nWe know, I'mma still stick to the street code\nTell me what the industry is lookin at me for?\nCause he sold platinum and they didn't think it would be gold\nNow they tryna tell me that there will never be more\nBut these flows are sure to be a (oh!) to your ego\nYeah I'm from the South, they try to tell me that we slow\nBut it's ironic how ya tryna keep up with me though\n\nEverywhere that I go-ooo-oooh\n[Everywhere I go, they look at me like a criminal)\nBut I'mma C.E.O-ooo-oooh\n[I'ma C.E.O., I'mma self-employed C.E.O.)\nI already got do-ooo-oooh-ough\n[I already got dough, but I think it's time for me to get more)\nI'mma C.E.O-ooo-oooh\n[I'ma C.E.O., I'mma self-employed C.E.O.)\nI'm not a criminal!\n[Chamillionaire}\nCall up Universal, tell 'em open up the vault\nAnd tell 'em that I just had another million dollar thought!\nAlbums do not sell, they tell me we ain't in a drought\nI bet I run in these labels for the (dough!) and break 'em off\nI'mma boss, ye-yeah my money is unlimited (oh!)\nSorta like my Motorola minutes is\nIdiots, Koopa 'bout to tell you what the bidness is\nRappin this, rapper major label owner gettin rich\nWha'chu mean the label didn't promote?\nI put a million on a million and do it 'til I go broke!\nMight have to run for president so gimme ya vote!\nCause Bin Laden wouldn't be the only one in the scope! {*gun shot*}\nGet a rope! And duck tape, there's 'bout to be a crime\nSimplify ya songs, I ain't simplifyin mine\nThe industry done got in the streets, that's why rap is dyin\nDon't get it confused, I'mma still show you how to grind\nThey tell me if I write a lullaby for the females (no!)\nThat these sales is sure to skyrocket the retail\nHope you gotta back up plan, if your CD fails\nI drown 'em like seashells, 'til they hear these shells\n\n\nOh! Everybody get low, this a stick-up, everybody get low (everybody get low!)\nEverybody get low, this a stick-up, everybody get low (everybody get.. low!)\n{*gun shot*}\nUltimate victory, I'm back for the reload\nBut we know, I'mma still stick to the street code (everybody get low!)\nYou seein somethin pretty in the middle of the road\nBouncin on rims like the brick at a free throw (everybody get low!)\nI told 'em tomorrow I'mma be on \nBET\nLook at all the free clothing that they came and gave to me (everybody get oh!)\nI told 'em tomorrow I'mma be on MTV\nLook at all the jewelry, my jeweler gave to me for free (Chamillitary mayne!)\nI'm winnin so keep the hatin to a minimal\nY'all need to all give applause to the general (oh!)\nI'm hearin how y'all talk in ya interviews\nY'all really all just be talk like a interlude\nPoppin at the mouth (oh!), while I'm poppin tags\nFifty thousand in my pocket, pants gotta sag\nMagazine crtics always talkin like they bad\nNever in the streets tryna hide behind a pen and pad\nBut it's okay! I know why you gettin mad\nCause you know I got a lotta whatever you never had\nGotta better pad (oh!), gotta better slab\nWe gon' keep it movin, try ya best to getta cab\nRemember you was jammin Master P\nNow that Houston super hot, you tryna ask for me\nThey be askin for a verse, they don't even ask the fee\nTellin me how many bars to spit, like that's for free\nANNNHHH! Try again, sorry, better luck next time\nUnless I'mma sleep, the only time it's not, let's grind!\nY'all need to stop like the words on a red sign\nUnless I'm pointing somethin, tellin ya, \"Get down!\" {*screwed*}\n\nOh! Everybody get low, this a stick-up, everybody get low\nEverybody get low, this a stick-up, everybody get low\nNot a criminal!",
 "image": "https://images.genius.com/2edbdfdd029e22397221bf2db9d99ce2.170x170x1.jpg"
}