{
 "title": "Outta My System",
 "album": "The Price of Fame",
 "year": "2007-02-13",
 "lyrics": "Oooooh, Damn!\nI mean I just keep thinkin about you (awww baby)\nI mean I wanna move on but I can't move on (oh, oh, oh, ooooh)\nIt's like you got some kind of hold on me\nAnd I don't know\nBut I'm a go ahead and talk about it\nListen\n\nI'm sitting looking out the window like damn\nTrying to fix this situation that's at hand\nYou still running through my mind - when I'm knowing that you shouldn't be\nMe all on ya mind, I'm knowing that it couldn't be\nCause you ain't called, and I ain't even appalled\nI still got a lot of pain, I ain't dealt with it all\nI been running 'round with other chicks - I'm single and they loving it\nI'm liking it, but I just want the one that I was in love with\nThat's not the end of it - I'm trying to let you go\nI can't get a grip of it, is what I'm trying to let you know\nYou gotta hold of some kinda control on me\nI don't know what it is - but I gotta get you gone from me\nI'm working at it and it ain't getting no better\nJust trying to be like \"yeah, forget it, whatever\"\nInstead of staring out this glass - looking at this bad weather\nDamn I gotta pull myself together, cause...\n\nWhen I'm with somebody, all I think 'bout is you\nWhen I'm all alone - that's all I wanna do\nI miss the smiley faces in my sidekick, out of town visits\nAll the time we spent together, makes it hard to get you outta my system\nYou know what you do to me (do to me)  you don't even understand\nDamn  you know what you do to me (do to me)\nIt's so hard to get you outta my system\n\nI'm too attached my heart want let me fall back\nI got it bad that's what you can call that (ah)\nAnd when I see you in the streets that's the worse for me\nUse to love the little things you did, that's what works for me\nIt's too major, don't see you in my pager\nKnow what you doing?, where you at?, or can I see you later?\nThe fellas telling me just let her go Bow\nBelieve me I'm trying man I just don't know how\nI be in all the hot spots - leaving with the hot shots\nKnowing they just want me cause I'm the top spot\nThat's not popping, and my brain ain't stopping\nThinking who she with? Or where she going? Is she club hopping?\nI never had this kinda problem in my life\nThis is my first time dealing with this kind of fight\nIt's every night, and every flight, and every time you in my sight\nDamn, this ain't even right....cause\nWhen I'm with somebody, all I think 'bout is you\nWhen I'm all alone - that's all I wanna do\nI miss the smiley faces in my sidekick out of town visits\nAll the time we spent together, makes it hard to get you outta my system\nYou know what you do to me (do to me)  you don't even understand\nDamn  you know what you do to me (do to me)\nIt's so hard to get you outta my system\n\nIs it wrong for me to feel this way\nYou been running through my mind all day - can you feel me\nI been trying to get you off my mind\nBut I can't after all this time - that's what kills me\nIs it wrong for me to feel this way\nYou been running through my mind all day  can you feel me\nI been trying to get you off my mind\nBut I can't after all this time - that's what kills me\nWhen I'm with somebody, all I think 'bout is you\nWhen I'm all alone - that's all I wanna do\nI miss the smiley faces in my sidekick out of town visits\nAll the time we spent together, makes it hard to get you outta my system\nYou know what you do to me (do to me)  you don't even understand\nDamn  you know what you do to me (do to me)\nIt's so hard to get you outta my system\n\nI remember everything that me and you talked about\nMe and you had our whole life planned out together\nAnd if I could, I would turn back the hands of time\nAnd correct all my mistakes that I ever did\nBut I guess I gotta move on right?\nStill hard, and I still love until this day... Peace",
 "image": "https://images.genius.com/bb324bb9c96b3fb063e1f142745570a1.600x600x1.jpg"
}