{
 "title": "Shawty",
 "album": "The Real Testament",
 "year": "2007-06-12",
 "lyrics": "Ay, what's happenin homey?\nThis yo' lil' boy Plies, man (shaw-tay)\nAy Pain, I want you tell 'em bout your shawty homie\n(yeah, yeah, yeah, yeaaaaaah)\nAnd I'mma tell em bout mine, dawg\n\nNow, even though I'm not yo man, you not my girl\nI'mma call you my - shaaaaaaw-ty...\nCause I can't stand to see you treated bad, I beat his ass\nFor my - shaaaaaaaw-ty...\nAnd we ain't did nothin that we ain't sup'POSED to do\nCause you my - shaaaaaaw-ty... (oh-oh)\nBaby girl you know I be home, keep me on the ringtoooone\nShaaaaaaw-ty - sang it to me girl!\n\nSoon as I seen her, shieet, told her I'd pay for it\nLil' mama the baddest thing 'round here, she already know it\nI pointed at the donk and told her, \"This s'posed to be yours\" (ha ha!)\nShowed her a couple stacks and told her I'd let her blow it\nThe hottest nigga in the city baby you can't ignore it\nI showed her I was a real nigga n' she went for it\nFirst time I caught her shit, she ain't even kno' how to tho'it back\nNow she a animal, I got her sex game right\nI taught her how to talk to me while she take pipe\nAnd opened her up and showed her what a real nigga like\nI told her, \"I'on't usually do this, I'on't fuck on the first night\nCause after I beat ya baby, I'm liable to fuck up ya whole life!\"\nI gotta train her, now she suck me with ice\nI call her my lil' bust-it baby, cause she keep it tight\nWhenever I tell her to bust, ain't gotta tell her twice\nWhatever I wanna get off, she know how to get me right\n\nNow, even though I'm not yo man, you not my girl\nI'mma call you my - shaaaaaaw-ty...\nCause I cain't stand to see you treated bad, I beat his ass\nFor my - shaaaaaaaw-ty...\nAnd we ain't did nothin that we ain't sup'POSED to do\nCause you my - shaaaaaaw-ty... (oh-oh)\nBaby girl you know I be home, keep me on the ringtoooone\nShaaaaaaw-ty - sang it to me girl!\n\nOh-oh (whooooooooa), oh-oh, oh-oh, oh-oh (whooooooooa)\nOh-oh, oh-oh (WH-OA-wh-oa, wh-oa), oh-oh, oh-oh, oh-oh\nOh-oh, oh-oh (whooooooooa)\nShawwwwww-DEEEE-EEEE, yeah...\nOh-oh (whooooooooa), oh-oh, oh-oh, oh-oh (whooooooooa)\nOh-oh, oh-oh (WH-OA-wh-oa, wh-oa), oh-oh, oh-oh, oh-oh\nOh-oh, oh-oh (whooooooooa)\n(Shaaaaaaw-ty, yeah) SHAW-DEE, whoa, w-w-wh-oa, OH!\n\nI love to show her off, cause all the dope boys want her\nKnow why dey wanna beat badly, look at all dat ass on her!\nLook how dat pussy sit up in them shorts, you gotta want her\nLove when she act like she bowlegged and bend the co'ner\nShe proud to be fuckin me, cause I'm stuntin on 'em!\nIt feel good to be fuckin a real nigga, do'nuh?\nAin't called her in two days, gotta let her mind wonder\nBut when she miss me, she call to tell me to jump on her\nThat's why I don't mind breakin 'er off, cause she ain't with the drama\nIf you done ripped her before, you know how to cuff lil' mama\nYou know she gotta be somethin, cause I done beat her hunda\nBabe snatchin, not now, I'm tellin ya, I promise!\nI exposed her to real and now she hate lame\n'member she used to run from me, now she like pain\nShe call me sometimes just to ask is it her thang\nEver since I ran up in shawty, she ain't been the same\n\nNow, even though I'm not yo man, you not my girl\nI'mma call you my - shaaaaaaw-ty...\nCause I cain't stand to see you treated bad, I beat his ass\nFor my - shaaaaaaaw-ty...\nAnd we ain't did nothin that we ain't sup'POSED to do\nCause you my - shaaaaaaw-ty... (oh-oh)\nBaby girl you know I be home, keep me on the ringtoooone\nShaaaaaaw-ty - sang it to me girl!\n\nOh-oh (whooooooooa), oh-oh, oh-oh, oh-oh (whooooooooa)\nOh-oh, oh-oh (WH-OA-wh-oa, wh-oa), oh-oh, oh-oh, oh-oh\nOh-oh, oh-oh (whooooooooa)\nShawwwwww-DEEEE-EEEE, yeah...\nOh-oh (whooooooooa), oh-oh, oh-oh, oh-oh (whooooooooa)\nOh-oh, oh-oh (WH-OA-wh-oa, wh-oa), oh-oh, oh-oh, oh-oh\nOh-oh, oh-oh (whooooooooa)\n(Shaaaaaaw-ty, yeah) SHAW-DEE, whoa, w-w-wh-oa, OH!",
 "image": "https://images.genius.com/864e40b3463fcf40bb9b164f7eb462e1.316x316x1.jpg"
}