{
 "title": "We Takin’ Over",
 "album": "We the Best",
 "year": "2007-03-27",
 "lyrics": "[Intro: Akon, \nDJ Khaled\n & \nT.I.\n]\nOh oh oh! \n(DJ Khaled!)\nAy, ay, ay, ay, ay, ay\nKonvict Music \n(We The Best!)\nAy, ay, Grand Hustle\nYeah \n(We takin' over)\nAy, ay, ay\nOww! \n(Listen!)\n\nStarted in Atlanta then I spread out with it\nSouth Carolina, Alabama, Mississippi\nOn to North Carolina, Philadelphia and Virginia\nFrom down in Miami where it warm in the winter\nOn up to Minnesota where it storm in the winter\nJacksonville, Tallahassee, Memphis, Tenn; holla at me\nBe in H-Town, Southside, Cloverland, daddy\nI'm the man out in Dallas, better ask Khaled\nKept me out in Cali with my eyes open barely\nBlowin' and spinnin', goin' down Bennett\nDrop 6-4, three-wheel, then switch it\nRed light stop, make it drop for the bitches\nGot a Glock four-fifth, blow your head off with it\nAnything you hear that I said, I meant it\nKing got the crown then sped off with it\nSay you need bricks, I said, \"I'll get it\"\n\nIf you want to, we can supply you (Supply you)\nGot enough work to feed the whole town\nThey won't shoot you unless you try to (Try to)\nCome around and try to stomp on our ground\n[Chorus: Akon & \nDJ Khaled\n]\n'Cause we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nOh oh \n(Listen!)\n\nBoss, it's what I does\nI get money e'ryday, e'ryday I does\nThat (Benz) is how I ride\nBlack flag on the left, two hoes and ride\nYou better (Move) AK all day\nGet shot up like Shyne, that's on my neck\nI'm big like Diddy; damn it, I'm with it\nKhaled, we did it, Biggie of my city\nPlease no fitted, fuck it, I'm too pretty\nI'd rather get brain, stupid, I'm silly\nMoney that come runnin' like water\nMami so hot, damn it, she gorgeous\nMiami on fire, you better be cautious\nMight get shot on the porch of your fortress\nYeah, they see it but no one reports it\nI run this, Rick Ross, boss shit\n[Chorus: Akon & \nDJ Khaled\n]\n'Cause we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nOh oh \n(Listen!)\n\nBlat, when you see Crack, better duck\nLike the MAC got a EZ pass, nigga what?\nShit, I don't give a fuck, I run these streets\nY'all talk that shit, I walk that beef\nI'ma tell you like a G told me\nThey'll come back quick if a nigga OD\nCash rule everything around me\nI'm YSL, Versace\nYou could see me in that Porsche GT\nComin' down Sunset, sittin' on Ds\nFeelin' like Pac, all eyes on me\nFresh bandana and I'm blowin' mad trees (Trees, trees)\nNigga please\nI spit crack, every verse a ki\nSome say \"Khaled,\" some say \"Khaleed\"\nTwelve years down and I'm finally free\n\nIf you want to, we can supply you (Supply you)\nGot enough work to feed the whole town\nThey won't shoot you unless you try to (Try to)\nCome around and try to stomp on our ground\n[Chorus: Akon & \nDJ Khaled\n]\n'Cause we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nSaid we takin' over (One city at a time)\nOh oh \n(Listen!)\n\nBirdman daddy, I'm number one\nNigga came at me wrong, so we got him done\nFuckin' with the fam, I'ma give him some\nSpent that corner, he didn't run\nSunday had a whole church singin' a song\nWhy'd they have to send my baby home?\nFuckin' with some niggas, that paper long\nBeen a G in the game, now my son on the throne\n\nAh, I am the beast\nFeed me rappers or feed me beats\nI'm untamed, I need a leash\nI'm insane, I need a shrink\nI love brain, I need a leech\nWhy complain on Easy Street?\nI don't even talk, I let the Visa speak\nAnd I like my Sprite Easter pink\nAnd my wrist-wear Chopard but the Müller's cooler\nI have more jewels than your jeweler\nTouch and I will bust your medulla\nThat's a bullethole, it is not a tumor\nRed light, red light, stop your rumors\nI stay on track like a box of Pumas\nNow just r-r-rock with Junior\nI am the little big kahuna, y'dig?\n\n'Cause we takin' over (One city at a time)",
 "image": "https://images.genius.com/7a3d63eb6c521859e658b21e8b9ea5f1.600x600x1.jpg"
}