{
 "title": "White Girl",
 "album": "Young Jeezy Presents U.S.D.A.: Cold Summer",
 "year": null,
 "lyrics": "Hahaha\nYeah!\nAhh Yee-uhh, Boii Ah Yee-uhh (x3)\n*Jeezy talkin' in the background*\n\nYou know we keep dat white gurl: \nChristina Aguilera\nMy jewelry too loud,\n \nbabygurl I can't hear ya\nI need 'bout 50 of dem bricks at the topic\nThey know we run the streets, mayne dem boys best stop it\nYou know we keep dat white gurl: Christina Aguilera\nMy jewelry too loud, homeboi I can't hear ya\nI need 'bout 50 of dem bricks at the topic\nThey know we run the streets, mayne dem boys best stop it\n\nFresh White-T in my all-white, Caddy\nYeah she a girl but she call me, daddy\nSmokin' nuthin' but the best, you can call this 'Cali'\nI've a brick on the seat, you can call dat 'Sally'\nA lil' paranoid, you can call me crazy\nLast time we came thru, we spent 'bout a buck 80\n\"About a buck 80?\" - Yeah, a 180 thousand\nMatta of fact nigga, \nI'm runnin' thru the change right now\n\n\nWho it be? - Who!\nThe boi Slick P\nClean mussle car, rented wit' a big fee\nBlowin' my smoke, throwin' up the 4's\nYou can tell err'body git dat, the kid git dough\n62's jump (Whudd?!), we call dem \"Mad goes\"\nGot 'em goin' fo' the 12, yeah we got dem fo' the laws\nTwo cell phones our next tel, Matt Trough\nKeep my spot bunkin', open like the \"24\"\n\n\nSteer on, Steen\nGot his name from the Raw\nNot a stone in this muthafuckin' chain got a flaw\nMy man - yeah I'm talkin'bout dat white thang\nMy niggas in The Projects, yeah they on the same thang\nMy lil' senorita, call her \"Spanish Fly\"\nI blow a couple O's so, I holla at my dyme (Take my chain)\nYou know bout dem white blocks? - Yeah, I'm talkin' white squares\nMove 'em by the two's, so they go by the pairs\n\n\nYou know we keep dat white girl (Owh!.. Owh!.. Owh!..)\nYou know we keep dat white girl (Hey!.. Hey!.. Hey!..)\nYou know we keep dat white girl (Owh!.. Owh!.. Owh!..)\n*beat fades*",
 "image": "https://images.genius.com/12bc730f62fbc7238d3f83bd70206884.316x316x1.jpg"
}