{
 "title": "Burnin’ Up",
 "album": "Faithfully",
 "year": null,
 "lyrics": "Burning up! My heart is like burnin up!\nBurning up! My heart is like burnin up!\nBurning up! My heart is like burnin up!\nBurning up! My heart is like burnin up!\n\nSometimes you can be in love and having fun\nAnd still not know what's going on (No)\nOr on the other hand you separate\nThinking that the feeling's gone\n(talking)\nFeels like forever when were together\nI knew that we are destiny\nSo here's the last chance for the last dance\nFor us to bring back the dream\n\nSo baby come and rescue me (I'm burnin up!)\nI got some fire for you to see (I'm burnin up!)\nBaby come and take me there (I'm burnin up!)\nTrust me you should (Hurry up!)\nBaby I'm just (burnin up! burnin up!)\n\nYeah, uh, now check it out\nAnd what you need I could offer, by any means I support ya\nNeglecting your needs would be torture\nThings that I taught ya, like blowing (FIRE!!!) in the porche\nAnd doing high speed is what I taught ya\nA straight gentlemen, born with a ape adrenaline\nGirl you gotta have Faith I'm sizzling\nHot, \nwhen I drop numbers like New Kids On The Block\nThem like who that kid in the drop\nEmergency, cause shorty hot to the third degree\nHow many (?) wanna swerve with me?\nRefrain from serve indeed, the game never heard of me\nI got something for you herbs to see\nSo why, even run away been put the gun away\nSign with Bad Boy first hit with Dunaway\nAnd Neptune track hot like summer days\nThis wet Loon block hot now one away\n\nIn the midnight hour, wait a minute\nI can be in a lonely place\nThen along you come with the sweetest thing to say\nAnd put the sun in my day, I really wish you would\n\nRescue me (I'm burnin up!)\nI got some fire for you to see (I'm burnin up!)\nBaby come and take me there (I'm burnin up!)\nTrust me you should (Hurry up!) Baby I'm just (burnin up!) x2\n\nBurning up! My heart is like burnin up!\nBurning up! My heart is like burnin up!\nBurning up! My heart is like burnin up!\nBurning up! My heart is like burnin up!",
 "image": "https://images.genius.com/125d3a4ff3ca3736f60732845dbd4186.1000x1000x1.jpg"
}