{
 "title": "Gangsta Lovin’",
 "album": "Eve-olution",
 "year": "2002-07-03",
 "lyrics": "I just wanna rock you, all night long\nOh-oh!\nI just wanna rock you (Uh-huh), all night long\nOh-oh!\n\nYo!\nNeed you to understand me, daddy, I ain't your average\nBaby girl, doin' it all, I'm well established\nI ain't tryna lead you on, just wanna ask\nIf you might wanna give me your name, explain your status\nYou know I see you in time and time, you seem available\nDon't mean shit, I know these bitches wanna settle you\nGotta say you on my short list of few\nThem other dudes is ok, but I'm feelin you\nWant you in the best way, what you 'gon do about it?\nWhy don't you just test me, you won't want to do without it\nYo, I'm comin' at you hard, bein' a thug\nAnd I ain't givin up till I get that gangsta love, uh-huh\n\nI just wanna rock you, all night long\nOh-oh!\n(I wanna rock ya) I just wanna rock you, all night long\nOh-oh!\n\nI know you seen me this night, that night, always my shit tight\nHair done, outfit crazy, skirts fit just right\nWife-beater with a bangin' tan\nWalk in, demandin' all eyes, baby, here I am (You know)\nAin't a shame in my frame and I know you're watchin'\nPuttin' on a show for you, pop, and I ain't stoppin' (You know)\nLot of action in your corner, yeah, you gonna do\nOnly thing to make it better though is me with you (You know it)\nAnd I know you feelin' that regardless of your frontin'\nAnd I heard through the streets it was me you wantin'\nLet me find out, you shy or somethin'\nBut I know you're not\nSo stop the games and approach, is you real or not? (Real or not)\n\nI just wanna rock you, all night long\nOh-oh!\n(I wanna rock ya) I just wanna rock you, all night long\n(All night long)\nOh-oh!\n\nYo! Uh! Ok!\nNumbers exchange, now it's in place\nShouldn't of took you so long in the first place\nI'm just playin' cutie, yeah, give me a call\nNo, it's cool, you ain't got to see me to my car\nSee, I'm a big girl (Big girl), but you'll find out (Oh yeah)\nStop for me while I drop top and ride out (Ride out)\nWheels spinnin', wanna know what shorty all about?\nBut it's cool, I'm provin' these words that's comin' out my mouth\n\nIt's that gangsta lovin' (Gangsta) that's just got me buggin' (Buggin')\nIt's that gangsta lovin (Gangsta, gangsta) that just got me buggin'\n(Oh-ah!)\n\nI just wanna rock you, all night long\nOh-oh!\n(I wanna rock ya) I just wanna rock you, all night long (all night long)\n(All night)\nOh-oh!\n\nI wanna rock you, baby, I wanna hold you, baby\nWon't you be my baby? I wanna be your lady\nI wanna rock you, baby, I wanna hold you, baby\nWon't you be my baby? I wanna be your lady (yeah yeah)\nBaby, let me rock with you (This gangsta, gangsta love)\nYou know I wanna rock with you (Gangsta, gangsta)\nBaby let me rock with you (The E-V-E)\nYou know I wanna rock with you (A. Keys, gonna rock ya)\nBaby, let me rock with you\nYou know I wanna rock with you (It's gangsta, gangsta love)\nBaby let me rock with you (It's Gangsta gangsta)\nYou know I wanna rock with you (It's gangsta, gangsta love)\nOoh, yeah, you know I wanna rock with you\nBaby, let me rock with you",
 "image": "https://images.genius.com/d2d35ff0c6f755db0e4c005d77d61076.500x500x1.jpg"
}