{
 "title": "Gimme The Light",
 "album": "Lifeshow",
 "year": null,
 "lyrics": "Just gimme the Light!\nUh! \n*Drama Monks*\nMeine Leidenschaften bedeuten der Welt ein Dreck!\nMeine Leidenschaften...\n\nIch bin nicht einfach zu handlen\nIch bin ein Freigeist mit Flausen und Eigenheiten in dreifacher Menge\nIch fühl mich oft einsam\nIch drohe an der Oberflächlichkeit der Menschheit zu zerbrechen, es macht das Loch weiter\nIch sitz zwischen zehn Menschen\nNicht ein einziges Themengebiet tangiert mich im geringsten, ich sehe leere Menschen\nIch bring mich ein mit dem Satz \"Fick die Welt!\", die Runde staunt\nGing es doch eben noch um Nettogehälter und Kundentausch\nIn einem Raum voller naturalistischer Stillleben\nBin ich verstörende moderne Kunst, keiner will mein Bild sehn!\nSie sehn mich wie Dadaismus\n ohne Idee dahinter, dumm und menschlich\nAbstrakt im besten Fall interessant, aber unzugänglich\nIch sprenge ihre Werteskala, ich bin der Härtefall\nIch gehe nicht zum Trendfriseur, hab deswegen heut nichtsmehr zu sagen\nEure Herzen sind mir zu klein, Motive wertentladen\nDie Tüten zu groß und die Witze zu vorhersehbar!\nIhr zwingt mir den Komplex auf, die Mehrheit macht den Staat\nIhr besetzt den Begriff normal, alternatives wird brandgemarkt\nUm eure Fehler mir auf die Fahnen zu schreiben\nFehlt es mir leider an Arroganz..\n\nJust Gimme the Light!\nEs is nass und dunkel hier\nIch bin allein und kann nichts sehn\nJust Gimme the Light!\nWo sind all die Lichter hin?\nWo sind die Menschen die mich verstehn?\nJust Gimme the Light!\nEs ist düster und dunkel hier\nIch bin allein und ich kann nichts sehn\nJust Gimme the Light!\nIch will ans Tageslicht\nIch will die Sonne noch einmal sehn!\nJust Gimme the Light!\n\nWarum guckt ihr mich so an? \nIch bin nicht aussetzig\nIch bin anti, kontra, dagegen, ich bin aufsessig\nIch bin mein eigenes Konzept, ich lebe freimündig\nMein Leben sind Profis, in der Kreisklasse, Bayern München\nIhr wärt gerne V.I.P., very important\nBist du im geborgten Porsche important?\nKommt in meinen Club zum seelischen Bypass\nUnd ich sperr extra für euch den geistigen Bereich ab\nIch grab unter feuchte Hände, Schütteln und Kinnhaken\nEine Nische zwischen Großstadtbauern und Provinzadel\nIhr seid Katalogmenschen, Seele kommt per Nachnahme\nAls Bonus für lästige Werte der passende Sargnagel\nIch sehe leere Menschen, leere Zimmer, leere Häuser\nLeere Millionäre, leere Flaschen, leere Säufer\nIch leere ohne was zu lesen meinen Posteingang\nIch fühl mich oft wie ein Außenseiter, ich bin oft einsam\n\n\nDie letzte Frage: Worum gehts?\nUnd alles seh'n, denn die Wege ensteh'n beim geh'n\nUnd das versteh'n beim drüber Reden und Schreiben, Reisen und Leben\nStatt leiden, schweigen und quäl'n, eigentlich wenig\nDoch eigentlich mein' ich mehr nicht\nZumindest weiß ich nichts, deswegen reichts mir eigentlich\nAlles ist gut, solange du tust was du kannst\nUnd mit dem was du in der Hand hast\nUnd wo du bist mit dir im Frieden bist\nDenn da gehts lang, man muss nur anfangen\nIch schalt das Licht an, seh dein Bild\nMich dann und fühl mich ganz an\nEy un ich hass nich wirklich Rechtsanwälte\nDoch ich kann spür'n echte Kälte\nSchlechte Wellen, schlechte Quellen, schlechte Werte\nUnd ich bin sicher, echte Stärke heißt nicht ungereche Härte\nDarum bleib ich sicher nett mit dir und mir, weils mir das Wert ist\nUnd weil es ist, wie es ist und weil es war, wie es war\nUnd schließlich kommt, wie es kommt\nIst alles wahr, rein und klar\nAber echt und ich bleib weit mehr, als rechts, links, dunkel und hell\nDenn wir sind alle echt schöne Kinder\nPunkt, und so speziell...\n\n\nMeine Leidenschaften bedeuten der Welt ein dreck!\n-RapGeniusDeutschland!",
 "image": "https://images.genius.com/ec7cd114b52ce5608f85b8e783561c5b.300x300x1.jpg"
}