{
 "title": "Heaven I Need A Hug",
 "album": "Chocolate Factory",
 "year": "2003-02-18",
 "lyrics": "I'm just bein' real, you know\nI'm like the sun, I'm tryin' to shine on everybody\nYou know what I'm sayin'\nBut it's like situation after situation, you know\nSo I write about it to get it off my chest, you heard\n\nDear mama, you wouldn't believe what I'm goin' through\nBut still I got my head up just like I promised you\nEver since you left, your baby boy's been dealin' with\nProblem after problem, tell me, what am I supposed to do?\nSee, I get lost sometimes, don't understand this place\nLook in the mirror sometimes and see a troubled face\nAnd then my tears roll down and hit the sink\nThen I hold my head up high\nI hope the Man upstairs can hear my cry\nAll these questions deep inside my mind\nLike, if Jesus loved me, why He leave my side, mama?\nI'm still tryin' to get the answer why\nYou were young, 45, and you had to die\nI'm always tryin' to help people out\nAnd it's them same people tryin' to take food out my mouth\n(For real tho') It seems like the more money I make\n(For real tho') The more drama y'all try to create\n(For real tho') And through I try to move into the positive\n(For real tho') The more y'all don't wanna let me live\nWhen will you realize that I don't owe you nothin'\nNeed to get up off your butt and go get your own somethin'\nI'm pullin' on my hair to keep from snappin' off\nFools ride up in my camp and be yappin' off\nSomebody out there please pray on what I'm talkin' 'bout\nStill young tryin' to figure it out\n\nHeaven, I need a hug\nIs there anybody out there willin' to embrace a thug?\nFeelin' like a change of heart\nAnd all I really need is a sign or a word from God\nSo shower down on me, wet me with your love\nI need you to take me, and lift me up, oh yeah\n\nI gave 13 years of my life to this industry\nHit song or not, I've given all of me\nYou smile in my face and tell me that you love\nBut then before you know the truth, you're so quick to judge me\nThat's alright, go ahead, keep talkin' ('Cause...)\n'Cause I'ma hold my head up high and keep walkin'\nAnd reach for the sky, focus on the plan\nRescue the ghetto with his paper and pen\nAnd this is for the homies that we lost\nYo, we cannot forget y'all, so the hats come off\nWe pour a little liquor out for the memories\nI know y'all up there sittin' on chrome in them pearly streets\nThe street survivors, be careful, stay alive\nI'm prayin' for your families, I hope you pray for mine\n(For real tho') Used to be a time you wished me well\n(For real tho') It hurts to know you wanna see me fail\n(For real tho') And don't forget I kept you out of jail\n(For real tho') Where's my arms when you needed to be held\nThey turned they backs on you, who was there believin'?\nWho said your troubles were only for a season?\nIn church together tryin' to pick up all the pieces\nAnd now you betray me, I bind you in the name of Jesus\nSomebody please pray on what I'm talkin' 'bout\nStill young tryin' to figure it all out\n\nHeaven, I need a hug\nIs there anybody out there willin' to embrace a thug?\nFeelin' like a change of heart\nAnd all I really need is a sign or a word from God\n(Please shower down)\nSo shower down on me, wet me with your love (Yeah)\nI need you to take me, and lift me up (Oh, yeah, yeah, yeah)\n\nMan, I tell you it's enough to make you wanna give it up\nThank God for my fans 'cause through it all they show me love\nTo my sister and two brothers\nTell me why can't we just try to get along with one another?\nInstead of hurtin' one another, fightin' one another\nMan, I pray to God He get my family back together\nLet me see what wanna I see, just to blind me\nAll of these luxuries, wine and dine and me\nAnd then You push me out in front to get behind me\nThen You sat me up by blessin' me to bind me\nI'm a grown man with kids now, stakes are higher\nGotta go to church now to avoid the fire\nFrankly, y'all, to keep it real, I'm just tired\nDreams of bein' dead, but the devil is a liar\n(For real tho') Church folks, you need to stop judgin'\n(For real tho') Or you will be the first to be judged\n(For real tho') And women stop dependin' on us men\n(For real tho') And start dependin' on the Man above, feel me\nAnd as for Robert, here's what I need to do\nGet rid of them clowns and get myself a whole 'nother crew\nAnd media, do your job\nBut please just don't make my job so hard\nSomebody please pray on what I'm talkin' 'bout\nI'm still young tryin' to figure it all out\n\nHeaven, I need a hug\nIs there anybody out there willin' to embrace a thug?\n(Embrace me)\nFeelin' like a change of heart\nAnd all I really need is a sign or a word from God\nSo shower down on me, wet me with your love\n(Shower down on me now)\nI need you to take me (Please) and lift me up, yeah, yeah\n(Said I'm callin' on...)\nHeaven, I need a hug\nIs there anybody out there willin' to embrace a thug?\n(Embrace me, yeah)\nFeelin' like a change of heart\nAnd all I really need is a sign or a word from God\nSo shower down on me, wet me with your love\nI need you to take me, and lift me up (Lift me up)\nYeah, yeah (Heaven, I need)\nHeaven, I need a hug (Ooh, yeah, yeah)\nIs there anybody out there willin' to embrace a thug?\nSaid I'm feelin' like a change of heart (Hey)\nAnd all I really need is a sign or a word from God (Ooh, yeah)\nSo shower down on me, wet me with your love\nI need you to take me and lift me up, yeah, yeah",
 "image": "https://images.genius.com/c23c7ad166aff9317b7dbbc35ffe83db.1000x1000x1.jpg"
}