{
 "title": "Lights, Camera, Action!",
 "album": "John P. Kelly",
 "year": "2001-08-12",
 "lyrics": "I'm talkin to these motherfuckers\nYea, ok\nYea, ooh, ooh (This one's a vivrant thing)\nLB, G.I. one fam, oh my (Bounce with me now)\nBink, Dawg, hot (I'm talkin, this gone be somethin now)\nMr. Cheeks, whoo (I'm talkin lights, camera, action)\nOhhhh Kay (Get down now)\nBink Dawg now, One Shot Deal shit\n\nYea, ok\nNow I'm in the spot where I wanna be\nMoney spent, niggas gettin bent, chicks in front of me\nJust the way I like it, hunnies turnin somethin\nI got a seat up in the cut and I'm burnin somethin\nBooties dancin 'round a nigga and I'm killin one\nKillin one from the top of the stash and I'm feelin buns\nPlus I'm do' low at a table\nI'm fuckin with this chick with a fat batty and the ring up in her navel\nDances around, she struts with the \"fuck\" walk\nTouches her toes, and she can make her butt talk\nDo whatcha gotta do, I ain't mad at 'chu\nKnow a lot of haters when they seen and as bad as you\nYou's a real bad girl, a nigga need that\nSippin on ya Henny, askin where the weed at\nLemme put you onto somethin\nYou fuckin with a big nigga, no frontin\n\nUh shorty, turn it around lemme see somethin\nFuckin with me for real, it's gone be somethin\nYea, I'm talkin lights, camera, action\nHad me singin \"I'm sorry Ms. Jackson\"\n\nI love the way it's goin down she got the thong on\nShe started bouncin more once she heard the \"Thong Song\"\nThem high heels got them calves lookin right too\nShorty come live with me for the night true\nShit I'm only tryin to holla - it's only right you holla back\nSo where you headed lemme follow that\nNow word up I got plans for you\nIt's more than my tongue and my hands'll do\nThe way you move to the music - it make a nigga wanna\nTake you up outta here, go somewhere, loose it\nAnd your physique is off the chain\nIt's gonna be hard gettin you off the brain\nI mean we could take a drive in the X5\nThe way you boogie on the floor, know that sex slide\nYou's a dime piece, I'm tryin to see somethin\nSuck your t's and in your front and lemme squeeze somethin\n\n\nI got a few hours left 'til a nigga jet\nAnd I'm hopin that it's you that a nigga get\nHear them callin out ya name, I geuss ya showtime\nGet'cha money shorty, lemme see you pole climb\nToes out, back showin off the tat-toooo\nFuck the dumb shit, a nigga had to snatch youuuu\nLookin as good as ya smell, pay your own bills\nAsk officer, cuz your pushin your own wheels\nYea I'm feelin you tryin to see the deal with you\nWhat's goin on, later on, can I chill with you?\nWe can do anything that you wanna do\nYou know the way a nigga feel, all I want is you\nGet ya dance on\nLove the way you make the moves with no pants on\nLet's ride!\nBounce to ya man's song\nLet's get to goin, it's goin on before the chance gone\nNext stop\n\n\nYo, turn with me now\nDo my thing, hey swing with me now\nBink dawg now, one shot deal shit\nKeep it tight, and this is how we steal shit\nIt's that real shit, it's that new shit\nHow we come thru shit\nMr. Sexy keep shit hot with us\nLet's go get it, niggas tryed to come get us\nBack, niggas know my fuckin style\nGot the booties in the back, HEY meanwhile\nWe just suckin and smokin and drinkin\nHey man, what the fuck is they thinkin\nAww shit, we's high tonite\nWell my nigga said \"Let's ride tonite\"\nWe out in Miami\nWe in New York\nTwist the cap, pop the cork\nYea shorty, lemme see somethin\nFuckin with me and my team, yea it's gone be somethin\nI'm talkin 'bout lights, camera, action\nHad a nigga singin \"I'm sorry Ms. Jackson\"\nYea, oh, ha-ha, sorry Ms. Jackson\nShorty actin like she ready for some action",
 "image": "https://images.genius.com/2ec34d2178f03963a7af10ce836cbb3a.180x180x1.jpg"
}