{
 "title": "Oh Boy",
 "album": "Come Home with Me",
 "year": "2002-04-02",
 "lyrics": "Just Blaze! (Oh baby)\nOh baby, uh, Killa!\n\nAll the girls see the (boy), look at his kicks (boy)\nLook at his car (boy), all I say is (oh boy)\nLook mami, I'm no good, I'm so hood\nClap at your soldiers sober, then leave after it's over, Killa\nI'm not your companion, or your man's stand-in\nHit me when you wanna get rammed in, I'll be scramblin'\nWith lots of mobsters, shop for lobsters\nCops and robbers, listen every block is blaka (BLAKA!!!)\nBut she like the way I diddy bop, you peep that?\nMink on, Mauri kicks plus Chanel ski hat\nShe want the (boy), so I give her the (boy)\nNow she screamin' out (boy, boy, boy, boy), Killa, Killa\nNow she playin' with herself, Cam dig it out, lift her up\nMa, it's just a fuck, girl, get it out, pick on up\nThey want the boy Montana with guns with bandanas\nListen to my homeboy Santana\n\nY'all niggas can't fuck with the (boy), I'm tellin' ya (boy)\nPut a shell in ya (boy) now he bleedin' (oh boy)\nGet him, call his (boy) he wheezin' he need his (boy)\nHe screamin' (boy, boy, boy, boy)\nDamn, shut up (boy), he's snitchin' (oh boy)\nThis nigga's bitchin' (boy), he's twisted (oh boy)\nIf Feds was listenin' (boy), damn, whoa, whoa, c'mon...\nI'm in trouble need bail money, shit\nWhere the fuck is my (boy)? I got trust for my (boy)\nThat's why I fuck with my (boy), that's my nigga (oh boy)\nHe gon' come get his (boy), he got love for his (boy)\nThat's my (boy, boy, boy, boy) uh huh, uh huh\n\nWhen he got caught with the (boy), we went to court for the (boy)\nJust me and my (boy), and we sayin' (oh boy)\nBe on the block with my (boy) with the rock or the (boy)\nWhen the cops come - Squalie!\nYeah this is for the sports cars, Bonita's, Jimmy's\nPJ's, old school, eighteenth at the sports bar\nEight or nine on the (boy), holla at your boy\nKilla, holla, listen\nIt's the D-I-P (boy) plus the R-O-C (boy)\nYou'll be D-O-A (boy), your moms will say (oh boy)\nShit, ain't no stoppin' 'em, guns we got a lot of 'em\nShit, matter of fact, Guru start poppin' 'em\nThen slap up this (boy), clap up his (boy)\nWrap up his (boy), get them gats (oh boy)\nDiplomats are them (boy) for the girls and the (boy)\nSay (boy, boy, boy, boy)\n\nNow when they see Cam and his (boy), they say damn (oh boy)\nSantana's that (boy) that squeeze hammers (oh boy)\nCannons and bandanas, blammers we don't brandish\nBlam at your man's canvas then scram with your man's leaded\nAnd I'm back with my (boy)\n\nUntil that man is vanished\nAway in the Grand Canyon, these kids are grand standin'\nNiggas demand ransom over them grams scramblin'\n(Boy, boy, boy, boy)\nWell fuck it, Van Damme 'em, Cam'll blam blam 'em\nCall up his (boy), I'm down south tannin'\nMami, I got the remedy, Tommy's up at the enemy\nHomi's and bodies, but now my body you're feelin' finicky\nKilla and Capo, we chill in Morocco for reala\nWe got dough, chinchilla dough and fill with them hollows, huh\nIt's the (boy), I said it's the (boy)\nI'm the (boy, boy, boy, boy) Killa",
 "image": "https://images.genius.com/8ada31c3bb7719c5a2cde2fb8e19ac17.600x600x1.png"
}