{
 "title": "Welcome to Atlanta",
 "album": "Instructions",
 "year": "2002-05-14",
 "lyrics": "Yeah\nWelcome to Atlanta, jackin' hammers and vogues\nBack to the mackin' and jackin the clothes, adolescent packin a fo'\nA knock on the do', who is it? I would happen to know\nThe one with the flow - who did it?, it was me I suppose\nJD in the Rolls and Luda's in the Cut Supreme\nSkatin down Old Nat\n, \ngat tucked and leaned\nI split ya spleen\n, as a matter of fact I split ya team\nNo blood on the sneaks, gotta keep it so my kicks is clean\nI get the cream\n, \ncops see me flick my beams\nI'm allergic so doc' prescribed antihistamines\nOink oink, pig pig, do away with the pork\nOnly silverware I needs a steak knife and a fork\nDid you forget your fuckin manners, I'm Bruce with Banners\nLudacris, Johnny Rockets when I shoot the cannon\nThe wooly mammoth sabretooth, bitch bite your tongue\nI won't stop until I'm rich as them whites'll come\nI pulled up in the black Lotus, your plaques are bogus\nSo I stripped them off the wall\nWaitin for my cue to corner pocket eight balls, you rackin 'em up\nI'm big paper like pancakes, stackin 'em up\nIn fact I'm slappin 'em up, Cadallac'n the truck\nI can't loose with twenty-two, bitch that's what's up\nRunnin in the back to fuck, better tha-than the aquaduct\nChil-li-li-li-li-n.. fli-pi-pi-pi-pi-n, what?\n\nYo, yo, y-y-yo, yo, yo\nY-y-yo yo, yo-yo-yo\nYo yo-yo-yo, yo-yo, yo\nY-yo, yo, yo-yo-yo-yo-yo yo\n\nWelcome to Atlanta where the players play\nAnd we ride on dem thangs like ev-ery day\nBig beats, hit streets, see gangsters roamin\nAnd parties dont stop 'til eight in the mo'nin\nWelcome to Atlanta where the players play\nAnd we ride on dem thangs like ev-ery day\nBig beats, hit streets, see gangsters roamin\nAnd parties dont stop 'til eight in the mo'nin\n\nYo, uhh\nNow the party don't start 'til I walk in\nAnd I usually don't leave until the thang ends\nBut in the meantime, in between time\nYou work yo' thing, I'll work mine\nI been puttin it down here since eighty-three\nSince the Lakeshore/MD rivalry\nWhen Frozen Paradise was the place to be\nIf you was ridin, you was bumping to homie Shy-D\nI'm the M.B.P., Most Ballin-ist Player\nMake my own rules, bitch call me the mayor\nMonday night, Gentlemen's Club\nTuesday night, I'm up in the Velvet Room, gettin fucked up\nWednesday, I'm at Strokers on lean\nThursday, Jump Clean, then I fall up in Kream\nFriday, Shark Bar, \nKaya with Frank Ski\nRight on the flo' is where you can find me\nSaturday, is off the heezy fo' sheezy\nYou can find me up in One-Tweezy\nSunday, is when I get my sleep in\nCause on Monday we be at it again, holla!\n\nYo, yo, y-y-yo, yo, yo\nY-y-yo yo, yo-yo-yo\nYo yo-yo-yo, yo-yo, yo\nY-yo, yo, yo-yo-yo-yo-yo yo\n - repeat 2X",
 "image": "https://images.genius.com/e264fe5517a670d6ad5683d4c6c68ba9.500x500x1.jpg"
}