{
 "title": "When the Last Time",
 "album": "Lord Willin’",
 "year": "2002-07-30",
 "lyrics": "(Get down!)\nNiggas and bitches (Get down!)\nYou are now listening to (Get down!)\nThe real (Get down!)\nAnd that would be (Get down!)\nClipse, The Neptunes (Get down!)\nAnd the new label (Get, get down!)\n(Get down!) Star Trak!\n\nTop down, chrome spinning\nYou see the boss grinning, I'm loving these damn women\nI let two get in, she tried to let the rest fit in\nI'm like, \"Naw love, that's forbidden\"\nI ain't for squishing, that's a problem to the wheel well\nTrust I know them 20's real well\nNow we coasting, me, two chicks and toasting\nI turn up the volume, watch the bass get 'em open\nSoft spoken, with a wild side\nI love 'em in the ride, they lovin' the ride\nWe was moving bodies before we hit the party\nBefore the DJ started cutting (I was already fucking)\nCinderella'd you girls; from nothing to something\nHit the parking lot, hear the club system thumping\nLose the face, you two's was great\nBut it's to the V.I.P., I got new moves to make\n\n(Get down!) When the last time you heard it like this?\nSmoke something, drink something, get ripped\nAnd make the girls in the party just strip\nMove ya ass, girl (Get, get down!)\nOnly if you know you live\nFrom the club to the parking lot\nHow many chicks can you fit in that ride?\nPut 'em up, homie (Get, get down!)\n\nHey, it's just a day in the life\nClub nights, one of the reasons I love life\nChicks be in the back tipsy\nWe gets in for free—\"Ay, they with me\"\nTwo stepping, you see each crew repping\nSlipping on the floor, mirrors and walls is sweating\nShorty in my ear say she got a thong on\nAnd I love how she move any time a song on\nI like that ma, you do something to me\nCome this way and prove something to me\nFast or slow, she got the right moves\nAnd I got the right dough for any date that I choose\nI'm open, but naw, I don't lose focus\nIf the shit jump off, you know the thing that I'm toting\nBut I'm only here to party, y'all\nCarry every weekend like it's Mardi Gras\n\n(Get down!) When the last time you heard it like this?\nSmoke something, drink something, get ripped\nAnd make the girls in the party just strip\nMove ya ass, girl (Get, get down!)\nOnly if you know you live\nFrom the club to the parking lot\nHow many chicks can you fit in that ride?\nPut 'em up, homie (Get, get down!)\n\nYo, you are now listening to the sounds\nThat are vibrating your speakers\nPlease do not be alarmed (Get, get down!)\nIt will not hurt you at all\nFor it is the real\nFor all my real niggas and bitches (Get, get!)\n\nWhen they say, \"Last call\", it don't mean the night's over\nIt mean it's time for her to show ya\nHow quick she can hop out those Gucci loafers\nPin her ass to the sofa and attack the chocha\nS&M chick, asked Pusha to choke her\nBut I thought about how rich I am and said, \"No sir\"\nChick was crazy, gave her crazy space\nWhat did it? The whip appeal or my baby face?\n\nThe night's still young and I'm already leaning\nCruise through the lot on the deuce-two's gleaming\nThe liquor in me and I don't need a reason\nObnoxious with the women, hot tucked in the linen\nI pull up, let her get in, she know from the beginning\nShe added to the list of them chicks that I done been in\nHer head spinning and my head spinning\nMine from juice and gin and hers from neck and chin and\nI'm a winner, man\n\n(Get down!) When the last time you heard it like this?\nSmoke something, drink something, get ripped\nAnd make the girls in the party just strip\nMove ya ass, girl (Get, get down!)\nOnly if you know you live\nFrom the club to the parking lot\nHow many chicks can you fit in that ride?\nPut 'em up, homie (Get, get down!)\nWhen the last time you heard it like this?\nSmoke something, drink something, get ripped\nAnd make the girls in the party just strip\nMove ya ass, girl (Get, get down!)\nOnly if you know you live\nFrom the club to the parking lot\nHow many chicks can you fit in that ride?\nPut 'em up, homie (Get, get down!)\n\nGet down\nGet down\nGet down\nGet down\nGet, get down\nGet down",
 "image": "https://images.genius.com/e4af3105055fc676fefbd416c122d9c0.240x240x1.jpg"
}