{
 "title": "All I Have",
 "album": "This is Me... Then",
 "year": "2002-12-14",
 "lyrics": "Love is life and life is living\nIt's very special\nAll my love…\nOh-oh-oh\nUh, baby, don't go\nAll my, all my, all my love\nBaby, don't go, yeah\nVery special\nBaby, don't go, uh\nAll my love\nBaby, don't go, yeah\nBaby, don't go\nAll my, all my, all my love\nI understand, just chillin'\nBaby, don't go, yeah, yeah\nWhy you actin' like that?\n\nIt's such a shame, but I'm leaving (Uh)\nCan't take the way you mistreated me (Uh)\nAnd it's crazy, but oh, baby (Come on, yo, uh, uh, uh)\nIt don't matter, whatever, don't phase me\nI don't believe you wanna leave like this\nI don't believe I just had my last real kiss\nI do believe we'll laugh and reminisce\nWait a minute, don't bounce, baby, let's talk about this, man\n\nWell, I'm bouncing and I'm out, son (What you want, baby?)\nI gotta leave you alone (Come on now)\n'Cause I'm good, holding down my spot\nAnd I'm good reppin' the girls on the block (Don't go, baby)\nAnd I'm good, I got this thing on lock\nSo without me you'll be fine, right? (Come on, baby)\n\nAll my pride is all I have\nPride is what you had, baby girl, I'm what you have\nYou'll be needing me, but too bad\nBe easy, don't make decisions when you mad\nThe path you chose to run alone\nI know you're independent, you can make it on your own\nHere with me you had a home, oh, yeah\nBut time is of the essence, why spend it alone? Huh\n\nThe nights I waited up for you (Oh, boy)\nPromises you made about coming through\nSo much time you wasted\nThat's why I had to replace you (Uh, uh, uh)\nIt makes a cat nervous, the thought of settling down\nEspecially me, I was creepin' all over town (Creepin')\nI thought my tender touch could lock you down (Yeah)\nI knew I had you, as cocky as it sounds\nThat's the way you used to giggle right before I put it down\nIt's better when you angry, come here, I'll prove it now (Come here)\nStop playing (Haha, aw), you gaming\nI gotta leave you alone (What you want now?)\n\n'Cause I'm good holding my spot\nStop acting like that\nAnd I'm good reppin' the girls on the block\nNow you know you need to stop\nAnd I'm good, I got this thing on lock\nSo without me you'll be fine, right?\nHere we go\n\nAll my pride is all I have\nPride is what you had, baby girl, I'm what you have\nYou'll be needing me, but too bad\nBe easy, don't make decisions when you mad\nThe path you chose to run alone\nI know you're independent, you can make it on your own\nHere with me you had a home, oh, yeah\nBut time is of the essence, why spend it alone? Huh\n\nPeople make mistakes to make up, to break up, to wake up\nCold and lonely, chill, baby, you know me, you love me (Oh)\nI'm like your homie, instead of beefin', come hold me\nI promise I'm not a phony, don't bounce, baby, console me (Come here)\nAin't nothing you can say to me that\nCan change my mind, I got to let you go now (Chill, baby)\nAnd nothing will ever be the same, so just (Yeah)\nBe on your way, go ahead and do your thing now (Baby, don't go)\nAnd there's no more to explain to me, you know (Come on, now)\nI know your game and I'm not feeling what you do (Come on, now)\nSo I'm bouncing and I'm out, son (Don't bounce)\nI gotta leave you alone, yeah, yeah (Don't bounce, don't bounce, baby)\n\nAll my pride is all I have (Don't bounce, baby)\nPride is what you had, baby girl, I'm what you have\nYou'll be needing me, but too bad (Don't bounce, baby)\nBe easy, don't make decisions when you mad (Uh)\nThe path you chose to run alone\nI know you're independent, you can make it on your own\nHere with me you had a home, oh, yeah\nBut time is of the essence, why spend it alone? Huh\nAll my pride is all I have (Don't bounce, baby)\nPride is what you had, baby girl, I'm what you have (Baby, don't go)\nYou'll be needing me, but too bad (You're everything to me)\nBe easy, don't make decisions when you mad (You mean everything to me, baby)\nThe path you chose to run alone\nI know you're independent, you can make it on your own (We all make mistakes, you know what I'm sayin'?)\nHere with me you had a home, oh, yeah (I still love you, baby)\nBut time is of the essence, why spend it alone? Huh (I'll always love you, baby)\n\nI promise you\nYou know what I'm sayin'?",
 "image": "https://images.genius.com/8ad934a83bdff5e364f022829a428028.600x600x1.jpg"
}