{
 "title": "Sic Raro Scribis",
 "album": "The Satires, Epistles, and Art of Poetry of Horace",
 "year": null,
 "lyrics": "Sic Raro Scribis\nDamasippus. Horace\nDamasippus\nSo seldom do you write, we scarcely hear\nYour tablets called for four times in the year:\nAnd even then, as fast as you compose,\nYou quarrel with the thing, and out it goes,\nVexed that, in spite of bottle and of bed,\nYou turn out nothing worthy to be read.\nHow is it all to end? Here you've come down,\nAvoiding a December spent in town:\nYour brains are clear: begin, and charm our ears\nWith something worth your boasting.—Nought appears.\nYou blame your pens, and the poor wall, accurst\nFrom birth by gods and poets, comes off worst.\nYet you looked bold, and talked of what you'd do,\nCould you lie snug for one free day or two.\nWhat boot Menander, Plato, and the rest\nYou carried down from town to stock your nest?\nThink you by turning lazy to exempt\nYour life from envy? No, you'll earn contempt.\nThen stop your ears to sloth's enchanting voice,\nOr give up your best hopes: there lies your choice.\nH. Good Damasippus, may the immortals grant,\nFor your sage counsel, the one thing you want,\nA barber! but pray tell me how yon came\nTo know so well what scarce is known to fame?\nD. Why, ever since my hapless all went down\n'Neath the mid arch, I go about the town,\nAnd make my neighbours' matters my sole care,\nSeeing my own are damaged past repair.\nOnce I was anxious on a bronze to light\nWhere Sisyphus had washed his feet at night;\nEach work of art I criticized and classed,\nCalled this ill chiselled, that too roughly cast;\nPrized that at fifty thousand: then I knew\nTo buy at profit grounds and houses too,\nWith a sure instinct: till the whole town o'er\n\"The pet of Mercury\" was the name I bore.\nH. I know your case, and am surprised to see\nSo clear a cure of such a malady.\nD, Ay, but my old complaint (though strange, 'tis true)\nWas banished from my system by a new:\nJust as diseases of the side or head\nMy to the stomach or the chest instead,\nLike your lethargic patient, when he tears\nHimself from bed, and at the doctor squares.\nH. Spare me but that, I'll trust you.\nD. Don't be blind;\nYou're mad yourself, and so are all mankind,\nIf truth is in Stertinius, from whose speech\nI learned the precious lessons that I teach,\nWhat time he bade me grow a wise man's beard,\nAnd sent me from the bridge, consoled and cheered.\nFor once, when, bankrupt and forlorn, I stood\nWith muffled head, just plunging in the flood,\n\"Don't do yourself a mischief,\" so he cried\nIn friendly tones, appearing at my side:\n\"'Tis all false shame: you fear to be thought mad,\nNot knowing that the world are just as bad.\nWhat constitutes a madman? if 'tis shown\nThe marks are found in you and you alone,\nTrust me, I'll add no word to thwart your plan,\nBut leave you free to perish like a man.\nThe wight who drives through life with bandaged eyes,\nIgnorant of truth and credulous of lies,\nHe in the judgment of Chrysippus' school\nAnd the whole porch is tabled as a fool.\nMonarchs and people, every rank and age,\nThat sweeping clause includes,—except the sage.\n\"Now listen while I show you, how the rest\nWho call you madman, are themselves possessed.\nJust as in woods, when travellers step aside\nFrom the true path for want of some good guide,\nThis to the right, that to the left hand strays,\nAnd all are wrong, but wrong in different ways,\nSo, though you're mad, yet he who banters you\nIs not more wise, but wears his pigtail too.\nOne class of fools sees reason for alarm\nIn trivial matters, innocent of harm:\nStroll in the open plain, you'll hear them talk\nOf fires, rocks, torrents, that obstruct their walk:\nAnother, unlike these, but not more sane,\nTakes fires and torrents for the open plain:\nLet mother, sister, father, wife combined\nCry 'There's a pitfall! there's a rock! pray mind!'\nThey'll hear no more than drunken Fufius, he\nWho slept the part of queen Ilione,\nWhile Catienus, shouting in his ear,\nRoared like a Stentor, 'Hearken, mother dear!'\n\"Well, now, I'll prove the mass of humankind\nHave judgments just as jaundiced, just as blind.\nThat Damasippus shows himself insane\nBy buying ancient statues, all think plain:\nBut he that lends him money, is he free\nFrom the same charge? 'O, surely.' Let us see.\nI bid you take a sum you won't return:\nYou take it: is this madness, I would learn?\nWere it not greater madness to renounce\nThe prey that Mercury puts within your pounce?\nSecure him with ten bonds; a hundred; nay,\nClap on a thousand; still he'll slip away,\nThis Protean scoundrel: drag him into court,\nYou'll only find yourself the more his sport:\nHe'll laugh till scarce you'd think his jaws his own,\nAnd turn to boar or bird, to tree or stone.\nIf prudence in affairs denotes men sane\nAnd bungling argues a disordered brain,\nThe man who lends the cash is far more fond\nThan you, who at his bidding sign the bond.\n\"Now give attention and your gowns refold,\nWho thirst for fame, grow yellow after gold,\nVictims to luxury, superstition blind,\nOr other ailment natural to the mind:\nCome close to me and listen, while I teach\nThat you're a pack of madmen, all and each.\n\"Of all the hellebore that nature breeds,\nThe largest share by far the miser needs:\nIn fact, I know not but Anticyra's juice\nWas all intended for his single use.\nWhen old Staberius died, his heirs engraved\nUpon his monument the sum he'd saved:\nFor, had they failed to do it, they were tied\nA hundred pair of fencers to provide,\nA feast at Arrius' pleasure, not too cheap,\nAnd corn, as much as Afric's farmers reap.\n'I may be right, I may be wrong,' said he,\n'Who cares? 'tis not for you to lecture me.'\nWell, one who knew Staberius would suppose\nHe was a man that looked beyond his nose:\nWhy did he wish, then, that his funeral stone\nShould make the sum he left behind him known?\nWhy, while he lived, he dreaded nothing more\nThan that great sin, the sin of being poor,\nAnd, had he left one farthing less in purse,\nThe man, as man, had thought himself the worse:\nFor all things human and divine, renown,\nHonour, and worth at money's shrine bow down:\nAnd he who has made money, fool or knave,\nBecomes that moment noble, just, and brave.\nA sage, you ask me? yes, a sage, a king,\nWhate'er he chooses; briefly, everything.\nSo good Staberius hoped each extra pound\nHis virtue saved would to his praise redound.\nNow look at Aristippus, who, in haste\nTo make his journey through the Libyan waste,\nBade the stout slaves who bore his treasure throw\nTheir load away, because it made them slow.\nWhich was more mad? Excuse me: 'twill not do\nTo shut one question up by opening two.\n\"If one buys fiddles, hoards them up when bought,\nThough music's study ne'er engaged his thought,\nOne lasts and awls, unversed in cobbler's craft,\nOne sails for ships, not knowing fore from aft,\nYou'd call them mad: but tell me, if you please,\nHow that man's case is different from these,\nWho, as he gets it, stows away his gain,\nAnd thinks to touch a farthing were profane?\nYet if a man beside a huge corn-heap\nLies watching with a cudgel, ne'er asleep,\nAnd dares not touch one grain, but makes his meat\nOf bitter leaves, as though he found them sweet:\nIf, with a thousand wine-casks—call the hoard\nA million rather—in his cellars stored,\nHe drinks sharp vinegar: nay, if, when nigh\nA century old, on straw he yet will lie,\nWhile in his chest rich coverlets, the prey\nOf moth and canker, moulder and decay,\nFew men can see much madness in his whim,\nBecause the mass of mortals ail like him.\n\"O heaven-abandoned wretch! is all this care\nTo save your stores for some degenerate heir,\nA son, or e'en a freedman, who will pour\nAll down his throttle, ere a year is o'er?\nYou fear to come to want yourself, you say?\nCome, calculate how small the loss per day,\nIf henceforth to your cabbage you allow\nAnd your own head the oil you grudge them now.\nIf anything's sufficient, why forswear,\nEmbezzle, swindle, pilfer everywhere?\nCan you be sane? suppose you choose to throw\nStones at the crowd, as by your door they go,\nOr at the slaves, your chattels, every lad\nAnd every girl will hoot yon down as mad:\nWhen with a rope you kill your wife, with bane\nYour aged mother, are you right in brain?\nWhy not? Orestes did it with the blade,\nAnd 'twas in Argos that the scene was laid.\nThink you that madness only then begun\nTo seize him, when the impious deed was done,\nAnd not that Furies spurred him on, before\nThe sword grew purple with a parent's gore?\nNay, from the time they reckon him insane,\nHe did no deed of which you could complain:\nNo stroke this madman at Electra aims\nOr Pylades: he only calls them names,\nFury or other monster, in the style\nWhich people use when stirred by tragic bile.\n\"Opimius, who, with gold and silver store\nLodged in his coffers, ne'ertheless was poor\n(The man would drink from earthen nipperkin\nFlat wine on working-days, on feast-days thin),\nOnce fell into a lethargy so deep\nThat his next heir supposed it more than sleep,\nAnd entering on possession at his ease,\nWent round the coffers and applied the keys.\nThe doctor had a conscience and a head:\nHe had a table moved beside the bed,\nPoured out a money-bag, and bade men come\nAnd ring the coin and reckon o'er the sum:\nThen, lifting up his patient, he began:\n'That heir of yours is plundering you, good man.\n'What? while I live?' 'You wish to live? then take\nThe necessary steps: be wide awake.'\n'What steps d'ye mean?' 'Your strength will soon run short,\nUnless your stomach have some strong support.\nCome, rouse yourself: take this ptisane of rice.'\n'The price?' 'A trifle.' 'I will know the price.'\n'Eight-pence.' 'O dear! what matters it if I\nDie by disease or robbery? still I die.'\n\"'Who then is sane?' He that's no fool, in troth.\n'Then what's a miser?' Fool and madman both.\n'Well, if a man's no miser, is he sane\nThat moment?' No. 'Why, Stoic?' I'll explain.\nThe stomach here is sound as any bell,\nCraterus may say: then is the patient well?\nMay he get up? Why no; there still are pains\nThat need attention in the side or reins.\nYou're not forsworn nor miserly: go kill\nA porker to the gods who ward off ill.\nYou're headlong and ambitious: take a trip\nTo Madman's Island by the next swift ship.\nFor where's the difference, down the rabble's throat\nTo pour your gold, or never spend a groat?\nServius Oppidius, so the story runs,\nRich for his time, bequeathed to his two sons\nTwo good-sized farms, and calling to his bed\nThe hopeful youths, in faltering accents said:\n'E'er since I saw you, Aulus, give away\nYour nuts and taws, or squander them at play,\nWhile you, Tiberius, careful and morose,\nWould count them over, hide them, keep them close,\nI've feared lest both should err in different ways,\nAnd one have Cassius', one Cicuta's craze.\nSo now I beg you by the household powers\nWho guard, and still shall guard, this roof of ours,\nThat you diminish not, nor you augment\nWhat I and nature fix for your content.\nTo bar ambition too, I lay an oath\nOf heaviest weight upon the souls of both;\nShould either be an aedile, or, still worse,\nA praetor, let him feel a father's curse.\nWhat? would you wish to lavish my bequest\nIn vetches, beech-nuts, lupines and the rest,\nYou, that in public you may strut, or stand\nAll bronze, when stripped of money, stripped of land;\nYou, that Agrippa's plaudits you may win,\nA sneaking fox in a brave lion's skin?'\n\"What moves you, Agamemnon, thus to fling\nGreat Ajax to the dogs? 'I am a king.'\nAnd I a subject: therefore I forbear\nMore questions. 'Right; for what I will is fair:\nYet, if there be who fancy me unjust,\nI give my conduct up to be discussed.'\nMightiest of mighty kings, may proud success\nAnd safe return your conquering army bless!\nMay I ask questions then, and shortly speak\nWhen you have answered? 'Take the leave you seek.'\nThen why should Ajax, though so oft renowned\nFor patriot service, rot above the ground,\nYour bravest next Achilles, just that Troy\nAnd envious Priam may the scene enjoy,\nBeholding him, through whom their children came\nTo feed the dogs, himself cast out to shame?\n'A flock the madman slew, and cried that he\nHad killed my brother, Ithacus, and me.'\nWell, when you offered in a heifer's stead\nYour child, and strewed salt meal upon her head,\nThen were you sane, I ask you? 'Why not sane?'\nWhy, what did Ajax when the flock was slain?\nHe did no violence to his wife or child:\nHe cursed the Atridae, true; his words were wild;\nBut against Teucer ne'er a hand he raised,\nNor e'en Ulysses: yet you call him crazed.\n'But I, of purpose, soothed the gods with blood,\nTo gain our fleet free passage o'er the flood.'\nBlood! ay, your own, you madman. 'Nay, not so:\nMy own, I grant it: but a madman's, no.'\n\"He that sees things amiss, his mind distraught\nBy guilty deeds, a madman will be thought;\nAnd, so the path of reason once be missed,\nWho cares if rage or folly gave the twist?\nWhen Ajax falls with fury on the fold,\nHe shows himself a madman, let us hold:\nWhen you, of purpose, do a crime to gain\nA meed of empty glory, are you sane?\nThe heart that air-blown vanities dilate,\nWill medicine say 'tis in its normal state?\nSuppose a man in public chose to ride\nWith a white lambkin nestling at his side,\nCalled it his daughter, had it richly clothed,\nAnd did his best to get it well betrothed,\nThe law would call him madman, and the care\nOf him and of his goods would pass elsewhere.\nYou offer up your daughter for a lamb;\nAnd are you rational? Don't say, I am.\nNo; when a man's a fool, he's then insane:\nThe man that's guilty, he's a maniac plain:\nThe dupe of bubble glory, war's grim queen\nHas dinned away his senses, clear and clean.\n\"Cassius and luxury! hunt that game with me;\nFor spendthrifts are insane, the world shall see.\nSoon as the youngster had received at last\nThe thousand talents that his sire amassed,\nHe sent round word to all the sharking clan,\nPerfumer, fowler, fruiterer, fisherman,\nVelabrum's refuse, Tuscan Alley's scum,\nTo come to him. next morning. Well, they come.\nFirst speaks the pimp: 'Whatever I or these\nPossess, is yours: command it when you please.'\nNow hear his answer, and admire the mind\nThat thus could speak, so generous and so kind.\n'You sleep in Umbrian snow-fields, booted o'er\nThe hips, that I may banquet on a boar;\nYou scour the sea for fish in winter's cold,\nAnd I do nought; I don't deserve this gold:\nHere, take it; you a hundred, you as much,\nBut you, the spokesman, thrice that sum shall\ntouch.'\n\"AEsopus' son took from his lady dear\nA splendid pearl that glittered in her ear,\nThen melted it in vinegar, and quaffed\n(Such was his boast) a thousand at a draught:\nHow say you? had the act been more insane\nTo fling it in a river or a drain?\n\"Arrius' two sons, twin brothers, of a piece\nIn vice, perverseness, folly, and caprice,\nWould lunch off nightingales: well, what's their mark?\nShall it be chalk or charcoal, white or dark?\n\"To ride a stick, to build a paper house,\nPlay odd and even, harness mouse and mouse,\nIf a grown man professed to find delight\nIn things like these, you'd call him mad outright.\n\"Well now, should reason force you to admit\nThat love is just as childish, every whit;\nTo own that whimpering at your mistress' door\nIs e'en as weak as building on the floor;\nSay, will you put conviction into act,\nAnd, like young Polemo, at once retract;\nTake off the signs and trappings of disease,\nYour leg-bands, tippets, furs, and muffatees,\nAs he slipped off his chaplets, when the word\nOf sober wisdom all his being stirred?\n\"Give a cross child an apple: 'Take it, pet:'\nHe sulks and will not: hold it back, he'll fret.\nJust so the shut-out lover, who debates\nAnd parleys near the door he vows he hates,\nIn doubt, when sent for, to go back or no,\nThough, if not sent for, he'd be sure to go.\n'She calls me: ought I to obey her call,\nOr end this long infliction once for all?\nThe door was shut:'tis open: ah, that door!\nGo back? I won't, however she implore.'\nSo he. Now listen while the slave replies,\nAnd say if of the two he's not more wise:\n'Sir, if a thing is senseless, to bring sense\nTo bear upon it is a mere pretence;\nNow love is such a thing, the more's the shame;\nFirst war, then peace, 'tis never twice the same,\nFor ever heaving, like a sea in storm,\nAnd taking every hour some different form.\nYou think to fix it? why, the job's as bad\nAs if you tried by reason to be mad.'\n\"When you pick apple-pips, and try to hit\nThe ceiling with them, are you sound of wit?\n\"When with your withered lips you bill and coo,\nIs he that builds card-houses worse than you?\nThen, too, the blood that's spilt by fond desires,\nThe swords that men will use to poke their fires!\nWhen Marius killed his mistress t'other day\nAnd broke his neck, was he demented, say?\nOr would you call him criminal instead,\nAnd stigmatize his heart to save his head,\nFollowing the common fallacy, which founds\nA different meaning upon different sounds?\n\"There was an aged freedman, who would run\nFrom shrine to shrine at rising of the sun,\nSober and purified for prayer, and cry\n'Save me, me only! sure I need not die;\nHeaven can do all things:' ay, the man was sane\nIn ears and eyes: but how about his brain?\nWhy, that his master, if not bent to plead\nBefore a court, could scarce have guaranteed.\nHim and all such Chrysippus would assign\nTo mad Menenius' most prolific line.\n\"'Almighty Jove, who giv'st and tak'st away\nThe pains we mortals suffer, hear me pray!'\n(So cries the mother of a child whose cold,\nOr ague rather, now is five months old)\n'Cure my poor boy, and he shall stand all bare\nIn Tiber, on thy fast, in morning air.'\nSo if, by chance or treatment, the attack\nShould pass away, the wretch will bring it back,\nAnd give the child his death: 'tis madness clear;\nBut what produced it? superstitious fear.\"\nSuch were the arms Stertinius, next in sense\nTo the seven sages, gave me for defence.\nNow he that calls me mad gets paid in kind,\nAnd told to feel the pigtail stuck behind.\nH. Good Stoic, may you mend your loss, and sell\nAll your enormous bargains twice as well.\nBut pray, since folly's various, just explain\nWhat type is mine? for I believe I'm sane.\nD. What? is Agave conscious that she's mad\nWhen she holds up the head of her poor lad?\nH. I own I'm foolish—truth must have her will—\nNay, mad: but tell me, what's my form of ill?\nD. I'll tell you. First, you build, which means you try\nTo ape great men, yourself some two feet high,\nAnd yet you laugh to see poor Turbo fight,\nWhen he looks big and strains beyond his height.\nWhat? if Maecenas does a thing, must you,\nHis weaker every way, attempt it too?\nA calf set foot on some young frogs, they say,\nOnce when the mother chanced to be away:\nOne 'scapes, and tells his dam with bated breath\nHow a huge beast had crushed the rest to death:\n\"How big?\" quoth she: \"is this as big?\" and here\nShe swelled her body out. \"No, nothing near.\"\nThen, seeing her still fain to puff and puff,\n\"You'll burst,\" gays he, \"before you're large enough.\"\nMethinks the story fits you. Now then, throw\nYour verses in, like oil to feed the glow.\nIf ever poet yet was sane, no doubt,\nYou may put in your plea, but not without.\nYour dreadful temper—\nH. Hold.\nD. The sums you spend\nBeyond your income—\nH. Mind yourself, my friend.\nD. And then, those thousand flames no power can cool.\nH. O mighty senior, spare a junior fool!",
 "image": "https://images.genius.com/4ea3ec411d738eb82fa546ae8794daf2.298x298x1.jpg"
}