{
 "title": "How You Gonna Act Like That",
 "album": "I Wanna Go There",
 "year": "2002-11-19",
 "lyrics": "It seems like just the other day that we hooked up\n(I was drivin', you was walkin' and I swooped you up)\nFrom that moment on I knew you were the one, yeah\n(I was single, you was lonely and we fell in love)\nWe would sit and talk for hours about anything\n(Baby, you hang up, no, you hang up, on three hang up)\nI bought your whip, I paid your rent, I gave you everything\n(Said you'd always be my baby then you bounced)\nHow you gonna?\n\nHow you gonna up and leave me now?\nHow you gonna act like that?\nHow you gonna change it up, we just finished makin' up?\nHow you gonna act like that?\nHow you gonna act like we don't be makin' love\nYou know we be tearin' it up, breakin' stuff, that ghetto love\nHow you gonna trip, how could you forget\nHow you gonna act like that\n\nGirl, I never thought that lovin' you would hurt\n(I did everything a good man would to make it work)\nGirl, you should have told me you had second thoughts\n(Like before I put the down on the house we bought)\nNow I'm thinkin' you and me was a mistake\n(But then it hits me and I'm missin' all the love we made)\nGirl, I know that we've been goin' through some things, yeah\n(But the sun is somewhere shinin' even when it rains, oh)\n\nI'll be the one you kick it to\nI'll be the one that misses you\nI'll be the one to ease your pain\nI'll be the one you won't forget\nAnd you'll be the one I can't forget\nYou'll be the one that's Heaven sent\nYou'll be the one I can't deny\nYou'll be the one that makes me cry, baby\n\nHow you gonna up and leave me now? (Why you do)\nHow you gonna act like that? (Why you gotta act like this?)\nHow you gonna change it up? (Whoa, ho, baby) We just\nFinished makin' up\nHow you gonna act like that? (But I need you)\nHow you gonna act like we (Oh) don't be makin' love\n(Whoa: baby, baby)\nYou know we be tearin' it up, breakin' stuff, that ghetto love\nHow you gonna trip, how could you forget?\nHow you gonna act like that?\n\nYou know I'm willin' to do anything\nJust to keep you in my heart (Keep you in my heart)\nI messed around and gave up everything\nI thought we'd never part (Yes, I did, baby)\nI was a player and made the choice to give my heart to you\nAnd I gotta keep it that way, ooh, baby\n\nHow you gonna up and leave me now? (Ooh, baby)\nHow you gonna act like that? (Why you gotta treat me this way?)\nHow you gonna change it up? (Why you treat me wrong?)\nWe just finished makin' up\nHow you gonna act like that? (Can me somebody tell me why)\nHow you gonna act (Why, why) like we don't be makin' love? (Hey)\nYou know we be tearin' it up, breakin' stuff, (Oh, oh, baby) that ghetto love\nHow you gonna trip? (All my friends became your friends)\nHow can you forget? (All my ends became your ends)\nHow you gonna act like that\n\nKeepin' love ghetto (All I want is you)\nKeepin' love ghetto (All I need is you)\nKeepin' love ghetto (All I need is you)\nKeepin' love ghetto (All I need is you, all I need is you, babe)\n\nHow you gonna up and leave me now? (Oh, babe, how you gonna act like that)\nHow you gonna act like that? (Hey, hey)\nHow you gonna change it up? (Oh) We just finished\nMakin' up (Why you actin' so changed, oh, oh, baby)\nHow you gonna act like that? (Anything you want in me I got ya, hey)\nHow you gonna act like we don't be makin' love?\nYou know we be tearin' it up, breakin' stuff (Why you actin' so changed), that ghetto love\nHow you gonna trip? (Oh, oh, baby)\nHow can you forget?\nHow you gonna act like that?",
 "image": "https://images.genius.com/2cd7bec62c784c7d2cc444adc4ce5cc2.300x300x1.jpg"
}