{
 "title": "I Love You",
 "album": null,
 "year": "2017-10-22",
 "lyrics": "Swag\nThis record right here is for the fans, AKA all my niggas and niggeroids who listen to my music\nI fuck with y'all\n(\nDBangz, can you eat my ass?\n)\n\nI love all the people that fuck with my music\n (wow)\nBitch I'm on iTunes go peep on my new shit (swag)\nYo girl she obsessing on DBangz you knew it (swag)\nI suck on her ankle (swag, swag)\nYou know how I do it (swag)\nI'm famous as fuck but I know that I'm garbage (trash)\nY'all say that I'm good but y'all must be retarded (trash)\nI \nopen my Snapchat then I get bombarded\n (DBangz)\nI go to Goodwill and then flex off of the bargain\n\nI'll come to your house suck the dust out your vacuum\nI pull my pants down when I go to the bathroom (wow)\nI got too much swag I might give me a septum\nI really like women you know I respect them (wow)\nI wear overalls just to flex on these bitches\nBitch I'm DBangz I get neck from these bitches (cool)\nAll of these niggas spend checks on these bitches (rad)\nI really don't wanna stand next to these bitches (wow)\nYou know how I'm working (swag)\nI'll tickle your shoulder\nIn a few years and my flow a little colder\nShe just wanna fuck but I just wanna hold her (DBangz)\nMy dick two inches I already told her (trash)\nYo get the fuck out when you know I'm recording\nBitch I wear Vans and y'all still wearing Jordan's\nWhen I wake up my fans tell me good morning\nI look at your bitch and then she started moaning\n (garbage)\n\nBack in the day y'all used to make fun of me\nStill cracking jokes but at least I got money\nI need me a girl that's cute and that's chubby but fuck I'm so ugly a girl won't be loving (damn)\nI'm ugly as fuck but at least I got stamina (damn)\nGot a few bitches but they live in Canada (whoa)\nI got no bitches man I'm hella lonely\nI rap about bitches but I'm just a phony (shame)\nI rap about money but I eat baloney (wow)\nAnd ramen and jelly with cold ravioli (whoa)\nI whip with the Rolex wait I ain't got cash (swag)\nBitch I'm DBangz and I might eat your ass (wow)\nMy fans they all love me but I'm fucking trash (dude)\nNo clout or no bitches well that's in the past\n (yeah)\nI suck on your ankle and give you a rash (wow)\nLike Usher I love her but I'll have to pass\n\nDude... (I'll have to pass)\nDBangz, that was so fire! (DBangz got no swag) (true)\nDBangz is so trash, DBangz got\nNo flow with no clothes\nI'll fuck yo nigga, no homo\n!\nAyy!\nWow, \nMr. Cumstain Booty Bandit Eater Man\n!\nThat shit was low-key trash!\nBut I fuck with it, man!\nDBangz on iTunes, Spotify, Google Play, Amazon, and uh...\nWhat's the other one?\nTIDAL. Yeah.\nGo peep that.\nWhole lot of gang shit.",
 "image": "https://images.genius.com/b1dc3fe93fa39ced6fa1e21132e581e2.1000x1000x1.png"
}