{
 "title": "Knock Knock",
 "album": "After the Storm",
 "year": null,
 "lyrics": "Hey, yo, Mo, open up the door, man\nI'm sorry, baby, open up the door\nYou got these dogs out here, they gon' bite me\nPoodles and rabbits and all of it\nOpen the door man, I'm sorry, man\nI love you\n\n(It's funny how the tables turn, turn, turn, turn)\nUh-uh (Oh-ooh) and it's so, woo\n(Woo-ooh, yeah) This that hot\n(Woo-yeah) Uh-huh, yeah\nNew Monica!\n\nIt's funny how the tables turn\nNow it's you running after me (Uh)\nDidn't wanna spend quality time\nDidn't think I would ever leave (Woo)\nYou got way too comfortable (Oh)\nNow you say you want me in your life (Uh)\n'Cause I've packed up all my shh (Woo)\nI'm moving in my new place tonight\n\nSo don't you, knock knock knock\nStop knockin' (Stop knockin')\nDon't come knockin' on my door (Yeah)\n(Ooh yeah) Ring ring ring (Ring)\nLet the phone stop (Oh)\nI don't want you calling me no mo'\n{Uh-huh, so, so}\n\nBoy, it's a dangerous game\nTo try and play a chick like me (Uh)\nWanna go out and do ya thing\nI'll be out 'fore you count to three\nSo do just what you want\nAny time that you really like\nI put a payment on my place\nYou'll be sleeping alone tonight\n\nSo don't you, knock knock knock (Knockin', oh)\nStop knockin', don't come knockin' on my door\n(Don't you come knockin' at, woo, hey)\nRing ring ring (Ring)\nLet the phone stop (Oh)\nI don't want you calling me no mo'\n{Uh-huh, so, so} (Yeah)\n\nI used to be \"So Gone\"\nYou were someone I could lean on\nMy life support system\nAnd I thought I couldn't breathe, uh-uh\nWhen you used to leave, yup yup (Yeah) {Oh}\nI see you got your clean one\nBig chains, gold teeth and your gleam on\nAll night, wanna be gone\nWanna tell me stay home like I got a uhh ring on {Woo}\nNow you say I'm not your wife, right right {Uh}\nSo why should I be chillin', goodnight goodnight {Uh}\nNow pack up my things for a flight {Oh}\nI got a place and it's fixed up nice {Come on}\nSo don't come knockin' at my door {Yeah!}\nI got company coming 'round four {Uh-uh}\nSo, whoa, heh-heh, yeah {Ooh}\n\nI don't want you calling me no mo'\nKnock knock knock {Oh}\nStop knockin', don't come knockin' on my door\n(Ring ring ring) Ring ring ring\nLet the phone stop (Please, won't it stop)\nI don't want you calling me no mo'\nDon't come knockin' on my door {Uh-huh, so, so}\nDon't come knockin' on my door\nOoh, ooh, uhh, ooh-ooh, uhh\nDon't come knockin' on my door\n(Oh, ohh-uhh, yeah, yeah, yeah)\nDon't come knockin' on my door\nOoh-ooh, uh (Changed my locks) ooh-uh (To my crib)\nDon't come knockin' on my door, oh (Can't come in, oh) Oh\nI don't want you calling me no mo'\nDon't come knockin' on my door (Changed my locks, to my crib)\nDon't come knockin' on my door (Can't come in, uh) Ooh\nI don't want you calling me no mo'\n[Outro: Monica & \nMissy Elliott\n]\nHey, this Monica, leave a number after the beep\nHey, yo, Mo, pick up the phone, man\nThis old raggedy cell phone sounding like an old alarm clock, old switchboard line phone. Do you even have call waiting on this joint, man? Call me back, man, you're late for the studio. Dismissed",
 "image": "https://images.rapgenius.com/51c2622a8c3480b93ff8c825e3437c35.450x447x1.jpg"
}