{
 "title": "Let’s Get Down",
 "album": "Unleashed",
 "year": "2003-06-24",
 "lyrics": "Birdman! (lady's and gentlemen) mm-huh!\nJazzy Fizzle product-shizzle my nizzle\nOh boy! with Lil' Bow Wizzle (Bow Wizzle)\nAy...ay, I see you with shorty huh\nTake her to tha mall pimp! (ah-huh) Okay!\nShow me how lil man roll! (ooowwee!)\n\nI know this chick named Nicole\nThey call her bougie\nDidn't wanna shop nowhere but Gucci\n (but Gucci)\nAnd Burberry and Prada was her style (OK)\nI'm tryin' to tell y'all that shorty could get down (uh-wow)\nConversations amazing\nIn my 4, shorty's in heavy rotation (fo sho)\nThinkin' to myself like, this is the one\nBroke her down, \ntold shorty how to do this hun!\n (fo sho)\nNeva gave her the cold shoulder\nIf she's in the Benz, I let her take ova' the Rover (vrrm-vrrm!)\nThen it's off to the movies, tell her\nI'm like Austin, Let's get groovyyyy!\nFrom the movies to the crib\nGit her(?) for ya heard that's what I did, and! (OK)\nI'll find me another one\nMore interesting, more fun\nThe man has just begun!\n\nIt's really, really nice to meet ya Ma (what's happenin')\nI'm really,really diggin' yo style (yo style)\nSay you wanna go chill with a baller huh (Bow Weezy Baby!)\nLet's get down!\n\nIt's really, really nice to meet ya boy\nYa know I'm really feelin' yo style\nYa know I wanna chill with a baller so\nLets get down!\n\nAy! I see what cha doin' Lil Bow Wow (uh-huh)\nYa had a date\nYa did that. Now I want you to go world wide with it\nEast Coast, West coast, mid-west, and down bound\n\nI know this girl named Cindy (OK)\nLoves to rock Fendi (wow)\nWhen she leaves the mall\nThe stores is all empty\nEast coast, New York, my up town chick (wow)\nI see her when I cruise the Park and 106 (holla)\nNext...Her name is Renee (ghetto chick)\nShe lives on the west side I hit the L.A.X. (OK)\nI'm so impressed by the way that she dress (she got gear)\nShe walks like a model, the girl is so fresh (so fresh)\nI got a few of them, here's what I do to them (what chu' do?)\nTake 'um out, try to teach somethin' new to them (hah-ok)\nIt's no thang, when you heavy in the game\nI got another one who loves the mid-west swing! (St. Louie)\nShe's from the show-men state\nSo I showed her my 'B' and my quarter to eight, hey! (do your thang)\nI know you caught on late\nBut that's 7:45\nNow shorty, now let's ride\nHop in the whip!\n\n\nAy! now I'm about to test your P's Lil Bow Wow\n(uh-huh) See lil' one ova' there\nShe bout 25, and she been lookin' at cha'\nPull over there in ya ride on 22's and bust her out!\n\nI know this girl named Keisha\nShe's no groupie\nBe far from the stars\n22's made her choose me\nLike ooh wee!\nTellin' all her friends in the Benz\nHe don't really look 16 do he?'\n112, youngest thing on the scene\nCouldn't believe when I seen\nHow she squeezed in them jeans\nLooks like a tight situation\nMake a young man make flight reservations\nJust step, no intimidation's\nI'm Bow Wow boo\nAccept no imitations\nShould have seen the looks on they faces\nThe ice plus light, makes for good conversation\nYou tellin' me\nIt's a felony, to yell at me\nI blew her mind she was dazed momentarily\nBut luckily\nShe stayed for some therapy\nI stay pimpin' heavily\nMy game spittin' thoroughly (ha ha ha)\n\nShorty (shorty) you lookin' fly boy certified\nYa went platinum, round the world coast to coast\nYa good wit me. ya get a stunna certification\nR.R.A.A. ya good player Lil Bow Weezy\nIt's yo turn shine baby (shine baby boy) do you lil daddy. (do you)\nBow Weezy baby!.....\nLive it up Bird call Baby!\nShorty (shorty) 5 ft. pimpin' boy\nYa good wit me lil one. let's roll!\n\nIt's really, really nice to meet ya boy\nYa know I'm really feelin' yo style\nYa know I wanna chill with a baller so\nLets get down!",
 "image": "https://images.genius.com/4ef1ee956bb1072efea581170866f0f8.1000x1000x1.jpg"
}