{
 "title": "Mesmerize",
 "album": "The Last Temptation",
 "year": "2002-11-19",
 "lyrics": "Haha, yeah\nWhattup ma? How you been?\nYeah I know, I know, hehe\nIt's all good.. (Murder Inc.)\n\nGirl, your stare, those eyes I (Love it when you look at me, baby)\nYour lips, your smile, I (Love it when you kiss me, baby)\nYour hips, those thighs, I (Love it when you thug me, baby)\nAnd I can't deny I \n(Love it when I'm witchu, baby)\n\nI got a fetish for fuckin' you witcha skirt on\nOn the backstreet in the back seat of the Yukon\nWhat's takin' so long? I'm gettin' anxious\nBut patiently waitin' for you to tell a nigga to move on\nBetween me and you, we can find each other\nFlyin' abroad in my private G-2\nI ain't tryin' to G you, ma I'm tryin to see you\nBend over, you know how we do it, feet to shoulders\nBring heat to coldest night, so ferocious\nNow you street promotin' the dick game is potent\n'Cause in the bed a nigga go hard like Jordan\nSweat pourin', lovin' the way you be moanin'\nGrippin' the sheets, lookin' at me lickin' at me\n'Cause every woman just wanna be happy\nAnd it's CRA-ZAY, but BAY-BAY, I... (love it when I'm witchu, baby)\n\nGirl, your stare, those eyes, I (Love it when you look at me, baby)\nYour lips, your smile, I (Love it when you kiss me, baby)\nYour hips, those thighs, I (Love it when you thug me, baby)\nAnd I can't deny I (Love it when I'm witchu, baby)\n\nI wanna get away, 'cause you know like I know\nAnd there's a better day, a-comin, I'm hooked on your lovin'\nBelieve me, and when you hold my body\nI know you need me, wait for me bay-bay\nI've been goin half crazy for your love\nAnd I was told that the sex, better than drugs\nThen get addicted, boy listen\nI'm the only piece of the puzzle you're missin\nLike when we kissin' - bye bye bye\nYou got a girl that'll - ride ride ride\nSo take me, tonight\nAnd do what you do to me, baby\n\nGirl, your stare, those eyes, I (Love it when you look at me, baby)\nYour lips, your smile, I (Love it when you kiss me, baby)\nYour hips, those thighs, I (Love it when you thug me, baby)\nAnd I can't deny I (Love it when I'm witchu, baby)\n[Verse 3: Ja Rule & \nAshanti\n]\nShorty, are you really gettin' bored with me, or him?\n'Cause though I play a lot of games, I play 'em to win\nBut then again I'm still young and I'm livin' my life\nYou know you're right and I'm the type\nTo pull up to your bumper, get your number\nBaby, I can only help but wonder\nWhat life would be without \n(my sweet baby)\nAnd you're my baby \n(holla if you hear me)\nAh-ah-ah\nYou can understand that my love is pain\nAnd how I feel in vain, it's just a woman thang\nIt's a man's world, but I understand\nBut there's still nothin' different, boy, stick to the plan\nYou be my down ass, witcha round ass\nI know I'm feelin you\n (like you feelin' me)\nThe way you're holdin my body, the way you touch me\n\nGirl, your stare, those eyes, I (Love it when you look at me, baby)\nYour lips, your smile, I (Love it when you kiss me, baby)\nYour hips, those thighs, I (Love it when you thug me, baby)\nAnd I can't deny I (Love it when I'm witchu, baby)\n\nI love when you touch me, baby\nAll over my body, baby\nI love when you kiss me, baby\nAll over my body, baby\nI love when you touch me, baby\nAll over my body, baby\nI love when you kiss me, baby\nAll over my body, baby\n\nGirl, your stare, those eyes, I (Love it when you look at me, baby)\nYour lips, your smile, I (Love it when you kiss me, baby)\nYour hips, those thighs, I (Love it when you thug me, baby)\nAnd I can't deny I (Love it when I'm witchu, baby)\n\nBabycakes, you motherfucker, you sons of bitches\nAin't none of these niggas real like us\nYa underdig?\nAnd yes sir, we here to stay\nRight now\nLet's get into this motherfucker\nYa understand?",
 "image": "https://images.genius.com/e0e45dd271235559138a99fa29d878fd.501x501x1.jpg"
}