{
 "title": "Ooh",
 "album": "Yellow Tape",
 "year": "2020-01-31",
 "lyrics": "(Let the band play) Glizzock\nYeah, yeah\n\nBitch, I'm that nigga, uh, yuh\nI be fresh as fuck, still don't take pictures, nah\nDawg, ain't shit change but my earrings a lil' bigger, uh\nFranklin, Grants and Jacksons stuffed in my Gameri denims, uh\nMoney talks, nigga, you see these diamonds in my dental, yuh\nGlizzock, he's a lion, tiger, bear slash gorilla\nLord knows I'm a sinner but I still one blessed-ass nigga, yuh\nCheck my credentials, uh, yeah, bitch\nI been sippin', sippin', they say I'm trippin' out, huh\nI stuff them Benji's in my pants, it got me limpin' out, uh\nAll these damn blues, they thought I was crippin' out, huh\nI'm like \"Who?\" (Who?) \"Who, nigga, who?\" (Who?) \"Who?\" (Who?)\nI got killers come through shoot you, you and you, you and you, too\nAnd I don't want your bitch, I gave your boo the boot, nigga\nReal spit, bitch, my wrist cost a— a coupe, nigga\n\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\n\nOoh, who is this lil' dude? Yeah\nDiamonds Audemars Piguet lightin' up the whole room, yuh\nNever leave my tool, huh, bitch, I ain't no fool, uh\nYou know how I move, yuh, cutthroat and I'm cruel (Cutthroat)\n\nNigga, yeah, ooh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\n\nOoh, yuh, play wit me you doomed\nI give clips quick like a movie coming soon, yeah\nGlizzock got the bitch, got your bitch actin' a fool, yeah\nGlizzock got your bitch actin' a fool at the room, yeah\n\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\n\nBitch, I'm smooth, uh, I'm one smooth lil' dude\nOnly 22, richer than you and your whole crew, nigga\nCall me Mr. Glock, I'm 'bout to take your ass to school, nigga\nShow you how to move, nigga, we live by no rules, nigga\nOhh, uh, one to the two, yuh\nMillion dollars on me worth of jewels, keep me cool, nigga\nHoppin' out the big body, but it's still a coupe, nigga\nBitch, I got the juice, ah, you can call me two-Glock\n\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah (Bitch I got the juice)\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nYou can call me two (Two) Glock (Glock, yeah)\nYes I got the juice, yuh, two, two, Glock, Glock\nBitch, I got the juice, yuh, yuh\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah\nOoh, yeah, ooh, yeah, ooh, yeah, ooh, yeah",
 "image": "https://images.genius.com/55ea8c170d51740ec69d4f6306be7930.1000x1000x1.png"
}