{
 "title": "Pump It Up",
 "album": "Joe Budden",
 "year": "2003-05-08",
 "lyrics": "Pump p-p pump pump p-p-p pump\nPump p-p pump pump it up\nPump p-p pump pump p-pump p-pump\nPump p-p pump pump it up\n(Just Blaze)\nPump p-p pump pump it up\nWe gon' do it like (uuh, uuh, uuh)\n\nLook, pump it up if you came to get it crunk\nWith a dame and shit that's drunk\nYou came to get it on\nMore than five O's in your bank then get it on\nRoll up like that stank and get it on\nSlank that fitted on, came to get it on\nHold up, she wanna work that, twerk that\nThen again let me hurt that, murk that\n'Til you got a hurt back\nCan't spit it out, boo, you gotta slurp that\nCan't cuddle after we done, it wasn't worth that\nJoey, I'm responsible for bringin' Jers' back\nAnd we bad, huh\nShe at the bar stylin', she throwin' it up\nShe drink a little hypno, throwin' it up\nBut I'm only dealin' with freaks that wanna cut\nMa, if you agree I wanna nut\nCamcorder, get it played late night on BET Uncut\n\nFellas – do your thing, let me do my thang\nI mean, do your thing, let me do my thang\nShorties – move that thing, mami move that thing\nC'mon, move that thing, mami move that thing\nHustlers – do your thing, let me do my thang\nPlease tell the DJ, pump-p-p-pump pump it up!\n\nI see some haters grillin'\nI see some ladies chillin'\nI see that girlie I been plottin' to get\nWe can hop in the whip\nAnd we can pump p p pump pump it up\n\nOkay, we was leavin', we was done\nThen she said, \"Can my peoples come?\"\nHere we go, I see it don't stop\nThey wanna ride in somethin' where the rims don't stop\nLook, baby, you fine, but your girlfriend's not\nAnd then she wanna hold out gettin' cute on the phone\nI ain't gotta be bothered, be cute on your own\nMy jump off doesn't run off at the mouth so much\nMy jump off never ask why I go out so much\nMy jump off never has me goin' out of my way\nAnd she don't want nothin' on Valentine's Day\nMy jump off don't argue or get rebellious\nAnd she don't mind hangin' out with the fellas\nMy jump off's not insecure or jealous\n\nFellas – do your thing, let me do my thang\nI mean, do your thing, let me do my thang\nShorties – move that thing, mami move that thing\nC'mon, move that thing, mami move that thing\nHustlers – do your thing, let me do my thang\nPlease tell the DJ, \npump p p pump pump it up!\n\nY'all dudes keep talkin' 'bout your ice and all the shine to it\nThat's a white gold cross with a real fine cubic\nMa wanna fall in love like I'm cupid\nTellin' me she don't give brain like I'm stupid\nYou can do anything if you put your mind to it\nGet it? No? Think about it\nThe game is bad, playa – ain't it bad, playa?\nDon't worry, Joey'll change it back, playa\nMighta heard me spittin' with Cain and Fab, playa\nI got the set boards to bring it back, playa\nBang and clap, playa\nFrontman no longer playin' the back, playa\nPlain as that, playa\n808's pumpin', bang the track, playa\nWant my second wind? Change the rap, playa\nJump off one-man-gang, I'm back, playa\nLook, what you want, bump double click pump\nRide, ride, swamp, dump off homie, jump off\nAll these haters on my (huh) won't jump off\nWhen all the streets need is J J J Jump off\nJ J Jump J J J J J Jump off, uuh, uuh, uuh\n\nFellas – do your thing, let me do my thang\nI mean, do your thing, let me do my thang\nShorties – move that thing, mami move that thing\nC'mon, move that thing, mami move that thing\nHustlers – do your thing, let me do my thang\nPlease tell the DJ, \npump p p pump pump it up!\nFellas – do your thing, let me do my thang\nI mean, do your thing, let me do my thang\nShorties – move that thing, mami move that thing\nC'mon, move that thing, mami move that thing\nHustlers – do your thing, let me do my thang\nPlease tell the DJ, \npump p p pump pump it up, nigga!",
 "image": "https://images.genius.com/a4ec44e9850774778aaebf31397cc665.300x300x1.jpg"
}