{
 "title": "Sick of Being Lonely",
 "album": "From Tha Roota to Tha Toota",
 "year": null,
 "lyrics": "Little shawty, we used to be on the phone all day\nTalkin' to the sunshine shinin' on my bald head\nNow today seem strange\nNo call on my celly, no name on my caller ID\nCallin' you up and ya OGs sayin' you ain't home\nWhat's really goin' on? I wanna know\nSo gimme a call and let's play no games\nI'm playin', you want the plane\nDon't point a finger over herre\nI bought you a fur coat for your birthday\nAnd this the things I get shorty?\nOver there you starin' mad\nThat I went out with them other chicks\nI told you they ain't shit!\nThey were just some buddies from high school that I went to\nWhere my old homies wanted me to kick it to 'em\nBut I called you up but you wasn't home\nBaby girl when you get this message, gimme a call\nI'll be waitin' at home\n\nI'm so sick of being lonely\nEvery night while my man goes out with his homies\nI wanna know how it feels to be loved, be loved\nSick of being lonely\nEvery night while my man goes out with his homies\nI wanna know how it feels to be loved, be loved\n\nAny other night, you'd be at home waitin' on me, yeah\n(What's goin' on?)\nAny other night, you'd be actin' like a bugaboo, ooh\n(What's goin' on?)\nAny other night, you'd be callin' me, stallin' me, ha\n(What's goin' on?)\nAny other night, I can guarantee a page from you, ooh\n(What's goin' on?)\n\nHmmm, but tonight seem different\nMan, it's about this fishy (I'm so confused)\nCuz I ain't even get shhhh\nMy wife ain't hit me on my pager or cell\nAnd when I CALL HER, I keep gettin' the damn voice mail\nWhat's goin' on? Yeah I know I'm wrong\nFor goin' and comin' home at 'bout four in the mornin'\nHopin' ya \"Home Alone\" like Caulkin\nBut I picked the wrong time, and respect will be expected\n\n\nI'm so sick of bein' lon-\nAHH, don't finish yo statement\nYou alone call me, I'll be yo replacement\nPut me in the game coach, you can let that lame go\nLet me lick you on your neck and go down to yo ankles\nCuz ain't no mo' better, freakier feller\nFrom the Field to creep wit', when ya guys are dummy\nHoney you lookin' good, and mo' gooder than a late of neck bones\nTenderized and yummy, the Energizer bunny can't compete with me\nCuz I be goin' and goin', rowin'\nWith mo' motion than ya ocean from night to mornin'\nHit it huffin' and puffin', breath stankin' and yawnin'\nSomething so pretty as you at home alone\nThat's unbelieveable, like when the cow jumped over the moon\nNow, I never put nothin' before you\nThat's like eatin' cereal, pickin' a fork over a spoon",
 "image": "https://images.genius.com/d619f3acab7d2bb55b4539b62c48e63c.500x500x1.jpg"
}