{
 "title": "The Jump Off",
 "album": "La Bella Mafia",
 "year": "2003-02-28",
 "lyrics": "Whoa! (Whoa!) Whoa! (Yeah)\nAiyyo Tim man this the jump off right here man! (Jump off!)\nWhoa! (Whoa!) Whoa! (Whoa!) Whoa! (It's Queen Bee nigga)\nIt's the jump off (Come on)\n\nI been gone for a minute now I'm back with the jump off (Jump off)\nGoons in the club incase somethin jumps off\nAnd back up before the hive let the pump off\nIn the graveyard is where you get dumped off\nAll we wanna do is party (Woo!)\nAnd buy everybody at the bar Bacardi (Woo!)\nBlack Barbie dressed in Bulgari\nI'm tryin to leave in somebody's Ferrari\nSpread love that's what a real mob do\nKeep it gangsta look out for her people (For her people)\nI'm the wicked bitch of the east, you better keep the peace (Aiyyo!)\nOr out come the beast\nWe the best still there's room for improvement\nOur presence is felt like a Black Panther movement\nSeven quarter to eights back to back with 'em (Back to back)\nAnd I'm sittin on chrome seven times platinum\n\nThis is for my peeps, with the Bentleys, the Hummers, the Benz\nEscalades twenty three inch rims (Oh!)\nJumpin out the Jaguar with the Tims, keep your bread up\nAnd live good, East coast West coast worldwide\nAll my playas in the hood stay fly\nAnd if your ballin let me hear you say right (Right)\n\nIt's Lil' Kim and Timbaland niggas shit ya drawers (Come on)\nSpecial delivery for you and yours (Now)\nI rep for bitches he rep for boys (Uh ha)\nIf you rep for your hood then make some noise\nI got my eye on the guy in the Woolrich coat\nDon't he know Queen Bee got the ill deep throat?\nUh! Let me show you what I'm all about\nHow I make a Sprite can disappear in my mouth....HO!!!!\nShake up the dice, throw down your ice (What)\nBet it all playa fuck the price\nMoney ain't a thing throw it out like rice\nBeen around the world cop the same thing twice\nRub on my tits (Huh!) squeeze on my ass (Oooh!)\nGimme some UH!!! step on the gas (Ah)\nPop the cork and roll up the hash (Roll it!)\nYou know what we about, sex, drugs and cash\n\nThis is for my peeps, with the Bentleys, the Hummers, the Benz\nEscalades twenty three inch rims (Oh!)\nJumpin out the Jaguar with the Tims, keep your bread up\nAnd live good, East coast West coast worldwide\nAll my playas in the hood stay fly\nAnd if your ballin let me hear you say right (Right)\n\nEnter the world of the Playboy pin up girl\nButtnaked dressed in nothin but pearls\nYou wanna meet me cause ya, know I'm freaky\nAnd ya, wanna eat me cause ya, say I'm sexy\nGot a man in Japan and a dude in Tahiti\nBelieve me sweety I got enough to feed the needy\nNo need to be greedy I got mad friends that's pretty (Hey!)\nChicks by the layers (And) all different flavors (Woo!)\nMafioso that's how this thing go (Yeah)\nNow everybody come get with the lingo\nShake your body body, move your body body (Body body)\nOn the dancefloor don't hurt nobody body (Body body)\nI'm the one that put the Range in the Rover\nWhen I'm steppin out the Range yo it's over\nComin through in the Brooklyn Mint gear\nWe 'gone do this just like Big Poppa was here\n\nThis is for my peeps, with the Bentleys, the Hummers, the Benz\nEscalades twenty three inch rims (Oh!)\nJumpin out the Jaguar with the Tims, keep your bread up\nAnd live good, East coast West coast worldwide\nAll my playas in the hood stay fly\nAnd if your ballin let me hear you say right (Right)\n\nYeah, to the what, yeah, oh, yo, keep your bread up, yeah, and worldwide\nAnd stay fly nigga, yeah man, right right right right, Queen Bee, LB\nTwo thousand and, fuckin three, why not? we makin it hot\nCome to, blow the spot, come on, yeah, Hey yo\nShe back at it, why wouldn't she be? come on, yeah\nB.I.G. Freaky Tah, yeah yeah yeah, L's, light 'em, oh\nHmm hmmm",
 "image": "https://images.genius.com/5910fd0422de03b55c4a00a86f730345.572x572x1.jpg"
}