{
 "title": "Wanksta",
 "album": "No Mercy, No Fear",
 "year": "2002-11-06",
 "lyrics": "Woo! Yeah\nIt's 50 a.k.a. Ferrari F-50\nBreak it down\nI got a lot of livin' to do 'fore I die\nAnd I ain't got time to waste\nLet's make it\n\nYou say you a gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou ain't no friend of mine (Yeah!), you ain't no kin of mine (C'mon!)\nWhat makes you think that I won't run up on you with a 9? (Uh-huh)\nWe do this all the time (What?), right now we on the grind (Yeah)\nSo hurry up and cop and go, we sellin' nicks and dimes (Uh-huh)\nShorty, she so fine, I gotta make her mine\nAn ass like that gotta be one of a kind (Woo!)\nI crush 'em every time, \npunch 'em with every line\nI'm fuckin' with they mind, I make 'em press rewind\nThey know they can't shine if I'm around to rhyme\nBeen on parole since '94 'cause I commit the crime\nI send you my line, I did a three-to-nine\nThe D's ran up in my crib, you know who droppin' dimes\n\nYou say you a gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou go to the dealership, but you don't never cop nothin'\nYou been hustlin' a long time and you ain't got nothin'\nYou say you a gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou go to the dealership, but you never cop nothin'\nYou been hustlin' a long time and you ain't got nothin'\n\nDamn, homie\nIn high school you was the man, homie\nThe fuck happened to you?\nI got the sickest vendetta when it come to the cheddar (Uh-huh)\nNigga, you play with my paper, you gon' meet my Beretta\nNow Shorty think I'ma sweat her (Uh-huh) sippin' on Amaretto (Yeah)\nI might hit once, then dead her, I know I can do better\nShe look good, but I know she after my cheddar\nShe tryin' to get in my pockets, homie, and I ain't gon' let her\nBe easy, start some bullshit, you get your whole crew wet\nWe in the club doin' the same old two-step\nGuerrilla Unit, cuz, they say we bugged out\n'Cause we don't go nowhere without toast, we thugged out\n\nYou say you a gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou go to the dealership, but you don't never cop nothin'\nYou been hustlin' a long time and you ain't got nothin'\nYou say you a gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou go to the dealership, but you never cop nothin'\nYou been hustlin' a long time and you ain't got nothin'\n\nMe I'm no mobster, me I'm no gangsta\nMe I'm no hitman (Yeah), me I'm just me, me\nMe I'm no wanksta, me I'm no actor\nBut it's me you see on your TV\n\n'Cause I hustle, baby, this rap shit is so easy\nI'm gettin' what you get for a brick to talk greasy (Woo!)\nBy any means, partner, I got to eat on these streets\nWhen you play me close for sure I'm gonna pop my heat\nNiggas sayin' they gon' murk 50, how?\nWe ridin' 'round with guns the size of Lil Bow Wow\nWhat you know about AK's and AR-15's\nEquipped with night vision, shell catchers and inf-beams, huh?\n\nYou say you gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou go to the dealership, but you never cop nothin'\nYou been hustlin' a long time and you ain't got nothin'\nYou say you a gangsta, but you never pop nothin'\nWe say you a wanksta and you need to stop frontin'\nYou go to the dealership, but you never cop nothin'\nYou been hustlin' a long time and you ain't got nothin'\n\nAha! Damn, homie",
 "image": "https://images.genius.com/ae24b2f36aa259b0e403d9eef8d0336f.300x300x1.jpg"
}