{
 "title": "What Would You Do?",
 "album": "Body Kiss",
 "year": "2003-05-06",
 "lyrics": "Hello, ladies (Hello)\nHow are y'all doin' tonight? (Fine)\nCan I keep it real? (Yes)\nAnd say what's on my mind (Yes)\n\nThere you are in that chair\nWaiting for me to take you there\nTo break it down and sing to you\nAnd make you feel these words are true\nWho's gonna be the lucky one?\nWho spend some money on 'em and have some fun? Tell me\nI choose you\n\n(What would you do) What would you do if I said all of these words were true?\n(What would you) What would you do if I came down here and sat with you?\n(What would you do) What would you do if I told the band to break it down?\n(Ooh) What would you do if I said I wanna lay you down?\n(What) What would you do if I put this money in your hand?\n(Would you do) What would you do if I said I'd like to be your man?\n(What would you do, baby?) What would you do if I brought you up here on this stage?\nWhat would you do? (Tell me) What would you do?\n\nThe lights are down (Yeah), the mood is set (Yeah)\nThe sound is right, I'm heated\nLook to my left and check my crowd\nLook to my right (Yeah) to see if they are ready now\nTell me who out there feels lucky\nWants me to take 'em shopping and buy 'em everything\nHmm, I choose you\n\n(Now what would you do, yeah) What would you do if I said all of these words were true?\n(What would you do) What would you do if I came down here and sat with you?\n(What, what) What would you do if I told the band to break it down?\n(Break it down) What would you do if I said I wanna lay you down?\n(Ow) What would you do if I put this money in your hand?\n(Out this money on your hand, baby) What would you do if I said I'd like to be your man?\n(Be your man) What would you do if I brought you up here on this stage?\n(Right up here) What would you do? What would you do?\n\n(What if I got your) Hair done (Yeah), nails done (Yes, I will)\nToes done (And) bank account (I'll even take you)\nShopping (Girl, I will) if you be good (You'll have)\nYour own car (And the) platinum credit cards\n\n(What would you do, baby?) What would you do if I said all of these words were true?\n(What would you do?) What would you do if I came down here and sat with you?\n(What would you do, girl?) What would you do if I told the band to break it down?\nWhat would you do if I said I wanna lay you down?\n(Said I gotta know, I've gotta know, ow)\nWhat would you do if I put this money in your hand?\n(Right in your hand) What would you do if I said I'd like to be your man?\n(Girl, what would you do? Ow) What would you do if I brought you up here on this stage?\n(On this stage) What would you do? (What) What would you do?\n(Ladies, it's showtime) What would you do if I said all of these words were true?\n(Sit back and unwind) What would you do if I came down here and sat with you?\n(I'm 'bout to make you mine) What would you do if I told the band to break it down?\n(Ow) What would you do if I said I wanna lay you down?\n\nI wanna know, I wanna know, I wanna know, I wanna know\nI wanna know, I wanna know, I wanna know, I wanna know\nWhat would you do? What would you do? What would you do? What would you do?\nWhat would you do? What would you do?",
 "image": "https://images.genius.com/9857bdf6788bb3ccdf626c37c3efd88c.600x600x1.jpg"
}