{
 "title": "What Happened to That Boy?",
 "album": "Birdman",
 "year": "2002-11-26",
 "lyrics": "Aye, aye, aye, ya\nTote 'em up, light it up nigga\nBirdman, motherfucker\nClipse, VA, NO nigga, what you smelt\nCoca leaf plastic\nGet off the border, motherfucker\nCome on little'n handle your business for me, boy\n\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n\nI heard they snitching on a player, man, say it ain't so\nEven as a young'un they consigned me to blow\nWhich explains why I'm worth my weight in gold\nWhile they was taking baby steps from an 8th to an O\nWord in the streets that the envy is me\nEnough ice on that watch to make a nigga lose sleep\nMagnified face help the bitch see clearly\n9 on the waist, hit the bitch up severely\nI'm known for the flip of that cocaína\nI'm heavy in the street like the 7 series Beema' man\nHit 'em with the Nina, man\nOr that 4/5th guaranteed to lean ya man, whoa\nI'm the reason that your block is vacant\nMalicious will hit you just to make a statement\nBitch! Clipse and Cash Money, who ain't rich?\nDon't compare me to you, nigga, you ain't this, whoa\n\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n\nStunna and Patty Cake, the worldwide Pusha\nBirdman, nigga, leave the guns in the bushes\nBeen shitting up bricks, unload 'em to Gussy\nBoss of the ghetto with the round-shape cookie\nShit one, throw one, nigga, flood the block\nIf I don't go to jail, nigga, birds gon' flock\nNigga sitting on the toilet, bitch, get off the pot!\nThe bird just landed so the hood gonna rock\nNew whips, big chips, the Prada/Gucci shit\nBought mami a fly Benz, the wide skinny lips\nShe takes my flight, she holds my weight\nWhile the po-po staked out from state to state\nIt ain't nothing to a baller, baby, pay the cost\nBig money, heavy weight, Birdman, hood boss, baby\nStepping on my line, I'll show a little something\nMake Corleone come out and the black crow'll touch ya\n\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n\nYuugh! Another soul lost\nHad to make his shirt match my oxblood-colored Porsche\nYuugh, the rims match, of course\nBlood hit his Timbs, it reminded me of them\nGlistening, wrist on chiller\nGun in the same palm, a gorgeous killa\nI put this on my Lord\nMy niece was four when she felt chinchilla\nI passed the chauffeur that shit\nThat made fiends rise from the dead like \"Thriller\"\nGangster, hustler\nAt night, still found time to kiss my mother\nLive like I'm dreaming, kick my feet up\nGun poked my waist, remind me of my demon\nSo quit your yappin' before I get to clappin'\nAnd have your body parts mix and matchin', fella\n\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit, we put a clap into that boy\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\n(Brrrrrrrrrrr!) What happened to that boy?\nHe was talking shit we put a clap into that boy\n\nAye, aye, aye, aye, there it is nigga, there you have it\nBirdman, Clipse you under-smelt, VA, you know?\nUptown nigga, we go anywhere with this bullshit\nWe flip bricks you under-smell (gangster motherfucker)\nAye nigga put this puzzle together\nAye Pharrell, you did this year (you did it nigga)\n1000 pieces, puzzles, (startrak) 100, you know\nLet's get this money (get the money)\nHey nigga, I smell somethin', coca leaf plastic, bitch\nGet money, motherfucker (biatch!)\nHowever you want it, you can get it, pimp\nFrom gangsta to blood, nigga, take it how you want it, nigga\nWe did it how we live, ain't nothin' but the thug thing, nigga\nMoney thing, motherfucker",
 "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg"
}